[
    {
        "content": "<p>I've written a very basic proof of concept of a lamdera - like platform that allows direct communication between the backend and frontend through a websocket. </p>\n<p>You're welcome to check it out at <a href=\"https://github.com/kamenchunathan/galena\">Galena</a><br>\nIt's very simplistic and has only the barebones features required for this to meet the definition of the platorm.<br>\nIt uses wasm for the fronted written in zig as is required for all current wasm implementations. rust for the backend and has  javascript to handle the websocket messages and ui. The ui written was very quickly done and is very barebones with only buttons, divs, text and onclick events. There is no virtual dom and all code is rerendered. There is no deallocation and each rerender continuously leaks memory. There are a number of types that are not supprted as the intermediate toBackend and toFrontend message types such as tagged unions which is a major limitation but a blueprint for further progress is present</p>\n<p>Contributions, Bug reports and collaboration is welcome and<br>\nHelp with the UI layer with someone who has more experience in handling UIs in wasm would be appreciated</p>",
        "id": 518009288,
        "sender_full_name": "Nathan Kamenchu",
        "timestamp": 1747213350
    },
    {
        "content": "<p><a href=\"https://github.com/kamenchunathan/galena\">https://github.com/kamenchunathan/galena</a></p>",
        "id": 518009330,
        "sender_full_name": "Nathan Kamenchu",
        "timestamp": 1747213362
    },
    {
        "content": "<p>Very cool!</p>",
        "id": 518063042,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1747228469
    },
    {
        "content": "<p>whoa, super cool! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 518405789,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1747345552
    }
]