[
    {
        "content": "<p><a href=\"https://github.com/lukewilliamboswell/roc-htmx-playground/pull/12\">https://github.com/lukewilliamboswell/roc-htmx-playground/pull/12</a></p>",
        "id": 565476084,
        "sender_full_name": "nandi",
        "timestamp": 1766789698
    },
    {
        "content": "<p>Thank you. </p>\n<p>Hopefully we can upgrade to the new compiler soon. Just need to get our rust platforms like basic-cli and basic-webserver upgraded first <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 565480194,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1766795941
    },
    {
        "content": "<p>Has anyone here checked out Datastar?</p>",
        "id": 569613810,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769128033
    },
    {
        "content": "<p>Looks pretty cool</p>",
        "id": 569614067,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769128232
    },
    {
        "content": "<p>I've been working on a roc-dom platform in my spare time.</p>",
        "id": 569614118,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769128263
    },
    {
        "content": "<p>Datastar could be a nice package to go with basic-webserver</p>",
        "id": 569614196,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769128321
    },
    {
        "content": "<p>I have long been interested in HTMX (javascript-hater).  Carson Gross is giving a talk alongside Richard in July in Missouri <a class=\"stream-topic\" data-stream-id=\"306878\" href=\"/#narrow/channel/306878-off-topic/topic/Conference.20Suggestions/with/569601285\">#off topic &gt; Conference Suggestions</a> .  I looked at Datastar as an alternative.  I was trying remember its name, in the shower this morning.  All I could think of was \"WS-deathstar\", back in the SOAP/REST holy wars with Ryan Tomayko</p>",
        "id": 569615511,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769129207
    },
    {
        "content": "<p>From what I understand, it's a smaller library that gives you more power than htmx by putting even more of the logic and control for http on the server-side, using the more flexible approach of SSE and declarative signals that allow it to replace htmx, Alpine, React etc.</p>\n<p>The creator isn't as good at meme-marketing and is more disagreeable on twitter, but I think it's a better tech, especially for a non-JS framework or web server where you want to allow people as much as flexibility as possible and to do as much as possible in your server-side language.</p>",
        "id": 569616838,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769129982
    },
    {
        "content": "<p>Yes -- I think there is a \"culture\" aspect to both communities -- but HTMX was first so I am partial, but I am a big fan of \"second system syndrome\" where the following system is technically better.</p>",
        "id": 569617956,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769130819
    },
    {
        "content": "<p>I think the internal culture of the datastar community is great. Delaney just gets in disputes on twitter with React and htmx people, and prolongs them, which Carson avoids better.</p>\n<p>And yeah Delaney was an htmx dev who left because he was frustrated with the limitations. Carson even acknowledged at one point that datastar is \"probably the better approach\".</p>",
        "id": 569620565,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769132787
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/channel/304902-show-and-tell/topic/made.20an.20updated.20fork.20of.20htmx.20playground/near/569614196\">said</a>:</p>\n<blockquote>\n<p>Datastar could be a nice package to go with basic-webserver</p>\n</blockquote>\n<p>Sorry to turn this into a Datastar thread. I'm just obsessed with Datastar and I think it's awesome that you're working on this type of thing. If you wanted to give it a try you can reach out to Delaney with any questions. He's very helpful with anyone who is open minded. And others on the Datastar discord can help out too.</p>\n<p>Just today they completed this one-page version of the tutorial and reference for LLM, search etc: <a href=\"https://data-star.dev/docs\">https://data-star.dev/docs</a></p>",
        "id": 570200347,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769466601
    },
    {
        "content": "<p>I haven't progressed my roc-dom platform much lately... I switched my focus to roc-ray for graphics and working on Roc compiler bugs or tooling upgrades. Only so many hours in the day <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> </p>\n<p>But definitely looking forward to restarting the front-end web efforts soon - I think after we land the LLVM backend the <code>.wasm</code> modules Roc produces will be tiny again and that will be a good time to revisit this work -- it sill needs some re-engineering to be really usable... I went for the more ambitious approach to implement a VDOM to minimise the traffic across the JS&lt;-&gt;WASM boundary.</p>",
        "id": 570204030,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769468404
    },
    {
        "content": "<p>For background <span class=\"user-mention\" data-user-id=\"524503\">@Niclas Ahden</span> has been using his Joy platform <a href=\"https://github.com/niclas-ahden/joy\">https://github.com/niclas-ahden/joy</a> for a while now and shared in the meetup that it's working well. </p>\n<p>That uses an API more akin to the Elm architecture. </p>\n<p>The <code>roc-dom</code> idea I've been experimenting with is Richard's vision for <a href=\"https://docs.google.com/document/d/16qY4NGVOHu8mvInVD-ddTajZYSsFvFBvQON_hmyHGfo\">Action State</a> -- which is a bit different.</p>",
        "id": 570204918,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769468856
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1016544\">@Alec Gargett</span> <br>\nI'd be interested to know if you've used or considered using inertia.JS?<br>\nI've investigated it a little bit, and I've used hotwire which is a lot like htmx and friends.<br>\nI think if I wanted a bsckend frontend combo that weren't one of the highly integrated frameworks like sveltekit, it would be my first port of call.</p>\n<p>Mainly this is because I feel like all these htmx like libraries don't address the issue of components and scoped css. In a big project, or when adding to a big legacy project I almost always want css localized to a component. For isolation, but also for per page css trimming. Because different parts of the app/site are likely to have different styles. <br>\nAlso I often want simple components that I can drop anywhere that have inputs and logic and styling combined.</p>\n<p>Just my thoughts after having tried hotwire a bunch and determined I'd much rather write svelte than html. Even if it's mostly ssr</p>",
        "id": 570221324,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1769479223
    },
    {
        "content": "<blockquote>\n<p>don't address the issue of components and scoped css</p>\n</blockquote>\n<p>I think this is the main idea behind Action-State -- what would that look like in Roc</p>",
        "id": 570223840,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769480888
    },
    {
        "content": "<p>Remix (the react version) does a version of scoped css that looked nice to me, although I haven't used it for real. My impression is that the tricks for getting scoped css are kind of orthogonal to the different kinds of state management.</p>",
        "id": 570225341,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769482039
    },
    {
        "content": "<p>I'd have to re-read the action-state doc, because it's been a while. But I wonder if Roc's open unions plus the new procedural niceties make one of the more event-oriented patterns (like solid/leptos or the sort of manual events they're doing in Remix 3) a potentially good fit.</p>\n<p>Actually looking at it again, maybe action-state is kind of like Remix 3? Or has some things in common, anyway. You explicitly choose when to re-render by calling <code>Action.update</code>, and there's no re-renders if you don't say to re-render? If I understand that right, it'd be similar. The lensy thing with <code>Elem.translate</code> looks different. But I wonder if static dispatch changes that API in a way that makes it suddenly look more similar, though.</p>",
        "id": 570226259,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769482770
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/channel/304902-show-and-tell/topic/made.20an.20updated.20fork.20of.20htmx.20playground/near/570204030\">said</a>:</p>\n<blockquote>\n<p>I haven't progressed my roc-dom platform much lately... I switched my focus to roc-ray for graphics and working on Roc compiler bugs or tooling upgrades. Only so many hours in the day <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> </p>\n</blockquote>\n<p>No worries. At some point I will try to implement something very basic in datastar and Roc myself, in a few months at the earliest, like just get the basic SSE function set up, if no one else has already done it by then.</p>",
        "id": 570230152,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769485714
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"651372\">@Eli Dowling</span> </p>\n<p>I've never heard of it. Thanks for letting me know about it. I'll check it out.</p>\n<p>Datastar have a web components integration system (Rocket) and a CSS system in development (Stellar) and they look great but they are part of the paid Datastar Pro.</p>",
        "id": 570230308,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769485854
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"651372\">Eli Dowling</span> <a href=\"#narrow/channel/304902-show-and-tell/topic/made.20an.20updated.20fork.20of.20htmx.20playground/near/570221324\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"1016544\">Alec Gargett</span> <br>\nJust my thoughts after having tried hotwire a bunch and determined I'd much rather write svelte than html. Even if it's mostly ssr</p>\n</blockquote>\n<p>When you're using Datastar you are mostly working in your server-side language of choice. I don't think you're doing more html than you would be doing in Svelte, maybe less, but I could be wrong.</p>",
        "id": 570230459,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769485983
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"430894\">Dan G Knutson</span> <a href=\"#narrow/channel/304902-show-and-tell/topic/made.20an.20updated.20fork.20of.20htmx.20playground/near/570226259\">said</a>:</p>\n<blockquote>\n<p>I wonder if Roc's open unions plus the new procedural niceties make one of the more event-oriented patterns (like solid/leptos or the sort of manual events they're doing in Remix 3) a potentially good fit.</p>\n</blockquote>\n<p>I think with all of those tools you'll end up writing less Roc and a lot more Javascript/Typescript, compared to something like htmx and especially datastar, unless you're writing your own plugins for datastar in which case you'll be doing the same.</p>\n<p>Of course the functionality isn't exactly the same so it depends what you're doing. But even just the standard free version of Datastar will allow you to control more of the front end behaviour with Roc itself than other systems, so I think it's a good default if you want to do as much as possible of the logic in Roc itself (or whatever your preferred language is).</p>",
        "id": 570231420,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769486733
    },
    {
        "content": "<blockquote>\n<p>I think with all of those tools you'll end up writing less Roc and a lot more Javascript/Typescript, compared to something like htmx and especially datastar, unless you're writing your own plugins for datastar in which case you'll be doing the same.</p>\n</blockquote>\n<p>Ah, sorry, what I mean is the state management patterns, not literally using those libraries. Like ways you could implement a Roc-only UI, either for a desktop app or for a compiled-to-wasm frontend webapp. The action-state doc was about a Roc-focused state management pattern for that kind of all-Roc client-side app. I'm curious if stealing the state management patterns from those JS libraries is viable for an all-Roc UI state management system, or if there are already similarities between how they work and the action-state doc.</p>",
        "id": 570231874,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769487131
    },
    {
        "content": "<p>Ah Ok gotcha</p>",
        "id": 570232137,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769487362
    },
    {
        "content": "<p>I think those libraries are trying to get around all of the issues with using so much Javascript in the browser with more Javascript, so if your goal is doing something with wasm it's probably better to just copy whatever Odin developers have been doing.</p>",
        "id": 570232358,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769487589
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"651372\">Eli Dowling</span> <a href=\"#narrow/channel/304902-show-and-tell/topic/made.20an.20updated.20fork.20of.20htmx.20playground/near/570221324\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"1016544\">Alec Gargett</span> <br>\nI'd be interested to know if you've used or considered using inertia.JS?</p>\n</blockquote>\n<p>Just had a quick look. Looks neat. I'd need to try it to figure out if it's a good approach. I think I'd prefer to do all of the logic including templating in the backend language and just send html or text, an avoid the JS frameworks altogether, but I guess it depends on your mental model and much you like the framework components vs html components and templating.</p>",
        "id": 570232736,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1769487871
    },
    {
        "content": "<p>I find the model of having one system for both frontend interactivity and props/templating is nice.<br>\nDataStar obviously provides signals which I imagine helps but in the past I've found thst disconnect frustrating whenever I need to cross into a more interactive frontend component.</p>",
        "id": 570236537,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1769490775
    }
]