[
    {
        "content": "<p>I implemented a TreeSet and a TreeDict in roc using a red-black tree and opaque types - <a href=\"https://github.com/benplotke/roc-ordered-collections\">https://github.com/benplotke/roc-ordered-collections</a></p>\n<p>I couldn't make them into packages because <a href=\"https://www.roc-lang.org/abilities#sort-ability\">Sort</a> has not been implemented yet and importing custom abilities does <a href=\"https://github.com/roc-lang/roc/issues/6702\">not work</a>.</p>\n<p>I am interested in contributing by working on either implementing Sort ability or implementing importing of custom abilities, but I am apprehensive given how little Rust I know and the complexity of the Roc compiler.</p>",
        "id": 439797966,
        "sender_full_name": "Ben Plotke",
        "timestamp": 1716291659
    },
    {
        "content": "<p>Cool stuff, <span class=\"user-mention\" data-user-id=\"477725\">@Jasper Woudenberg</span> is working on the sort ability, he <a href=\"#narrow/stream/395097-compiler-development/topic/builtin.20contains.20a.20signature.20without.20implementation/near/439349984\">hit a curious error</a> that you may be able to help figure out, even with limited Rust knowledge.</p>",
        "id": 439798425,
        "sender_full_name": "Anton",
        "timestamp": 1716291826
    },
    {
        "content": "<p>Glad to hear that is in progress! I will take a look, but I am not too hopeful I will be able to help.</p>",
        "id": 439799973,
        "sender_full_name": "Ben Plotke",
        "timestamp": 1716292428
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"691288\">@Ben Plotke</span> if you're interested, there might be some opportunities to collaborate on implementing <code>Sort</code>. Apart from the curious error Anton mentioned, we need low level implementations of the compare function for builtin types, which we could pick up in parallel. If you're interested let me know, we could maybe pair a bit to get oriented on the problem, or I could write up what I've learned so far. No pressure though!</p>",
        "id": 439808994,
        "sender_full_name": "Jasper Woudenberg",
        "timestamp": 1716295559
    },
    {
        "content": "<p>I would love to pair to get up to speed and start contributing. I'll switch to DM for scheduling</p>",
        "id": 439848796,
        "sender_full_name": "Ben Plotke",
        "timestamp": 1716306868
    }
]