[
    {
        "content": "<p>Roc platform for graphics and GUI using zig and raylib.</p>\n<p>This platform is still very experimental, but just wanted to share that I've updated the README, and now we have a few examples. </p>\n<p><a href=\"https://github.com/lukewilliamboswell/roc-ray\">https://github.com/lukewilliamboswell/roc-ray</a></p>\n<p>It's working on apple silicon macos and ubuntu-x64 which is cool (just found a bug reading the mouse position on linux).</p>",
        "id": 419586525,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1706947010
    },
    {
        "content": "<p>I'm currently experimenting with the flutter layout algorithm which I hope can make GUIs awesome, but that's early days</p>",
        "id": 419586627,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1706947088
    },
    {
        "content": "<p>Exciting :)</p>",
        "id": 419591289,
        "sender_full_name": "Anton",
        "timestamp": 1706951778
    },
    {
        "content": "<p>did you see <span class=\"user-mention\" data-user-id=\"432314\">@Martin Stewart</span>'s <a href=\"https://github.com/MartinSStewart/town-collab/blob/master/src/Ui.elm\">https://github.com/MartinSStewart/town-collab/blob/master/src/Ui.elm</a> ?</p>",
        "id": 426028507,
        "sender_full_name": "Erkal Selman",
        "timestamp": 1710200524
    },
    {
        "content": "<p>it would be so nice to have something like imgui: <a href=\"https://flyover.github.io/imgui-js/example/\">https://flyover.github.io/imgui-js/example/</a></p>",
        "id": 426028750,
        "sender_full_name": "Erkal Selman",
        "timestamp": 1710200692
    },
    {
        "content": "<p>No I hadn't seen that, looks really interesting! </p>\n<p>roc-ray was an interesting experiment, and there is still a lot of potential. I think it would be achievable to build out the imgui functionality today, as most of the infrastructure is there and working well. </p>\n<p>I didn't get as far with the Action-State exploration as I hoped, I think there is still more to explore there.</p>\n<p>I haven't touched it for a few weeks, but I have been keenly following the developments in <a href=\"https://machengine.org\">machengine (zig)</a> and <a href=\"https://github.com/linebender/xilem\">linebender (rust)</a> as they both look like really promising directions for underlying GUI platforms for roc. Or possibly to use roc as the scripting or plugin language for an application written with those libraries. machengine is going the direction of an ECS and they have some cool ideas like gkurve which I think might result in really high performance for GUI. The linebender approach is also interesting with the rust community collaborating towards GUIs and also focussing on GPUs.</p>",
        "id": 426029491,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1710201267
    },
    {
        "content": "<p>in <a href=\"https://machengine.org/pkg/\">this page</a>, he says</p>\n<blockquote>\n<p>We especially avoid high-level C/C++ libraries, such as e.g. Dear Imgui, because in such cases it would be very tempting to want to dive into the internals and adjust things - and we don’t want our users to have to dive into a C/C++ codebase to make changes. In these cases, we intentionally make a choice to write a pure-Zig version instead, even though the initial experience results in less features and capabilities. It is the short-term price we pay to have a better long-term future.</p>\n</blockquote>",
        "id": 426891068,
        "sender_full_name": "Erkal Selman",
        "timestamp": 1710595662
    }
]