[
    {
        "content": "<p>Just wanted to share an update for platform template repositories. Mostly copied from platform-switching examples for now. The idea is to have a more idiomatic example using the host language ecosystem e.g. <code>build.rs</code>, or <code>build.zig</code> etc.</p>\n<p><a href=\"https://github.com/lukewilliamboswell/roc-platform-template-go\">https://github.com/lukewilliamboswell/roc-platform-template-go</a><br>\n<a href=\"https://github.com/lukewilliamboswell/roc-platform-template-swift\">https://github.com/lukewilliamboswell/roc-platform-template-swift</a><br>\n<a href=\"https://github.com/lukewilliamboswell/roc-platform-template-zig\">https://github.com/lukewilliamboswell/roc-platform-template-zig</a><br>\n<a href=\"https://github.com/lukewilliamboswell/roc-platform-template-rust\">https://github.com/lukewilliamboswell/roc-platform-template-rust</a><br>\n<a href=\"https://github.com/lukewilliamboswell/roc-platform-template-c\">https://github.com/lukewilliamboswell/roc-platform-template-c</a></p>\n<p>I figured it would be useful to share what I have so far, however there are a couple of changes I would like to make in the short term; </p>\n<ul>\n<li>update to an API of <code>main : Task {} [Exit I32 Str]_</code> instead of <code>main : Str</code> as that will be more useful as a starting point, and also to include an example effect in the host.</li>\n<li>update the build script to support surgical linking. At the moment only the rust template has this. This should be straight forward; we build the app into a dynamic library first, and then build the host loading the app as a dynamic library instead of linking with a static library, so we can pre-process the executable for the surgical linker.</li>\n</ul>\n<p>Things I think will be helpful in the medium/long term;</p>\n<ul>\n<li>include a std library implementation for e.g. <code>RocStr</code>, <code>RocList</code> for these languages</li>\n<li>develop the glue scripts to generate the types for a specific platform, I'm currently thinking a package with common data structure and functions will also be helpful here... though this needs further investigation. Another idea is to first transform the glue types provided by the compiler into an intermeditate representation and then code gen the source, which should be much easier to test and maintain.</li>\n</ul>",
        "id": 439354246,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716038013
    },
    {
        "content": "<p>Another idea -- add example github actions for packaging and docs</p>",
        "id": 439355256,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716038988
    },
    {
        "content": "<p>I've updated the zig platform to use a Task based API now.</p>\n<p>If anyone with some Zig experience is able to cast their eyes over it, that would be appreciated. </p>\n<p>Maybe <span class=\"user-mention\" data-user-id=\"720794\">@Silver</span> you are interested?</p>",
        "id": 439376478,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716059284
    },
    {
        "content": "<p>Ia there a reason why the roc examples shows JVM interop as opposed to a platform? What is the main distinction?</p>",
        "id": 439387522,
        "sender_full_name": "Damian Reeves",
        "timestamp": 1716072190
    },
    {
        "content": "<p>I haven't looked at that example (I haven't used Java before). But my guess is that for the JVM we need to have the host toolchain drive the linking. So we compile the roc app into an object first using <code>roc build --no-link</code> and then use the C header and FFI to call into roc.</p>",
        "id": 439405973,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716092374
    },
    {
        "content": "<p>That is a similar workflow to the <code>roc-wasm4</code> platform, where we have zig control the build so we have finer control over the memory layout of the final <code>.wasm</code> library, but in this case it is so we can interop in a way that works for Java.</p>",
        "id": 439406072,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716092432
    },
    {
        "content": "<p>Some updates to the above;</p>\n<ul>\n<li><strong>Go, Zig &amp; Rust Examples:</strong> We now re-generate glue files with each build. This is using a URL release of a new package <a href=\"https://github.com/lukewilliamboswell/roc-glue-code-gen/tree/main\">lukewilliamboswell/roc-glue-code-gen</a>, so we don't need to hard code these files. As we make improvements to the glue package this will automatically reflected in the generated files. For now, this is limited to hand-rolled <code>roc_std</code> implementation, next step is to generate the specific types for any platform.</li>\n<li><strong>Zig Example:</strong> <code>build.zig</code> now cross-compiles for all of the supported targets at once. This is a really nice experience when packaging the platform as we can bundle all the prebuilt-binaries from one machine. I haven't been able to test all of these combinations, but it looks like it should work, if you test this please let me know if it works for you. </li>\n<li><strong>Zig Example:</strong> <code>build.roc</code> uses <code>-Doptimize=ReleaseSmall</code> which gives small prebuilt-binaries. The whole <code>platform/</code> folder is only <code>610KB</code> in total size on my machine; this includes all of the binaries and platform source files.</li>\n</ul>",
        "id": 439506303,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716185519
    }
]