[
    {
        "content": "<p>Hello, <br>\nI wrote a platform that enables writing AWS Lambda functions with Roc: <a href=\"https://github.com/isaacvando/roc-aws-lambda\">roc-aws-lambda</a>. It should work pretty well although I have not tested it rigorously. Right now Lambdas can only be compiled on Linux, but I hope to expand that to MacOS also. I had a lot of fun writing the platform and I hope some folks can enjoy using it too. Please open an issue if you run into any! The platform is written in Rust and uses the <a href=\"https://github.com/awslabs/aws-lambda-rust-runtime\">aws-lambda-rust-runtime</a> under the hood. It is very cool to be able to write lambdas in a language like Roc and still get the excellent startup/runtime performance of the Rust runtime <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 425738071,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1710039672
    },
    {
        "content": "<p>I may write a GitHub actions workflow to build and deploy a lambda. That way non-Linux users could still write them and use roc check locally but not need to compile locally.</p>",
        "id": 425741581,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1710043716
    },
    {
        "content": "<p>That sounds like a great idea. I also wondered if you could have a dockerfile that runs it locally?</p>",
        "id": 425742156,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1710044435
    },
    {
        "content": "<p>Yes that’s a great idea</p>",
        "id": 425742180,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1710044471
    },
    {
        "content": "<p>That is awesome! Nicely done.</p>",
        "id": 425862353,
        "sender_full_name": "Norbert Hajagos",
        "timestamp": 1710147294
    },
    {
        "content": "<p>I created another repo with a Lambda runtime written in Roc that only uses basic-cli here: <a href=\"https://github.com/isaacvando/roc-aws-lambda-runtime\">roc-aws-lambda-runtime</a>. </p>\n<p>I didn't realize this was possible at first and it is better than the platform in many ways: no direct dependency on Rust is necessary, Lambdas can be compiled from non-linux systems easily, it is easy to test your lambda locally, and there is no need to use a different platform than normal. The downside is that right now it is very slow. I'm not sure why it is so slow, and I'm sure it can be sped up, but I have not yet taken the time to look into what is going on.</p>\n<p>The runtime depends on some unreleased changes in basic-cli so I've included the platform directly, but it can be moved to a url once a new release of basic-cli is out.</p>",
        "id": 426830029,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1710540635
    },
    {
        "content": "<p>I updated the custom Lambda runtime to basic-cli 18 and the slowness I had seen in the past is now gone <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span>. I'm very pleasantly surprised that AWS supports writing Lambda functions in Roc in such a lightweight way.</p>\n<p>New repo url for the runtime: <a href=\"https://github.com/isaacvando/roc-aws-lambda\">https://github.com/isaacvando/roc-aws-lambda</a></p>",
        "id": 491917416,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1736033280
    },
    {
        "content": "<p>I did some very simple benchmarking comparing a hello world lambda in Roc and one in Rust using function urls:</p>\n<div class=\"codehilite\"><pre><span></span><code>$ artillery quick --count 10 -n 10 &lt;FUNCTION_URL&gt;\n</code></pre></div>\n<p>I haven't dug into why the tail latency is worse for the Roc function, but there is probably a way to improve it. Regardless, this is very usable.</p>\n<p>Roc<br>\nhttp.response_time:<br>\n  min: 86<br>\n  max:  182<br>\n  mean: 111.4<br>\n  median:  106.7<br>\n  p95:  156<br>\n  p99: 179.5</p>\n<p>Rust<br>\nhttp.response_time:<br>\n  min:  83<br>\n  max:  99<br>\n  mean: 88.7<br>\n  median:  87.4<br>\n  p95: 94.6<br>\n  p99: 98.5</p>",
        "id": 491917726,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1736033562
    },
    {
        "content": "<p>Wow, awesome</p>",
        "id": 491927492,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1736043653
    }
]