[
    {
        "content": "<p>Hi all, I was curious if there is a way to link to the roc compiler so that I can embed it in a program?</p>",
        "id": 562374998,
        "sender_full_name": "Lukas Hermann",
        "timestamp": 1765157096
    },
    {
        "content": "<p>I recognize that the new compiler is still immature so this could be a \"nice to have\" in the future.</p>",
        "id": 562375043,
        "sender_full_name": "Lukas Hermann",
        "timestamp": 1765157135
    },
    {
        "content": "<p>There are plans for a libroc though we don't have a library published or easy to use yet</p>",
        "id": 562375507,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1765157691
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"671544\">Lukas Hermann</span> has marked this topic as resolved.</p>",
        "id": 562375523,
        "sender_full_name": "Notification Bot",
        "timestamp": 1765157709
    },
    {
        "content": "<p>Currently for the roc WASM playground we compile various roc modules using zig, so we know there are minimal dependencies and everything works nicely cross-platform (U32/U64 etc). </p>\n<p>The zig modules are available via github, which is how I use the builtins in the zig platform template. So in theory it should be pretty easy to embed the whole compiler, the challenges at the moment comes from the BuildEnv which is used to schedule and compile all the different <code>.roc</code> files.</p>",
        "id": 562375642,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1765157842
    },
    {
        "content": "<p>Is there a particular reason you want to embed the compiler and not just a compiled roc app?</p>",
        "id": 562375688,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1765157896
    },
    {
        "content": "<p>In this PR <a href=\"https://github.com/roc-lang/roc/pull/8548\">https://github.com/roc-lang/roc/pull/8548</a> that I'm currently working on, we introduce another interpreter shim so roc (cli) can build standalone binaries even before we have the functionality to lower to machine code in the compilation pipeline</p>",
        "id": 562375783,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1765157984
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/channel/231634-beginners/topic/.E2.9C.94.20Is.20there.20a.20.60libroc.60.20one.20can.20use.20to.20compile.20roc.20code.3F/near/562375688\">said</a>:</p>\n<blockquote>\n<p>Is there a particular reason you want to embed the compiler and not just a compiled roc app?</p>\n</blockquote>\n<p>It’s kind of a “it would be cool if I could do this” idea. There’s a creative software called TouchDesigner which has Python and GLSL nodes. I was thinking it would be a fun project to try to make a Roc node and platform</p>",
        "id": 562376432,
        "sender_full_name": "Lukas Hermann",
        "timestamp": 1765158723
    },
    {
        "content": "<p>As an example, I am slowly working on a shared coding platform and will eventually be needing libroc so I can compile programs dynamically without needing to use some sort of exec. I could imagine a plugin system like many ide use which is based around libroc. In my case, I will be able to start off using the compiler and putting files down on disk, but longer term I expect it will be more performant to take the string of roc code already in memory and run it in process.</p>",
        "id": 565409889,
        "sender_full_name": "Drewry Pope",
        "timestamp": 1766726140
    }
]