[
    {
        "content": "<p>Since the difference between <code>1.0 + 0.000001</code> and <code>1.0</code> is larger than <code>0.000000001</code>, I would expect</p>\n<div class=\"codehilite\"><pre><span></span><code>Num.isApproxEq (1.0 + 0.000001) 1.0 { atol: 0.000000001 }\n</code></pre></div>\n\n<p>to return <code>Bool.false</code>. It returns <code>Bool.true</code>. (I'm using a roc binary that I compiled by myself on Feb 28, 2024).</p>\n<p>Adding a little bit of formatting, <code>Num.isApproxEq</code> is implemented as follows:</p>\n<div class=\"codehilite\"><pre><span></span><code>isApproxEq = \\value, refValue, { rtol ? 0.00001, atol ? 0.00000001 } -&gt;\n    (value &lt;= refValue &amp;&amp; value &gt;= refValue) || Num.absDiff value refValue &lt;= atol + rtol * Num.abs refValue\n</code></pre></div>\n\n<p>I believe that <code>(value &lt;= refValue &amp;&amp; value &gt;= refValue)</code> evaluates to <code>Bool.false</code>, so that we only have to look at <code>Num.absDiff value refValue &lt;= atol + rtol * Num.abs refValue</code>. For the example given above, the latter expression evaluates to </p>\n<div class=\"codehilite\"><pre><span></span><code>0.000001 &lt;= 0.000000001 + 0.00001 * 1.0\n</code></pre></div>\n\n<p>which evaluates to <code>Bool.true</code>. The default relative tolerance dominates the specified absolute tolerance. Is this expected behaviour?</p>\n<p>Mixing default values with specified values feels a little bit odd to me. When both absolute and relative tolerance are specified, adding <code>atol</code>and <code>rtol * Num.abs refValue</code> also is somewhat unexpected. In this case, I would expect that the result is true if and only if both conditions are true individually. Maybe default values should only be applied if neither absolute nor relative tolerance are specified?</p>",
        "id": 423916471,
        "sender_full_name": "Michael Pfeifer",
        "timestamp": 1709160468
    },
    {
        "content": "<p>It is expected behaviour though I do minorly plan to change the function implementation.</p>\n<p>Will give a more full reply when I have time tomorrow.</p>",
        "id": 423957938,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709188407
    },
    {
        "content": "<p>So this function matches the design and implementation of many functions of this format. The prime example probably being <a href=\"https://numpy.org/doc/stable/reference/generated/numpy.isclose.html\">numpy.isclose</a>.</p>\n<p>Using both absolute and relative tolerance together is the main point of the function. Absolute tolerance is meant to check if the value is close when it is small. Relative tolerance is meant to check if the value is close when it is medium to large. Together, they check if a value is close no matter the size of the value.</p>\n<p>In my experience, these kinds of functions are used most soundly when atol is kept as small as possible. In a perfect world, atol is just for checking if a value is close to 0 or not. Cause all values have a 100% relative difference from zero. Relative tolerance is generally the better value to tune. Relative tolerance is essentially the number of significant figures that you want your values to be matching for. In the default case, the values must be matching to ~5 significant figures due to an rtol of <code>0.00001</code>.</p>",
        "id": 424091710,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709234585
    },
    {
        "content": "<p>That is interesting. I never saw this idea. Thank you very much for the explanation.</p>",
        "id": 424098568,
        "sender_full_name": "Michael Pfeifer",
        "timestamp": 1709237141
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"659209\">Michael Pfeifer</span> has marked this topic as resolved.</p>",
        "id": 424098689,
        "sender_full_name": "Notification Bot",
        "timestamp": 1709237169
    }
]