[
    {
        "content": "<p>Hello. I'm wondering if anyone has tips for debugging panics. I'd like to be able to at least attempt to debug them myself before posting errors/code. I tried enabling the backtrace, but didn't see anything that would be helpful (for me personally). Otherwise, I'd only thought to look at the point where the panic was thrown, but I'm not familiar enough with the code for that to get me very far yet. Any tips are appreciated!</p>",
        "id": 354053134,
        "sender_full_name": "David Smith",
        "timestamp": 1682716385
    },
    {
        "content": "<p>This is when writing roc code? Just some change ends up leading to the compiler panicking?</p>",
        "id": 354053372,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1682716468
    },
    {
        "content": "<p>Yea, when writing Roc code.</p>",
        "id": 354053713,
        "sender_full_name": "David Smith",
        "timestamp": 1682716613
    },
    {
        "content": "<p>Ok. Cool. First thing to always try is <code>roc check</code>. It will often find the issue for you.</p>",
        "id": 354053967,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1682716726
    },
    {
        "content": "<p>Thanks. I did try that, and unfortunately didn't turn up any issues.</p>",
        "id": 354054092,
        "sender_full_name": "David Smith",
        "timestamp": 1682716789
    },
    {
        "content": "<p>Quickly things get harder if <code>roc check</code> fails to tell you the issue.</p>",
        "id": 354054337,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1682716890
    },
    {
        "content": "<p>For me, I have a rough idea of where different errors come from. Some panics, it is useful to look at source, but many, it is too deep to help much. I am not sure I have much better advice than look at diffs and try comment out code. If you need types to match when commenting out code, <code>crash</code> can be helpful to fill in a branch. The hope is that if <code>roc check</code> passes, compilation will always succeed, but that sadly is not reality currently. Definitely feel free to keep asking here. Also, filing these bugs is extremely useful, especially if you can minimize them. That is how we will slowly work to fix them.</p>",
        "id": 354055992,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1682717589
    },
    {
        "content": "<p>Ok, thanks. It seems to be happening during code gen too, so makes debugging a little trickier. I haven't had much luck isolating with my code as is, so maybe I'll try producing a more minimal example.</p>",
        "id": 354056390,
        "sender_full_name": "David Smith",
        "timestamp": 1682717752
    },
    {
        "content": "<p>Interesting, adding a type annotation to a function stops the panic. I'll try to strip my example down a little more then open an issue.</p>",
        "id": 354152709,
        "sender_full_name": "David Smith",
        "timestamp": 1682737931
    },
    {
        "content": "<p>I opened the issue here: <a href=\"https://github.com/roc-lang/roc/issues/5344\">https://github.com/roc-lang/roc/issues/5344</a></p>",
        "id": 354397262,
        "sender_full_name": "David Smith",
        "timestamp": 1682776841
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"456993\">David Smith</span> has marked this topic as resolved.</p>",
        "id": 354397534,
        "sender_full_name": "Notification Bot",
        "timestamp": 1682776887
    }
]