[
    {
        "content": "<p>This is not a question, something that delighted me when I ran into it today and I wanted to share a thank you: I love the way <code>expect</code> will print the values of variable assignments when a test failed.</p>\n<p>At first I was briefly confused when I didn't get a diff for a failed test that did a <code>callFun 4 == [1,2,3]</code>-style comparison. I checked the documentation, saw the note about assigning values to variables to get them logged in test failures and thought it a bit weird. Then it clicked: this means it's super easy to add any information I want to test failures! I love it, such a nice tool for designing tests that fail with nice errors!</p>",
        "id": 425718695,
        "sender_full_name": "Jasper Woudenberg",
        "timestamp": 1710018453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"477725\">Jasper Woudenberg</span> has marked this topic as resolved.</p>",
        "id": 425718700,
        "sender_full_name": "Notification Bot",
        "timestamp": 1710018458
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"477725\">@Jasper Woudenberg</span>  your command captured my experience too. I wonder if we could reduce the confusion time by changing the documentation. For example, when I first read this part of the <a href=\"https://www.roc-lang.org/tutorial#tests-and-expectations\">documentation</a>:</p>\n<blockquote>\n<p>If a test fails, it will not show the actual value that differs from the expected value. To show the actual value, you can write the expect like this:</p>\n</blockquote>\n<p>My initial reaction was \"Why? That seems unexpected and unergonomic, forcing me to make a one-liner into two lines\". Perhaps highlighting the benefits and/or giving some context as to why it is done this way might help overcome the initial confusion or rejection.</p>",
        "id": 425759817,
        "sender_full_name": "Jonas Schell",
        "timestamp": 1710063872
    },
    {
        "content": "<blockquote>\n<p>... why it is done this way ...</p>\n</blockquote>\n<p>I don't remember it clearly but I think it was just the easiest way to implement this type of debug printing.</p>",
        "id": 426098391,
        "sender_full_name": "Anton",
        "timestamp": 1710240817
    },
    {
        "content": "<p>yeah exactly - I'd like to expand it to print the answers to all the function calls in the final expression, but that's a bigger project <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 426107869,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1710244351
    },
    {
        "content": "<p>that said, it's not a huge project; if anyone wants to work on it lmk and I can give the necessary context!</p>",
        "id": 426107995,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1710244396
    },
    {
        "content": "<p>For tracking; this is issue <a href=\"https://github.com/roc-lang/roc/issues/4633\">#4633</a>. I'll include a short note in the tutorial as well.</p>",
        "id": 426113589,
        "sender_full_name": "Anton",
        "timestamp": 1710246384
    }
]