[
    {
        "content": "<p>Applicative functors are a subset of functors (and superset of monads) that are very useful. At the very core, we can think about them as extending fmap (or map) for functions with more than one parameter, being able to call them with more than one value of the functor type.</p>\n<p>In functional languages, applicative functors have traditionally relied on partial function application (currying). The idea is that you lift a function with more than one parameter with pure (or just, succeed, etc...) and then apply each parameter. In haskell, you do this with the <a href=\"https://wiki.haskell.org/Applicative_functor\">&lt;*&gt; operator</a>. In elm, you can do this with |&gt; and functions that perform the application. A good example of this is the <a href=\"https://package.elm-lang.org/packages/NoRedInk/elm-json-decode-pipeline/latest/\">elm-json-decode-pipeline</a> library.</p>\n<p>In languages that have no partial application but have variadics, one can implement applicative functors with variadics, by having a function take, in a single call, the function with many parameters and all the arguments. Ben Deane explains how to achieve this in C++ in <a href=\"https://www.youtube.com/watch?v=At-b4PHNxMg\">this talk</a>.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"At-b4PHNxMg\" href=\"https://www.youtube.com/watch?v=At-b4PHNxMg\"><img src=\"https://uploads.zulipusercontent.net/6aea555cadab6ffcd56e5d6a3b6ead79d177a953/68747470733a2f2f692e7974696d672e636f6d2f76692f41742d623450484e784d672f64656661756c742e6a7067\"></a></div><p>Roc doesn't have partial function application, and it doesn't have variadics. So I don't know how I would design an API around an applicative functor in Roc. This is disappointing because applicative functors are a great API choice for some specific tasks, such as json decoding, even more for pure functional languages, and it would be great to have them available in Roc.</p>\n<p>So, my question is, what is the way in which one should write an applicative functor in Roc? Has this been thought about? Is it possible? Is it desirable or should one look for other patterns when designing APIs in this language?</p>",
        "id": 408150305,
        "sender_full_name": "Asier Elorz (he/him)",
        "timestamp": 1702633588
    },
    {
        "content": "<p>I think this example shows how to write applicative functors in Roc <a href=\"https://www.roc-lang.org/examples/RecordBuilder/README.html\">https://www.roc-lang.org/examples/RecordBuilder/README.html</a></p>",
        "id": 408157054,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1702635770
    },
    {
        "content": "<p>Thanks! I hadn't seen that example. It is very useful.</p>\n<p>So, if I understand correctly, the language has bespoke syntax to enable this pattern, right?</p>\n<p>The <code>: &lt;-</code> syntax is something special Roc has that is then desugared to Elm's applicative functor pattern.</p>",
        "id": 408159641,
        "sender_full_name": "Asier Elorz (he/him)",
        "timestamp": 1702636563
    },
    {
        "content": "<p>Well record builder is just syntax sugar. You can make a pipeline just using normal functions</p>",
        "id": 408159811,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1702636609
    },
    {
        "content": "<p>Roc parser is an example of this. <a href=\"https://github.com/lukewilliamboswell/roc-parser/blob/f0402a841126f4b2b6e85c8df0adb0941e9c04c0/examples/numbers.roc#L26\">https://github.com/lukewilliamboswell/roc-parser/blob/f0402a841126f4b2b6e85c8df0adb0941e9c04c0/examples/numbers.roc#L26</a></p>",
        "id": 408159936,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1702636647
    },
    {
        "content": "<p>Not sure if thats the best example to link to.</p>",
        "id": 408160034,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1702636680
    },
    {
        "content": "<blockquote>\n<p>Well record builder is just syntax sugar. You can make a pipeline just using normal functions</p>\n</blockquote>\n<p>I see. But in that case, if the function has more than one argument, you would need to write it \"curried\" by hand, right? Like when the example does<br>\n<code>\\aID -&gt; \\bID -&gt; \\cID -&gt; { aliceID: aID, bobID: bID, trudyID: cID }</code></p>",
        "id": 408160287,
        "sender_full_name": "Asier Elorz (he/him)",
        "timestamp": 1702636759
    },
    {
        "content": "<p>I think so. I'm definitely not an expert or anything, Roc is the first time I've encountered an applicative pipeline. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 408161058,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1702637029
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"479448\">@Asier Elorz (he/him)</span> can you give some specific examples with code snippets? Might make it easier to give alternative suggestions.</p>\n<p>Side note, anything with encoding and decoding, like json, roc has an alternate solution in the Encode and Decode abilities.</p>\n<p>Also, maybe <span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> just has a solid answer cause I know he has dealt with both forms before and picked this.</p>",
        "id": 408211537,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1702655574
    },
    {
        "content": "<p>I haven't really started writing the code yet <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> </p>\n<p>I am mostly researching for a small Roc project I will very definitely one day do when I have free time and the energy to do it.</p>\n<p>Also I am curious about how I would do thing in language, in general. Just to nerd about it, without specific applications.</p>",
        "id": 408226709,
        "sender_full_name": "Asier Elorz (he/him)",
        "timestamp": 1702660921
    },
    {
        "content": "<p>That's totally fair.</p>",
        "id": 408227960,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1702661403
    }
]