[
    {
        "content": "<p>I was with a bunch of friends this weekend and we used a 5meter long programmable led strip and two buttons to embed some custom games and play. At some point I was wondering if any of it would be possible with Roc. As anyone played with Roc on esp32 yet?</p>",
        "id": 449404318,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1720217430
    },
    {
        "content": "<p>I put roc on a BBC micro it v2 a long time ago. Would be a similar experience to that.</p>",
        "id": 449409602,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1720220354
    },
    {
        "content": "<p>To do it today would require plumbing a new target through the compiler and setting up a platform. For the microbit I use embassy from rust as the platform.</p>",
        "id": 449409699,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1720220407
    },
    {
        "content": "<p>Not particularly hard to do, but a solid bit of plumbing.</p>",
        "id": 449409786,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1720220437
    },
    {
        "content": "<p>Maybe less now after some refactors</p>",
        "id": 449409792,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1720220449
    },
    {
        "content": "<p>I think roc is an ok fit, but easily can blow up in binary or memory size when dealing with tight constraints.</p>",
        "id": 449409923,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1720220528
    },
    {
        "content": "<p>Yeah probably difficult to fit. But maybe with some dedicated work on making it small, like what as done for the wasm target, maybe it could makes sense at some point.<br>\nThanks for the answer.</p>",
        "id": 449410089,
        "sender_full_name": "Matthieu Pizenberg",
        "timestamp": 1720220680
    },
    {
        "content": "<p>Yeah, I think it totally should be viable. Just one of those things that might get block until some compiler improvements are made. Would be great to get an esp32 or some other basic embedded platform setup</p>",
        "id": 449410255,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1720220805
    }
]