[
    {
        "content": "<p>Hi all,<br>\nWanted to check out Roc on Windows, though I know support is limited.<br>\nBuilt the compiler from source and it looks okay.<br>\nNow I'm trying to run the helloWorld.roc example but it seems the basic-cli package has no Windows support.<br>\nI'm completely new here and don't know if that is indeed the case? Couldn't find any clear info on this.</p>\n<p>Compiler error:</p>\n<div class=\"codehilite\"><pre><span></span><code>I was expecting this file to exist:\n\n    C:\\...\\Roaming\\Roc\\packages\\github.com/roc-lang/basic-cli/releases/download/0.10.0\\vNe6s9hWzoTZtFmNkvEICPErI9ptji_ySjicO6CkucY\\windows-x64.rh\n\nHowever, it was not there!\n</code></pre></div>\n<p>The file indeed doesn't exist, I only see Linux and MacOS</p>",
        "id": 438409931,
        "sender_full_name": "Musilitar",
        "timestamp": 1715620195
    },
    {
        "content": "<p>This is correct. In my experience only the zig platforms seem to reliably work for now. I haven't really dug into what changes we need to make to the basic cli to get it working.</p>",
        "id": 438410792,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1715620499
    },
    {
        "content": "<p>So for example checkout <a href=\"https://github.com/lukewilliamboswell/roc-wasm4\">https://github.com/lukewilliamboswell/roc-wasm4</a> which works on Windows and is fun</p>",
        "id": 438410911,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1715620539
    },
    {
        "content": "<p>Also note that the surgical linker has a bug and is currently the default for Windows so be sure to use <code>--linker=legacy</code> when using examples like platform switching.</p>",
        "id": 438411092,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1715620590
    },
    {
        "content": "<p>Oh, to specifically address your question. It's looking for the prebuilt binaries in the platform tar file. But we dont have prebuilt files for Windows yet. You can clone basic-cli and use a path if you want to use it locally. I have a branch of basic-cli that should be easier to build the platform prebuilt binary if you are interested in looking into this.</p>",
        "id": 438411553,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1715620783
    },
    {
        "content": "<p>Alright, good to know.<br>\nAt least I learned some things while getting the compiler working <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> <br>\nThanks for the tips!</p>",
        "id": 438411559,
        "sender_full_name": "Musilitar",
        "timestamp": 1715620784
    },
    {
        "content": "<p>what are blockers for including the windows version in those binaries (now that <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span> showed that we can cross-compile platforms)</p>",
        "id": 440279753,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1716455340
    },
    {
        "content": "<p>There's a wondows surgical linker bug causing everything to segfault</p>",
        "id": 440281166,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716455853
    },
    {
        "content": "<p>I have this PR <a href=\"https://github.com/roc-lang/basic-cli/pull/194\">https://github.com/roc-lang/basic-cli/pull/194</a> that I should probably update and submit for review. That changes the building in preparation for the removal of rebuilding host from the cli. But if people are using a release there is no difference. It would make it so we can do the cross compiling thing. Then I guess its a matter of checking what is compatible with windows.</p>",
        "id": 440281612,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716456004
    },
    {
        "content": "<p>My main concern with that PR is just I haven't spoken to Anton yet, and we will need to modify the bundle process a little. I wanted to make sure Anton was happy with the final result, but I guess we could achieve that with a PR review. That PR was really helpful in developing the basic-ssg and platform-template repositories.</p>",
        "id": 440281975,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716456141
    },
    {
        "content": "<p>Oh, the other thing is I need to figure out how to do the cross-compile thing for surgical linker artefacts. I'm hoping <span aria-label=\"fingers crossed\" class=\"emoji emoji-1f91e\" role=\"img\" title=\"fingers crossed\">:fingers_crossed:</span> that with both cargo and roc cross compiling that should just work.</p>",
        "id": 440282203,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716456233
    },
    {
        "content": "<p>I can maybe look into this again tomorrow.</p>",
        "id": 440282311,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1716456270
    }
]