[
    {
        "content": "<p>Can you use Multiple Platforms in One Project? For Example, when all Platforms are written in Rust.</p>",
        "id": 555237585,
        "sender_full_name": "Jonas",
        "timestamp": 1762987984
    },
    {
        "content": "<p>Depends on what you mean by a project, can you clarify?</p>\n<p>If you mean a project is an application (a built binary), then you can only have one platform in a single application because the platform is in charge of the entrypoint to your application, so having two platforms would mean having two entrypoints which doesn't make sense.</p>\n<p>If you meant a wider meaning of project, then if you have two similar platforms that have the same API then you could write some shared Roc code and import it in two different applications which each use a different platform. The other way to use two platforms would be writing two applications and then having one application start the other, e.g. by running the built binary.</p>",
        "id": 555245603,
        "sender_full_name": "Hannes",
        "timestamp": 1762992746
    },
    {
        "content": "<p>Another example: I’m working on a web app where the backend uses one platform, the front-end another, and a third one for my background jobs. I share Roc code between them, but each part outputs a single binary.</p>",
        "id": 555285070,
        "sender_full_name": "Niclas Ahden",
        "timestamp": 1763020136
    },
    {
        "content": "<p><span aria-label=\"point up\" class=\"emoji emoji-1f446\" role=\"img\" title=\"point up\">:point_up:</span> Thanks Niclas, that's a perfect example of what I was trying to explain :)</p>",
        "id": 555489872,
        "sender_full_name": "Hannes",
        "timestamp": 1763083755
    },
    {
        "content": "<p>I've been thinking of a hosted platform that runs roc code, the best I've come up with is having a metadata file that lists capabilities (built as libraries the service has a registry of) and then it will autogenerate the roc 'platform' out of the capability set. (Caching the platform dlib so it can be reused for future requests with the same requirements set.)</p>\n<p>I don't just want one 'service' platform because some users may not be trusted to run http, or have authorization to use computationally expensive capabilities, or perhaps free users don't get blob store access but paid users or users connecting to a paid user's endpoint do.</p>",
        "id": 556660622,
        "sender_full_name": "Drewry Pope",
        "timestamp": 1763272614
    },
    {
        "content": "<p>With the new zig compiler, that should be a lot easier to manage. When calling into roc, you explicitly pass in a struct with all effects. You have two options for less trusted users:</p>\n<ol>\n<li>given them all functions but make some of the functions error if called</li>\n<li>use a totally separate platform api to not even give them the functions</li>\n</ol>",
        "id": 556661432,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1763273506
    }
]