[
    {
        "content": "<p>Hi! Since docs mention that transforming a string to lower or upper case is not implemented in Roc yes, and I didn't manage to find any solutions by Googling, can anyone suggest a solution for this? </p>\n<p>I bet there should be some package somewhere that already implemented it</p>",
        "id": 480889312,
        "sender_full_name": "Artem",
        "timestamp": 1730889173
    },
    {
        "content": "<p>It's a unicode thing I think. It's not implemented in roc-lang/unicode yet.</p>",
        "id": 480890756,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730889686
    },
    {
        "content": "<p>Correction... if you know you're only dealing with Ascii checkout Hannes <a href=\"https://github.com/Hasnep/roc-ascii\">https://github.com/Hasnep/roc-ascii</a></p>",
        "id": 480891700,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730889980
    },
    {
        "content": "<p>It also tripped me up when I worked on some exercism tasks. Usually you would find such functions in any language.<br>\nHaving said that, it was a nice exercise to think about ASCII vs Unicode again and what it actually means to e.g. downcase characters in a string.</p>",
        "id": 480905717,
        "sender_full_name": "Patrick Wierer",
        "timestamp": 1730894811
    },
    {
        "content": "<p>I think uppercasing a Unicode string is technically locale dependent</p>",
        "id": 480972041,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1730915561
    },
    {
        "content": "<p>But if you just have ascii, it is as easy as changing a single bit.</p>",
        "id": 480972127,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1730915591
    },
    {
        "content": "<p>yep, uppercasing \"i\" gives a different answers depending on whether you're talking about English or Turkish</p>",
        "id": 480973278,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1730916028
    },
    {
        "content": "<p>most languages either incorrectly handle that case or silently do something different depending on the system locale, but I don't think we should do either; I think we should correctly and explicitly handle that, so that a Roc pure function always gives the same answer no matter what system you run it on</p>",
        "id": 480973525,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1730916107
    },
    {
        "content": "<p>which is why it's not in the standard library; locales change over time, so the idea is to have a separate package for that.</p>",
        "id": 480973685,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1730916150
    }
]