[
    {
        "content": "<p>I have a general question regarding platforms. As far as I understand a platform executes roc code to trigger side effects or so. But what if for example I want to write a music making software which needs GUI and audio libraries? Would I need to write a new platform or fork the gui platform and add roc-wrappers for calls to an audio library? In general gui applications do not provide gui and that's it, they do all sorts of stuff, like spotify for example (calling a server, downloading music, playing music...). I imagine having to write for example a library in rust and use roc as a glue language for the library. Like how game engines are usually written in C++ and use a scripting language like lua for game logic. Is this how roc is supposed to work?</p>",
        "id": 342744612,
        "sender_full_name": "itmuckel",
        "timestamp": 1679133296
    },
    {
        "content": "<p>I can also think of server applications that need to talk to mysql/postgres or redis, need to provide a rest api or a graphql api or so. Are platforms flexible enough? Will there be the need for a very big server platform covering all potential needs of a roc application?</p>",
        "id": 342745939,
        "sender_full_name": "itmuckel",
        "timestamp": 1679133761
    },
    {
        "content": "<p>Fundamentally, 2 unique platforms can not be combined.  Each of them is code that would compile to a standalone executable. That said, code reuse between platforms and more flexible platforms are still possible. Platforms have full access to the host languages package ecosystem. Libraries tailored to Roc could be added to these package ecosystems enabling a platform to easily add sound for example. On top of that, the platform could enable conditional compilation such that a Roc user can pick the variant of it with the specific pieces they need.</p>",
        "id": 342795392,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679150989
    },
    {
        "content": "<blockquote>\n<p>Would I need to write a new platform or fork the gui platform and add roc-wrappers for calls to an audio library?</p>\n</blockquote>\n<p>Very possibly you would need to do exactly this. I think it mostly depends on how complex of an application you want to build and what special features it has. If no platform fits your needs, you would need to modify one or make your own. That said, I would assume, for people who never want touch a platform, there will be some rather flexible platforms that arise. They may be quite large, but they also would give the largest swath of potential features.</p>",
        "id": 342795825,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679151129
    },
    {
        "content": "<blockquote>\n<p>use a scripting language like lua for game logic. Is this how roc is supposed to work? </p>\n</blockquote>\n<p>That is definitely one explicitly use case of Roc, but I think it expands past that. Some areas, I think platform will be designed well enough that you wouldn't touch or really think about the underlying platform.</p>",
        "id": 342796011,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679151199
    },
    {
        "content": "<blockquote>\n<p>need to talk to mysql/postgres or redis, need to provide a rest api or a graphql api or so. Are platforms flexible enough?</p>\n</blockquote>\n<p>For all of these, the platform just needs to provide Roc a way to talk over the network. Packages written in Roc could deal with each of the specific protocols. They, unsurprisingly, don't exist yet, but there is nothing stopping them from being built. So the flexibility could definitely come from the Roc package ecosystem rather than the platform apis.</p>",
        "id": 342796339,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679151325
    },
    {
        "content": "<blockquote>\n<p>Will there be the need for a very big server platform covering all potential needs of a roc application?</p>\n</blockquote>\n<p>Need? nope, but I think especially medium term, having giant platforms that kinda just do a ton will be common. Right now, most platforms  are custom to one or a few apps. As time progress, I think some areas will get platforms that are good enough for 95% of use cases in the area. These platform will likely be really large and do everything in the platform. In the very long term, I would expect many of these to slim as flexability is built into them and more pieces are moved into the roc package ecosystem.</p>",
        "id": 342796814,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679151540
    },
    {
        "content": "<p>But that is all just speculative.</p>",
        "id": 342796846,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679151554
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Combining.20platforms.3F/near/342795392\">said</a>:</p>\n<blockquote>\n<p>Fundamentally, 2 unique platforms can not be combined.  Each of them is code that would compile to a standalone executable. That said, code reuse between platforms and more flexible platforms are still possible. Platforms have full access to the host languages package ecosystem. Libraries tailored to Roc could be added to these package ecosystems enabling a platform to easily add sound for example. On top of that, the platform could enable conditional compilation such that a Roc user can pick the variant of it with the specific pieces they need.</p>\n</blockquote>\n<p>why not actually (theoretically)?<br>\nlib-like platforms<br>\ncompile each to an object file that would just link against the app</p>",
        "id": 342803014,
        "sender_full_name": "dank",
        "timestamp": 1679153751
    },
    {
        "content": "<p>An executable in C, a lib in C, and a Roc app would be 1 roc platform made out of an executable and lib in C and a Roc app.</p>",
        "id": 342804195,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679154189
    },
    {
        "content": "<p>If the executable never calls into or uses the lib in C, it is just dead code.</p>",
        "id": 342804243,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679154208
    },
    {
        "content": "<p>Fundamentally there is only 1 main. It drives everything.</p>",
        "id": 342804457,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679154284
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Combining.20platforms.3F/near/342804243\">said</a>:</p>\n<blockquote>\n<p>If the executable never calls into or uses the lib in C, it is just dead code.</p>\n</blockquote>\n<p>i mean could theoretically eliminate it at compile time (if you could also compile all three together)</p>",
        "id": 342804856,
        "sender_full_name": "dank",
        "timestamp": 1679154476
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Combining.20platforms.3F/near/342804457\">said</a>:</p>\n<blockquote>\n<p>Fundamentally there is only 1 main. It drives everything.</p>\n</blockquote>\n<p>yea<br>\nby that main you could compile the rest</p>",
        "id": 342805006,
        "sender_full_name": "dank",
        "timestamp": 1679154526
    },
    {
        "content": "<p>it doesn't sound impossible<br>\njust may go against roc design (which idk if it does tbh)</p>",
        "id": 342805066,
        "sender_full_name": "dank",
        "timestamp": 1679154549
    },
    {
        "content": "<p>About main, what I mean is this:</p>\n<ol>\n<li>Some C platform starts running. It is the core executable and will eventually start running the main function in C. This is decided by the platform and Roc has 0 control over this functions.</li>\n<li>Eventually, that program calls into Roc.</li>\n<li>Eventually Roc returns data to the program and it performs side effects.</li>\n<li>Repeat 2 and 3 until exit.</li>\n</ol>\n<p>If I add in another C library, that is a \"library platform\". What is it gonna do? When is the main C platform of the actual executable gonna call into it? The main C platform does not know about it and will not call into it, So, it will always be dead code.</p>\n<p>The way to do something like this with Roc would be to modify the main C platform to make it use the C library. This is really just expanding the main C platform. There is no merging of two platforms from Roc's point of view. It would not happen automatically (well, maybe with an ifdef), but fundamentally would be forking the platform and making a larger platform with more capabilities.</p>",
        "id": 342806283,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679155060
    },
    {
        "content": "<p>Ah, interesting, so as long as the provided platform is \"powerful\" enough, libraries can be written completely in roc. Should also work performance wise <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 342807557,
        "sender_full_name": "itmuckel",
        "timestamp": 1679155561
    },
    {
        "content": "<p>I think it will work performance wise. Given some roc tag union representing the request, convert it to a list of bytes with some metadata to pass to the platform.</p>",
        "id": 342808352,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679155912
    },
    {
        "content": "<p>But only time will tell where this exact trade off lands.</p>",
        "id": 342808456,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1679155936
    }
]