[
    {
        "content": "<p>i understand the new code to be using zig, i want to use iroh with roc, iroh is a rust library. how feasible is using roc from rust at this point? I'm guessing you would use ffi against the c bindings? I'm also guessing it might be easier to make c bindings for a rust lib and then call those from roc, does that seem like the right way to go about it? I figure calling rust from zig will be easier since the roc compiler has its own processes and expects zig.</p>",
        "id": 553303556,
        "sender_full_name": "Drewry Pope",
        "timestamp": 1762146529
    },
    {
        "content": "<p>Roc has no FFI, so to integrate Roc with any language, you would need to write a Roc platform in that language. Platforms can be in any language, so the Zig rewrite of the compiler won't affect this. The platform is compiled and linked with a Roc app, then the combined platform+app will run the host code (e.g. some Rust code that uses iroh) and call your Roc code.</p>\n<p>Someone else will come along and explain this better than me and guide you to resources on writing a platform. <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 553306251,
        "sender_full_name": "Hannes",
        "timestamp": 1762149064
    },
    {
        "content": "<p>+1 to what Hannes said. Here's a resource to learn more: <a href=\"https://www.roc-lang.org/platforms\">https://www.roc-lang.org/platforms</a></p>\n<p>Platforms isn't the easiest thing to get into right now as most contributions are made toward moving the language itself forward first. However, if you're up for some experimentation and tinkering you'll have fun :)</p>\n<p>An easy way to get started is to extend an existing platform like <a href=\"https://github.com/roc-lang/basic-cli\"><code>basic-cli</code></a> or <a href=\"https://github.com/roc-lang/basic-webserver\"><code>basic-webserver</code></a>. Perhaps you just need to add a few dependencies and functions in there and you're done?</p>\n<p>The new compiler will change the language, and how platforms are built, so if you go into it expecting changes along the line you'll be fine :)</p>",
        "id": 553335244,
        "sender_full_name": "Niclas Ahden",
        "timestamp": 1762162255
    },
    {
        "content": "<blockquote>\n<p>Roc has no FFI</p>\n</blockquote>\n<p>A better way to word this might be that all FFI in roc is controlled by the platform. By default, this tends to mean that to expose something via FFI is to extend a platform or create a new one.</p>\n<p>A platform technically could expose raw bindings to libFFI. If it did so, it would enable roc apps to have total control for FFI to any library.</p>",
        "id": 553474286,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1762201555
    },
    {
        "content": "<p>I don't know enough about iroh to give any concrete suggestions here though.</p>",
        "id": 553474329,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1762201574
    },
    {
        "content": "<p>thank you both <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> I'll play with it and see how it goes</p>",
        "id": 553476077,
        "sender_full_name": "Drewry Pope",
        "timestamp": 1762202296
    },
    {
        "content": "<p>something I had trouble with before, and I don't know probably this was the old compiler but maybe true with either-- I understand the part of platform that I would add, is there an interface or documentation for the list of roc_ functions a platform would need to work? I made a list at one point by looking at old cli/webserver code. Is that the full list? Are there optional functions? This is more theoretical ensuring I fully understand how it works, in practice I'm going to take one of the existing and make it look how I want for now.</p>",
        "id": 556660832,
        "sender_full_name": "Drewry Pope",
        "timestamp": 1763272860
    },
    {
        "content": "<p>I don't think we have it officially written down somewhere (and the api changes between the old and the new compiler). This should be the full list of required functions: <a href=\"https://github.com/roc-lang/roc/blob/824c243d06a820babcbeb85e97c94c0cbfca5c9e/test/int/platform/host.zig#L105-L110\">https://github.com/roc-lang/roc/blob/824c243d06a820babcbeb85e97c94c0cbfca5c9e/test/int/platform/host.zig#L105-L110</a> (this is in the new compiler setup).</p>",
        "id": 556661347,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1763273408
    },
    {
        "content": "<p>Thank you!!</p>",
        "id": 556661418,
        "sender_full_name": "Drewry Pope",
        "timestamp": 1763273485
    },
    {
        "content": "<p>Something else I had noticed, and I'm hoping you can confirm or clarify--</p>\n<p>The docs split out platform and app, but then digging a bit deeper it seems what you're referring to as platform, is in fact, host/platform, or as I've recently taken to calling it, host plus platform. ;-)</p>\n<p>Back in July I tried to map out how all this works and ended up with a diagram that makes me feel a little like Charlie ranting about Pepe Silvia.</p>\n<p><a href=\"/user_uploads/22008/34HAp6J27b5ZOmG8DQn1LwE4/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/34HAp6J27b5ZOmG8DQn1LwE4/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"4456x2951\" src=\"/user_uploads/thumbnail/22008/34HAp6J27b5ZOmG8DQn1LwE4/image.png/840x560.webp\"></a></div><p>I'm sure that this diagram isn't right and maybe was focused on the older compiler.</p>\n<p>I guess my question is, how do you see the role of host in roc applications? Do you see this as distinct from platforms or so tightly ingrained where the host should exist for and be dedicated to just one platforms specific needs?</p>",
        "id": 556661888,
        "sender_full_name": "Drewry Pope",
        "timestamp": 1763274183
    },
    {
        "content": "<p>As I use the term, a platform is a host (code in some other langauge) + a roc api.</p>",
        "id": 556661998,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1763274369
    }
]