[
    {
        "content": "<p>Every other language uses either --v or -version ti check the version, but roc just uses version. Is there any reasoning to this? I know I'm asking something that might not be of any importance but I'm learning and hoping to contribute to this project for a long time, hence want to learn what, how and why of this language. </p>\n<p>Thanks</p>",
        "id": 482640621,
        "sender_full_name": "Sahil",
        "timestamp": 1731685298
    },
    {
        "content": "<p>We also support -V and --version, we provide many options because we want to make things easy for the user. Ideally they should be able to guess and it should work. Making <code>--v</code> or <code>-version</code> work as well would be nice but I'm not sure if that is easy to add with the CLI lib that we use.</p>",
        "id": 482647209,
        "sender_full_name": "Anton",
        "timestamp": 1731687265
    },
    {
        "content": "<p>yeah I think we could support those pretty easily by just manually checking the process args for them on startup, not even using <code>clap</code></p>",
        "id": 482650966,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1731688498
    },
    {
        "content": "<blockquote>\n<p>We also support -V and --version, we provide many options because we want to make things easy for the user</p>\n</blockquote>\n<p>Ohh, got it.  I don't know the reason behind those convention of --v and -version but I think its somewhat related to linux options convention. One more question, where can I raise an issue for the roc website? I don't see any copy button on codeblocks, these days its pretty common to have one, don't you think? If you think we should add it, then let me know I can work on this. Thanks</p>",
        "id": 482652310,
        "sender_full_name": "Sahil",
        "timestamp": 1731688928
    },
    {
        "content": "<blockquote>\n<p>I don't see any copy button on codeblocks</p>\n</blockquote>\n<p>We used to have this, but perhaps it broke?</p>\n<p>The website is here: <a href=\"https://github.com/roc-lang/roc/tree/main/www\">https://github.com/roc-lang/roc/tree/main/www</a></p>",
        "id": 482652618,
        "sender_full_name": "Anton",
        "timestamp": 1731689038
    },
    {
        "content": "<p>the most important thing with making a change like that is not to introduce any third party dependencies</p>",
        "id": 482652755,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1731689081
    },
    {
        "content": "<p>just add the minimal amount of js necessary make it work</p>",
        "id": 482652849,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1731689113
    },
    {
        "content": "<p>(and css)</p>",
        "id": 482652893,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1731689125
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/channel/231634-beginners/topic/Command.20to.20check.20version.20is.20not.20conventional/near/482652849\">said</a>:</p>\n<blockquote>\n<p>just add the minimal amount of js necessary make it work</p>\n</blockquote>\n<p>yeah sure. Minimal dependencies, got it. So shold I just create an issue and start working on it?</p>",
        "id": 482653063,
        "sender_full_name": "Sahil",
        "timestamp": 1731689184
    },
    {
        "content": "<p>Make sure to start by trying to find the old copy functionality</p>",
        "id": 482653204,
        "sender_full_name": "Anton",
        "timestamp": 1731689228
    },
    {
        "content": "<p>ok understood, I'll also tag you on the issue. First I gotta install the prerequisites</p>",
        "id": 482653581,
        "sender_full_name": "Sahil",
        "timestamp": 1731689359
    }
]