[
    {
        "content": "<p>Hello.<br>\nHow to build SPA with Roc? I was using Elm previously.</p>\n<p>I have found this for Elm programmers but can't find something about SPA <a href=\"https://github.com/roc-lang/roc/blob/main/roc-for-elm-programmers.md\">https://github.com/roc-lang/roc/blob/main/roc-for-elm-programmers.md</a>.</p>\n<p>I see that I can generate static website</p>\n<ul>\n<li><a href=\"https://github.com/roc-lang/roc/blob/main/www/main.roc\">https://github.com/roc-lang/roc/blob/main/www/main.roc</a></li>\n<li><a href=\"https://github.com/yukiomoto/roc/blob/main/www/wip_new_website/InteractiveExample.roc\">https://github.com/yukiomoto/roc/blob/main/www/wip_new_website/InteractiveExample.roc</a></li>\n</ul>\n<p>I see there are platforms but no web platform? <a href=\"https://github.com/zraexy/roc/tree/main/examples/platform-switching\">https://github.com/zraexy/roc/tree/main/examples/platform-switching</a></p>\n<p>There is this project <a href=\"https://github.com/roc-lang/roc/tree/main/examples/virtual-dom-wip\">https://github.com/roc-lang/roc/tree/main/examples/virtual-dom-wip</a> but I think it is going webassembly way and is also WIP.</p>\n<p>Thanks.</p>",
        "id": 420803386,
        "sender_full_name": "rofrol",
        "timestamp": 1707574525
    },
    {
        "content": "<p>We don't have any SPA platforms yet but you can use Roc for the backend with the <a href=\"https://github.com/roc-lang/basic-webserver/blob/main/examples/todos.roc\">basic-webserver platform</a>.</p>",
        "id": 420806053,
        "sender_full_name": "Anton",
        "timestamp": 1707576909
    },
    {
        "content": "<p>Roc doesn't compile to JavaScript, and the plan is that it won't. So in the browser, WebAssembly is the one way to run Roc!</p>",
        "id": 420806326,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1707577103
    },
    {
        "content": "<p>I've had fun writing a web app using htmx. I wrote about my exploration <a href=\"https://lukewilliamboswell.github.io/roc-htmx-demo/\">https://lukewilliamboswell.github.io/roc-htmx-demo/</a></p>",
        "id": 420827264,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1707593690
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/stream/231634-beginners/topic/Compile.20to.20javascript.3F.20Build.20Single.20Page.20Application.3F.20SPA.3F/near/420806326\">said</a>:</p>\n<blockquote>\n<p>Roc doesn't compile to JavaScript, and the plan is that it won't. So in the browser, WebAssembly is the one way to run Roc!</p>\n</blockquote>\n<p>What would it take to modify the compiler to emit javascript instead of, say, llvm?<br>\nThe readme (<a href=\"https://github.com/roc-lang/roc/blob/main/crates/compiler/README.md\">https://github.com/roc-lang/roc/blob/main/crates/compiler/README.md</a>) lists a number of steps. Where, and what kind of changes are need to allow targeting javascript (or any other scripting lang)?</p>\n<p>How to implement platforms when compiling to javascript is a different question. My main interest here is if it is possible at all, and if so how, too parse + convert Roc to javascript, turning Roc into a viable replacement for Elm</p>",
        "id": 421250934,
        "sender_full_name": "Shaiden Spreitzer",
        "timestamp": 1707833579
    },
    {
        "content": "<p>it's an explicit non-goal of the project to emit JavaScript, but if you wanted to try it yourself on a fork, the minimal change you'd need to make would be to add a new <code>gen_</code> crate (like <code>gen_llvm</code> or <code>gen_dev</code>) which would go from <code>mono::ir</code> to whatever output you wanted</p>",
        "id": 421251641,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1707833802
    },
    {
        "content": "<p>A better (or maybe just easier) way to use Roc in the JS world would probably be for someone to create a platform that compiles to wasm and provides access to parts of the JS stdlib. Then you would load the wasm file in JS and hook up the wasm calls to JS calls. It would be weird but i think it would work, right?</p>",
        "id": 421252619,
        "sender_full_name": "Hannes",
        "timestamp": 1707834122
    },
    {
        "content": "<p>right, in general that's how wasm in the browser works <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 421253199,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1707834280
    },
    {
        "content": "<p>the wasm itself is basically only capable of doing calculations, so wiring it up to some amount of hardcoded JS is necessary to be able to do any interesting browser stuff</p>",
        "id": 421253292,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1707834308
    },
    {
        "content": "<p>Great! So someone just needs to write that hard coded JS file that exposes all of the effects in the JS stdlib and that's basically the same as compiling to JS <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 421255256,
        "sender_full_name": "Hannes",
        "timestamp": 1707834864
    },
    {
        "content": "<p>Something I've always seen handwaved in wasm \"code sharing\" or the like is referential integrity. A lot of JavaScript optimizations rely on it and I worry that dropping a wasm bundle in would prevent any sort of \"share you business logic using a roc module that your existing code can use\" migration path</p>",
        "id": 421273534,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707839802
    },
    {
        "content": "<p>The nice thing about compile to JS is that there is no to/from wasm conversion that breaks those optimization (obviously there are other pitfalls, but that's just one)</p>",
        "id": 421273801,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707839871
    },
    {
        "content": "<p>If you want JS compilation, why not just use Elm?</p>",
        "id": 421281752,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1707841993
    },
    {
        "content": "<blockquote>\n<p>\"share you business logic using a roc module that your existing code can use\" migration path</p>\n</blockquote>\n<p>Also, I'm not really sure how a wasm bundle stops this, can you explain more?</p>",
        "id": 421281956,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1707842057
    },
    {
        "content": "<p>What is referential integrity? Is it related to referential transparency?<br>\nI've done a lot of webassembly work but I'm not following this point.</p>",
        "id": 421342508,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1707866784
    },
    {
        "content": "<p>For sure, let's say that you have a mobile app and a web app and you want to share some logic in a common roc module (basically along the lines of kotlin multiplatform), elm won't run in a non-browser environment so I don't think that's an option.</p>",
        "id": 421371641,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707887288
    },
    {
        "content": "<p>Referential integrity is basical JavaScript's way of saying pointer comparisons. It is a common optimization to check object (essentially pointers to records) equality by just comparing the references themselves. If they reference the same object they are equal , or perhaps more importantly if they don't have the same reference you assume they are not equal</p>",
        "id": 421371837,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707887410
    },
    {
        "content": "<p>From what I understand of wasm, if I'm using any data inside of wasm from js-land then I have to marshall it across the wasm-boundary, and then if I return the data I would marshall it back across the boundary and end up with a different reference (and in this case most likely a deep copy), this would make it unusable in a lot of common js patterns.</p>",
        "id": 421371956,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707887509
    },
    {
        "content": "<p>For example selectors in redux rely heavily on referential integrity in order to avoid triggering re-renders, if the reference changes each frame then it can't avoid doing deep comparisons which are slow</p>",
        "id": 421372050,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707887571
    },
    {
        "content": "<p>The way most wasm-based web frameworks do stuff is they shift as much as possible into the wasm side so all that is ever marshalled across is the minimal DOM changes, no application data</p>",
        "id": 421372165,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707887650
    },
    {
        "content": "<p>This isn't a problem outside the browser because there doesn't have to be much marshalling to cross the C ffi. Presumably a platform could just \"understand\" a roc type and it's all good to go</p>",
        "id": 421372245,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707887730
    },
    {
        "content": "<p>Note: I should have used the term referential equality not integrity. Related concepts but not exactly the same, and probably confusing that I used the wrong one</p>",
        "id": 421372647,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707888022
    },
    {
        "content": "<p>I also think it is totally fine to say \"swapping out a redux store in a react app for a roc module is not a use case we think is in scope\". Just pointing out that there are reasons people like compile to js over wasm for some use cases</p>",
        "id": 421373068,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707888434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"492563\">@Pearce Keesling</span> have you seen the <a href=\"https://github.com/roc-lang/roc/tree/main/examples/virtual-dom-wip\">virtual dom example</a>? That might be good to see some ideas for managing the WASM boundary and sharing logic on front and back ends.</p>",
        "id": 421527734,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1707942742
    },
    {
        "content": "<p>Yeah, I think that is a great strategy for when a whole slice of your ui is going to be in roc. I don't think it avoids the problems when you're embedding just logic into a react app.</p>",
        "id": 421534302,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707945428
    },
    {
        "content": "<p>For example a real use case we have at my company. We have a list of transactions that's 10s of thousands of times long. If I want to update a single transaction I need to send it all across and then update a value and send it  back. In order to use wasm I'd need to find a good \"cutting point\" to minimize the amount of serialize/deserialize I have to do. If it's just js I can plug it in way easier</p>",
        "id": 421534689,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707945584
    },
    {
        "content": "<p>Given how roc handles effects, I think it will always have some complex edges in this area. Fundamentally a good \"cutting point\" is required to use roc in general. That is what a platform hopefully is.</p>",
        "id": 421545241,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1707950322
    },
    {
        "content": "<p>I do agree that wasm makes this more complex. For this cutting point, you might:</p>\n<ul>\n<li>Need to store the full list of transactions in wasm. Then just reference it from the js side. That would be avoid serialization.</li>\n<li>Give roc effects that let it read and write individual elements in the list of transactions. That way you only ever pay the cost of a small conversion at a time. You never need an extra copy of this data in memory.</li>\n<li>Just pay the cost but do things in larger blocks in roc. That way the cost isn't a big deal.</li>\n</ul>\n<p>Any of these might mitigated the issue, but fundamentally, performance would need to be measured.</p>",
        "id": 421545836,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1707950629
    },
    {
        "content": "<p>Absolutely, all of those are reasonable routes. It's all about tradeoffs</p>",
        "id": 421547081,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1707951238
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/stream/231634-beginners/topic/Compile.20to.20javascript.3F.20Build.20Single.20Page.20Application.3F.20SPA.3F/near/421527734\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"492563\">Pearce Keesling</span> have you seen the <a href=\"https://github.com/roc-lang/roc/tree/main/examples/virtual-dom-wip\">virtual dom example</a>? That might be good to see some ideas for managing the WASM boundary and sharing logic on front and back ends.</p>\n</blockquote>\n<p>I think a really interesting concept is using this pattern for targets other than the browser</p>",
        "id": 421708598,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708019150
    },
    {
        "content": "<p>like in general if you have a Roc function whose purpose is to quickly return a description of how you want the UI to look, and then the platform's job is to translate that into actual visuals...</p>",
        "id": 421708813,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708019210
    },
    {
        "content": "<p>you could implement something in the browser which does that, sure, but in theory you could do the same in Swift on iOS, calling the Roc function via Swift's C FFI</p>",
        "id": 421708898,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708019235
    },
    {
        "content": "<p>and same thing on Android</p>",
        "id": 421708926,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708019247
    },
    {
        "content": "<p>same thing on desktop, etc.</p>",
        "id": 421708974,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708019265
    },
    {
        "content": "<p>I noticed that one of the open native devs is working on decoupling react native from react. I think I tagged @roc_lang in the tweet thread. That might be a super interesting foundation to build on since react native is essentially a C FFI for native views</p>",
        "id": 421709127,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1708019298
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"492563\">@Pearce Keesling</span> any chance you could dig out a link? that sounds interesting.</p>",
        "id": 422072512,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1708238043
    },
    {
        "content": "<p>Also, somewhat related to the above. </p>\n<p>I've been expanding on my roc+htmx demo, refactoring it and generally tinkering. I think it's a good sandpit for developing basic-webserver features and trying out ideas.</p>\n<p>But I wonder if anyone else would be interested in tinkering with it also? I thought I might ask because if anyone would be interested in making PRs and generally adding random features then that might be fun. </p>\n<p>There is no overall direction or anything, I'm just doing the next thing that pops into my head, a random exploration of different ideas for building web apps with Roc. To be honest, I have spent most of my time just rebuilding things I've already built and refactoring.</p>\n<p>I want to challenge myself to write up a blog article every now and then to capture some of the things I learn along the way.</p>\n<p>It's currently sitting in a private repository... I should probably make it public anyway. </p>\n<p>Thoughts?</p>",
        "id": 422072866,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1708238424
    },
    {
        "content": "<p>This is the tweet in particular but he's been posting a lot about it this week <a href=\"https://x.com/birch_js/status/1757743078738469145?s=20\">https://x.com/birch_js/status/1757743078738469145?s=20</a></p>",
        "id": 422108713,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1708272752
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/stream/231634-beginners/topic/Compile.20to.20javascript.3F.20Build.20Single.20Page.20Application.3F.20SPA.3F/near/422072866\">said</a>:</p>\n<blockquote>\n<p>I've been expanding on my roc+htmx demo, refactoring it and generally tinkering. I think it's a good sandpit for developing basic-webserver features and trying out ideas.</p>\n<p>But I wonder if anyone else would be interested in tinkering with it also? I thought I might ask because if anyone would be interested in making PRs and generally adding random features then that might be fun. <br>\n...<br>\nThoughts?</p>\n</blockquote>\n<p>I've been wanting to learn htmx and expand my limited roc knowledge, so this is cool. I went ahead and created a PR with a feature to add a button to mark a task as completed. <a href=\"https://github.com/lukewilliamboswell/roc-htmx-playground/pull/1\">https://github.com/lukewilliamboswell/roc-htmx-playground/pull/1</a> </p>\n<p>If you don't want to merge it, I won't be offended. I'm just thankful that you created the playground and gave me a good spot to experiment.</p>",
        "id": 422327341,
        "sender_full_name": "Jeffrey Mudge",
        "timestamp": 1708390576
    },
    {
        "content": "<p>Awesome <span aria-label=\"heart eyes\" class=\"emoji emoji-1f60d\" role=\"img\" title=\"heart eyes\">:heart_eyes:</span> I can have a closer look at this later. It's hard to read on my phone, but super cool. How did you find roc + htmx + sqlite? I think they're a pretty nice combination so far.</p>",
        "id": 422328996,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1708391892
    },
    {
        "content": "<p>I find them pretty nice! There are some rough edges and oddities to roc for me still, but building the client side interaction in the element attributes feels good. Having a server side elm-like language is amazing, and the unexpected bumps are an indication of the promising future. You'd already done the hard work with the sqlite stuff, so I just had to write a query and use your existing connection, so I don't feel like I can comment on that too much, but it does seem like a good choice.</p>",
        "id": 422329836,
        "sender_full_name": "Jeffrey Mudge",
        "timestamp": 1708392646
    },
    {
        "content": "<p>Sorry about the formatting changes in my PR. The roc formatter is set to auto format when I save. I probably should have tried to isolate that to a single commit, or turned it off. But I wasn't intending to make a PR when I started messing around, I just wanted to see if I could get it to run, and then wanted to see if I could add a feature. It was only when I'd finished that I thought I should make a PR out of it.</p>",
        "id": 422330116,
        "sender_full_name": "Jeffrey Mudge",
        "timestamp": 1708392879
    }
]