[
    {
        "content": "<p>I think that most difficult and confusing part  of using roc language i situation when certain type was deduced for  specific value in previous  context, and there is error printed that value should adhere to certain type later on. That  all good but  compiler does not point out place when this value  type was deduced in first place and sometimes it is not so easy to figure this out</p>",
        "id": 394216784,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1696169908
    },
    {
        "content": "<p>That's also a problem in Elm. My solution is always to add type annotations, to tell the compiler: No that is actually what I want, tell me why you think this is something else. Though that's not always easy. I the error messages could be improved here, that would be great: \"I think this a X because of how you declared it &lt;here&gt;, but you use it like it is an Y &lt;here&gt;.\" Or something like that.</p>",
        "id": 394240340,
        "sender_full_name": "Fabian Schmalzried",
        "timestamp": 1696181766
    },
    {
        "content": "<p>Can you provide a code example <span class=\"user-mention\" data-user-id=\"568088\">@Artur Swiderski</span>? That will make it easier to discuss improvements.</p>",
        "id": 394356854,
        "sender_full_name": "Anton",
        "timestamp": 1696234928
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"361169\">@Anton</span> <br>\ng = 1u32<br>\np = g &gt;1.1<br>\ncompiler should show me line \"g = 1u32\"  as reference</p>",
        "id": 394381266,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1696240710
    },
    {
        "content": "<p>it only shows that g is expected to be Frac and it is not but there is no line given to support that, here it is trivial and not really necessary but in many cases it is not so trivial</p>",
        "id": 394381740,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1696240854
    },
    {
        "content": "<p>It is indeed a pain point, I've created <a href=\"https://github.com/roc-lang/roc/issues/5877\">an issue</a> with proposed solutions and have asked Ayaz to weigh in.</p>",
        "id": 394417825,
        "sender_full_name": "Anton",
        "timestamp": 1696250329
    }
]