[
    {
        "content": "<p>Hi!</p>\n<p>I'm all new to Roc and I'm trying to get an initial understanding of the language.<br>\nThere was a lot of great material on the website but I'm curious how multi-threading and concurrency is handled.  (or what the plans are)</p>\n<p>Is there any material or talk on the subject?<br>\nI'm coming from the C &amp; Go side (and I have some experience with Clojure) so it would be great if there are some explanation that target us with a imperative mindset. :)</p>\n<p>Very exited about the project in general! &lt;3</p>",
        "id": 293494845,
        "sender_full_name": "Andreas T Jonsson",
        "timestamp": 1660558401
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"523479\">@Andreas T Jonsson</span>, <span class=\"user-mention\" data-user-id=\"343810\">@Brendan Hansknecht</span> has been experimenting with async in <a href=\"https://github.com/bhansconnect/roc-async\">this repository</a>.</p>",
        "id": 293495797,
        "sender_full_name": "Anton",
        "timestamp": 1660558841
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"361169\">@Anton</span> !</p>\n<p>Much appreciated. I will have a look at those examples.</p>",
        "id": 293501385,
        "sender_full_name": "Andreas T Jonsson",
        "timestamp": 1660561715
    },
    {
        "content": "<p>Just to clarify, all of the work is just experiments to see if async await can work with roc at all. The code is messy and maybe not that useful for thinking about general concurrency. Though it was enough to get <a href=\"https://github.com/bhansconnect/roc-todos\">a basic async web handler with db working</a>.</p>",
        "id": 293514699,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1660568000
    },
    {
        "content": "<p>Being a web handler it just doesn't really deal with most of the concurrency work. It is really a set of mostly single threaded code being run by an async executor. Adding go like concurrency features would be a whole nother challenge.</p>",
        "id": 293514887,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1660568064
    },
    {
        "content": "<p>But I guess the answer to your question overall is that for the most part multithreading and concurrency are not handled at all by Roc. It is up to the platform to decide how multithreading and concurrency is exposed to Roc. Roc can be set to use atomic refcounts if that is wanted, but otherwise, Roc has no explicit features for this. My async roc web backend, for example, has no way to tell it is actually running async. One could guess based on the fact it returns data and continuations to the platform, but there is no guarantee.</p>",
        "id": 293515548,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1660568322
    }
]