[
    {
        "content": "<p>I'm struggling quite a bit with understanding tasks, even with the examples on the site (thanks for the examples!). I've been puzzling through it, and eventually finding some solutions, but I've hit a point that seems worth asking about.</p>\n<p>I would have expected these two functions to all be equivalent, but they aren't.</p>\n<div class=\"codehilite\" data-code-language=\"roc\"><pre><span></span><code>loadCharacter1 : Path.Path -&gt; Task.Task (List Str) _\nloadCharacter1 = \\path -&gt;\n    File.readUtf8 path\n    |&gt; Task.map \\contents -&gt; Parser.strToSteps contents\n\nloadCharacter2 : Path.Path -&gt; Task.Task (List Str) _\nloadCharacter2 = \\path -&gt;\n    contents = File.readUtf8! path\n    Parser.strToSteps contents\n</code></pre></div>\n<p><code>loadCharacter1</code> works, but <code>loadCharacter2</code> gives me an error I don't understand:</p>\n<div class=\"codehilite\"><pre><span></span><code>This 2nd argument to this function has an unexpected type:\n\n53│      contents = File.readUtf8! path\n                    ^^^^^^^^^^^^^^^^^^^\n\nThe argument is an anonymous function of type:\n\n    Str -&gt; List Str\n\nBut this function needs its 2nd argument to be:\n\n    Str -&gt; InternalTask.Task c [\n        FileReadErr Path.Path InternalFile.ReadErr,\n        FileReadUtf8Err Path.Path [BadUtf8 Utf8ByteProblem U64],\n    ]\n</code></pre></div>\n<p>Can someone help me understand what this error is saying, and how I should be using tasks here?</p>",
        "id": 446491300,
        "sender_full_name": "Mythmon",
        "timestamp": 1719188733
    },
    {
        "content": "<p>Im not sure what <code>Parser.strToSteps</code> is. But the bit you are missing is that the <code>!</code> bang operator is equivalent to <code>Task.await</code> which is different from <code>Task.map</code>.</p>",
        "id": 446492766,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1719189974
    },
    {
        "content": "<p>So I'm guessing to make the second work you need to add wrap the final expression in a <code>Task.ok</code></p>",
        "id": 446492806,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1719190022
    },
    {
        "content": "<p>Oh, actually we can see that from the error message. So yeah, the first is mapping the success value in the task, while the second is currently trying to return a List Str, but it should be returning a Task (List Str) _.</p>",
        "id": 446492917,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1719190117
    },
    {
        "content": "<p>I think this is one of the places where error messaging could be improved. With the bang syntax, it is not really clear that it desugars to await for a beginner. So having the error message refer to 'an anonymous function' can be quite confusing for a beginner I would think</p>",
        "id": 446515813,
        "sender_full_name": "Kilian Vounckx",
        "timestamp": 1719203448
    },
    {
        "content": "<p>Maybe having some specific language in the error around it could help, but I think my problem is more conceptual. The Roc home page says about <code>!</code>:</p>\n<blockquote>\n<p>The <code>!</code> operator is similar to <code>await</code> in other languages. It means “wait until the asynchronous <code>File.readUtf8</code> operation successfully completes.”</p>\n</blockquote>\n<p>and the tutorial says</p>\n<blockquote>\n<p>Basically, [Task.await] creates a task which runs one task, and then runs a second task which can use the output of the first task. (If the first task fails, the second task never gets run.)</p>\n</blockquote>\n<p>With \"<code>await</code> in other languages\" it doesn't matter what comes after the line that uses await, it just continues normal execution. It isn't clear that <code>!</code> requires the rest of the function to already be a Task, nor is it clear to me what that even means. I've puzzled through a few more functions like this now, and I still don't think I know if I can use <code>!</code> or not unless I just try it.</p>",
        "id": 446518927,
        "sender_full_name": "Mythmon",
        "timestamp": 1719205632
    },
    {
        "content": "<p>thats a really good point. In roc, the task is part of the type system and is a contract.</p>",
        "id": 446520145,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1719206581
    },
    {
        "content": "<p>That said, this is true of other languages as well, but in a less direct way. They normally include <code>async</code> as part of the function definition.</p>",
        "id": 446520184,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1719206609
    },
    {
        "content": "<p>That is structurally equivalent to returning a task in roc.</p>",
        "id": 446520201,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1719206623
    },
    {
        "content": "<p>Though in roc, you have to be explicit. It would probably be helpful to automatically wrap the final statement in roc for function that return tasks. This would make it feel work like other languages where you just specify a function is <code>async</code></p>",
        "id": 446520318,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1719206675
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Confusion.20about.20tasks/near/446520318\">said</a>:</p>\n<blockquote>\n<p>Though in roc, you have to be explicit. It would probably be helpful to automatically wrap the final statement in roc for function that return tasks. This would make it feel work like other languages where you just specify a function is <code>async</code></p>\n</blockquote>\n<p>This sounds nice, but then it kinda breaks Roc's feature that functions work the same with or without their type annotations. It sounds like what you're describing would return a Task with a type annotation, but a Result or whatever without</p>",
        "id": 446520853,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1719207091
    },
    {
        "content": "<p>Well, I don't think that auto wrapping is a good idea because at least to me this is something I hate abot the async await feature in C# (my current language in my day job). I guess that this was made for convenience, but as I saw this at first (the method's return type is <code>Task&lt;string&gt;</code> but the method returns a string) I was confused why the method returns the inner type of the task instead of the task. Yes, such automagic sugar reduces some clutter, but on the other hand it can lead to confusion when there is some sort of a regular convention (like methods return a value of the same type as the method's return type) and then there are exceptions to that rule which you have to learn.</p>",
        "id": 446521174,
        "sender_full_name": "Akeshihiro",
        "timestamp": 1719207309
    },
    {
        "content": "<p>To clarify, I think this would only happen with functions that use <code>!</code>. Basically, the <code>!</code> would be the indicator that autowrapping is safe. Not saying it is a great idea, but it would be deterministic.</p>",
        "id": 446523231,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1719208643
    },
    {
        "content": "<p>That would be viable, then, yep</p>",
        "id": 446523362,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1719208713
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Confusion.20about.20tasks/near/446523231\">said</a>:</p>\n<blockquote>\n<p>To clarify, I think this would only happen with functions that use <code>!</code>. Basically, the <code>!</code> would be the indicator that autowrapping is safe. Not saying it is a great idea, but it would be deterministic.</p>\n</blockquote>\n<p>I don't think it is a good idea. I know this is rare and probably a code smell, but at the moment, having a function return <code>Task (Task _ _) _</code> is totally legal. If you always autowrap the last expression with <code>Task.ok</code>, you couldn't explicitly wrap it. Because if you explicitly wrapped it, it would become such a nested Task, which is probably not what the user wants</p>",
        "id": 446548902,
        "sender_full_name": "Kilian Vounckx",
        "timestamp": 1719217513
    },
    {
        "content": "<p>You could explicitly wrap it by annotating the return type to be <code>Task (Task _)</code>, but it wouldn't be great to have to do that. However, we do already automatically drop <code>!</code> usages at the end of a function if they're for the return value (e.g. a function that returns <code>Task</code>that calls <code>Stdout.line! ...</code> at the end will ignore that <code>!</code>), so we've already lost our \"perfect purity\".</p>",
        "id": 446551686,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1719218433
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"461444\">Sam Mohr</span> <a href=\"#narrow/stream/231634-beginners/topic/Confusion.20about.20tasks/near/446551686\">said</a>:</p>\n<blockquote>\n<p>we do already automatically drop <code>!</code> usages at the end of a function if they're for the return value (e.g. a function that returns <code>Task</code>that calls <code>Stdout.line! ...</code> at the end will ignore that <code>!</code>), so we've already lost our \"perfect purity\".</p>\n</blockquote>\n<p>But this doesn't mean the type can't be inferred. You could say that <code>!</code> at the end desugars to <code>Task.await _ \\x -&gt; Task.ok x</code>. It wouldn't make sense to wrap it. Autowrapping however would either need explicit type annotation, or the weird corner case  of nested Tasks.</p>",
        "id": 446553677,
        "sender_full_name": "Kilian Vounckx",
        "timestamp": 1719219116
    },
    {
        "content": "<p>But I guess we agree we shouldn't autowrap</p>",
        "id": 446553817,
        "sender_full_name": "Kilian Vounckx",
        "timestamp": 1719219143
    },
    {
        "content": "<p>I think autowrapping could be nice, but a relatively unimportant feature in the scheme of things.</p>\n<p>I think the real essence of the comment above is that auto-wrapping probably doesn't have a clear integration with type inference. Without type inference, it is trivial. Optionally add a <code>Task.ok</code> if that yields the type requested by the output.</p>\n<p>With type inference, I don't think there is a flexible rule to decide when to wrap. I think you are stuck with a strict rule. I don't think a strict rule is the right choice. You don't really want always <code>Task.ok</code> or never <code>Task.ok</code>. You want an extra <code>Task.ok</code> when it is convenient.</p>\n<hr>\n<p>As a related note, this is essentially the same as having implicit type conversion/implicit type constructors (just in a really narrow scope). Which roc doesn't have anywhere else....well, kinda a little bit with tag merging, but that is different.</p>",
        "id": 446655395,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1719244990
    }
]