[
    {
        "content": "<p>Hey, I still don't get how we could send \"tags aka union types (?!)\" from one context to another context, for exemple : from a pg db to a CLI app ? Because, let's assume we have 2 package having the same tags (Toto Int and Toto String), how can it be parsed correctly ?</p>",
        "id": 503178464,
        "sender_full_name": "Tib",
        "timestamp": 1741062796
    },
    {
        "content": "<p>This a point of confusion with tag unions, since tags with the same name but different payloads are not related at all, except for causing type errors when you try to make a single union with two tags of the same name but different payloads</p>",
        "id": 503178900,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1741063069
    },
    {
        "content": "<p>Meaning you'll have to go another way, for example making a sub-union like <code>TotoData : [Int, String]</code> or something that <code>Toto</code> holds onto, or otherwise do manual threading of the data</p>",
        "id": 503179020,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1741063129
    },
    {
        "content": "<p>As much as this is a hindrance, I think some alternative where there there can only be one payload type per tag would be a super annoying global poisoning, so I don't know a way around this limitation</p>",
        "id": 503179190,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1741063214
    },
    {
        "content": "<p>We could also namespace things, but it would sacrify naming simplicity, but I guess it's the price to pay. I still struggle to imagine it at scale.</p>",
        "id": 503184028,
        "sender_full_name": "Tib",
        "timestamp": 1741066064
    },
    {
        "content": "<p>If you figure something out, we'd love to hear it! These are hard problems</p>",
        "id": 503203156,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1741075620
    },
    {
        "content": "<p>My biggest issue is also updatability, imagine I merge 2 databases with \"old\" values, then we have a problem, because if tags are only strings, then a tag can mean 2 (or more) different things.</p>\n<p>Yep, it's a tough problem, I don't have any solution, I'm just thinking about the problem, you know for example in Lamdera, you have migration of data, and when you migrate, you take the old \"tags\" (aka adt), and make them follow the new schema, it's all pretty clear, asks some boilerplate, but what's cool is that's it isn't ambiguous at all. In lamdera, it's namespaced by the name of the file. But if we store that inside a db, it doesn't belong to a \"file\" anymore, so it's complex.</p>",
        "id": 503204214,
        "sender_full_name": "Tib",
        "timestamp": 1741076013
    },
    {
        "content": "<p>Roc does have opaque types (which could be seen as a namespace and stop tags from unifying). And longer term, those will switch to the slighly more useable/friendly custom types</p>",
        "id": 503321248,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1741108338
    },
    {
        "content": "<p>Via that, you have uniquely grouped tags that are defined in a single location and won't merge with other tags (even if they have the exact same names and types)</p>",
        "id": 503321384,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1741108382
    },
    {
        "content": "<p>I assume for interacting with the outside (web, db, etc), custom types will be the default.</p>",
        "id": 503321448,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1741108405
    },
    {
        "content": "<p>So that may color a lot of the design</p>",
        "id": 503321474,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1741108413
    },
    {
        "content": "<p>looks amazing</p>\n<p>custom types will be designed like in elm or different ?</p>",
        "id": 503321635,
        "sender_full_name": "Tib",
        "timestamp": 1741108450
    },
    {
        "content": "<p>I think like in elm, but I'm not actually sure. I have only done a tiny bit of elm and it has been quite a while. <a class=\"stream-topic\" data-stream-id=\"304641\" href=\"/#narrow/channel/304641-ideas/topic/custom.20types/with/481023599\">#ideas &gt; custom types</a> has a design doc as the very first message</p>",
        "id": 503324944,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1741109474
    }
]