[
    {
        "content": "<p>What is the motivation behind the insertion order preservation in dicts? </p>\n<div class=\"codehilite\"><pre><span></span><code>x = Dict.empty {}\n    |&gt; Dict.insert &quot;a&quot; 0\n    |&gt; Dict.insert &quot;b&quot; 1\n\ny = Dict.empty {}\n    |&gt; Dict.insert &quot;b&quot; 1\n    |&gt; Dict.insert &quot;a&quot; 0\n</code></pre></div>\n<p>My gut feeling says the resulting dicts are structurally the same, but the insertion order says the opposite. The <code>Hash</code> implementation should always respect the insertion order otherwise the order is pure overhead and a potential source of ambiguity. So the eq check should always give <code>false</code> here.</p>\n<p>Maybe my confusion comes from the name <code>Dict</code>. <code>OrderedDict</code> would emphasize the presence of the order which is important for the structure. On the other hand, if there is an <code>Ordered</code> collection - where is the <code>Unordered</code> one?</p>\n<p>Maybe my intuition is wrong here. Anyway, the questions:</p>\n<ul>\n<li>Why the ordered dict was chosen over the unordered one for the std?</li>\n<li>Isn't the ordered one more expensive and not as basic as the unordered one?</li>\n</ul>\n<p>Upd. there's also a <code>Dict.remove</code> that performs a swap remove, which breaks the idea of insertion order, no?</p>",
        "id": 360775711,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684931520
    },
    {
        "content": "<p>good question!</p>",
        "id": 360780728,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684932784
    },
    {
        "content": "<p>the main motivation is:</p>\n<ul>\n<li>we want to be able to change the hashing function in the future without breaking people's code. If the dictionary's traversal order is determined by hashing function, then changing the hashing function can easily cause bugs in peoples' code. This way, it can be done without risking breaking anyone's code.</li>\n<li>we've seen from other languages that there are use cases for wanting a dictionary that preserves insertion order</li>\n</ul>",
        "id": 360781613,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684932970
    },
    {
        "content": "<p>we based the design on <a href=\"https://docs.rs/indexmap/latest/indexmap/\"><code>IndexMap</code></a> from Rust, which has these properties. <code>remove</code> changes the order for performance reasons; we plan to add a <code>removeShift</code> which is (a lot) slower, but preserves insertion order.</p>",
        "id": 360781945,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684933046
    },
    {
        "content": "<p>when they tried replacing the standard (unordered) hashmap in the Rust compiler with <code>IndexMap</code>, they found the performance was basically the same (slightly better in some places, slightly worse in others, overall about a wash) - generally, compared to a normal hash map, <code>IndexMap</code> takes up more memory and takes a little bit longer to insert and to remove, but is faster at traversals. So it depends on how you're using it, but overall the amount of extra time seems to be small enough to be unconcerning.</p>",
        "id": 360782436,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684933150
    },
    {
        "content": "<p>That makes sense, I also saw the link to the <code>IndexMap</code> in the std docs and looked through <a href=\"https://github.com/roc-lang/roc/issues/1955\">the issue</a>.</p>\n<p>But from the equality perspective - is my understanding correct that the order matters?</p>\n<p>So the rule of thumb can be \"if you need to walk your collection - use <code>Dict</code>, if you don't plan to walk much and need equality check - use something else\"?</p>\n<p>Also, if my understanding is correct, then there's an inconsistency in <code>Set</code>:</p>\n<div class=\"codehilite\"><pre><span></span><code>x = Set.empty {}\n    |&gt; Set.insert 0\n    |&gt; Set.insert 1\n\ny = Set.empty {}\n    |&gt; Set.insert 1\n    |&gt; Set.insert 0\n\nx == y\n</code></pre></div>\n<p>but running <code>Set.toList</code> on them produces order preserved results:</p>\n<div class=\"codehilite\"><pre><span></span><code>[0, 1] : List (Num *)\n[1, 0] : List (Num *)\n</code></pre></div>",
        "id": 360789364,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684934716
    },
    {
        "content": "<p><code>==</code> should not care about insertion order for either <code>Set</code> or <code>Dict</code></p>",
        "id": 360791961,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684935286
    },
    {
        "content": "<p>(if it does, that's a bug!)</p>",
        "id": 360792091,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684935322
    },
    {
        "content": "<p>Then <code>Set.toList</code> is not correct because if both sets are equal, any operation on them should produce the same result. But <code>Set.toList</code> outputs lists ordered differently. The same intuition for the <code>Dict</code>.<br>\nOtherwise, I probably don't get the equality concept in roc</p>",
        "id": 360798849,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684936806
    },
    {
        "content": "<p>yeah we discussed this scenario - since Roc supports custom equality (e.g. anyone can write a custom <code>Eq</code> implementation for their opaque type which does whatever they like), it's not possible to guarantee in the general case that <code>x == y</code> implies <code>f x == f y</code> (unless we get rid of custom equality, but it seems more valuable to have custom equality in the language than this guarantee)</p>\n<p>so since we already can't have that guarantee, the design questions for <code>Eq</code> and <code>toList</code> on dictionaries and sets become things like:</p>\n<ul>\n<li>what's the least surprising?</li>\n<li>what's the least error-prone?</li>\n<li>what are the performance considerations?</li>\n</ul>",
        "id": 360806119,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684938302
    },
    {
        "content": "<p>performance aside, unfortunately this is a case where making it less surprising makes it more error-prone</p>",
        "id": 360806319,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684938352
    },
    {
        "content": "<p>specifically, it seems common to use <code>==</code> on dictionaries and sets assuming that they'll be equal if they have all the same keys and values</p>",
        "id": 360806532,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684938403
    },
    {
        "content": "<p>especially in the case of sets - that's basically the definition of \"set equality\" outside of programming</p>",
        "id": 360806612,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684938424
    },
    {
        "content": "<p>so although it's surprising that <code>toList a == toList b</code> might be false when <code>a == b</code> it doesn't seem as likely to cause bugs as having <code>==</code> on the collections themselves sometimes return false even when the collections have the same contents (but they were inserted in a different order)</p>",
        "id": 360806913,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684938489
    },
    {
        "content": "<p>so unfortunately this is a situation where there does not exist a design that checks every box, and this design is the one we ended up with because it seems to be less error-prone than the less-surprising alternative</p>",
        "id": 360807174,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684938541
    },
    {
        "content": "<p>Outside the programming, sets have no order. Currently, the <code>Set</code> looks like a structure</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n  sortedUniqueItems: [a, b, c],\n  orderIndicies: [0, 2, 1]\n}\n</code></pre></div>\n<p>When we iterate over it, we get the order <code>a, c, b</code> combining both of the \"fields\" and when we hash it - we use only the <code>sortedUniqueItems</code> part of the structure. So hashing algorithm here is an intentional collision. To avoid that, it should either use the whole structure or the structure shouldn't have the <code>orderIndicies</code></p>\n<p>But here is where the <code>performance</code> point bites. <code>insert</code> or <code>toList</code> can potentially become more complex (to keep the sorted list)</p>\n<hr>\n<p>I would suggest to drop the iteration out from both <code>Dict</code> and <code>Set</code> or provide an arbitrary order because order has no sense there conceptually but it would be too bold to suggest such change :D<br>\nMy main concern is that it's not possible to have both <code>insertion order</code> and <code>equality by hash</code> for these structures (whatever is possible of corse, it's only a matter of convention. More on this below)</p>\n<hr>\n<blockquote>\n<p>it's not possible to guarantee in the general case that <code>x == y</code> implies <code>f x == f y</code></p>\n</blockquote>\n<p>The most interesting part in this snippet is the <code>==</code>. What I'm talking about is about a contract which the <code>Eq</code> ability is. The ability should provide a clear meaning of itself - with this, we can say if the implementation is correct for the structure. The snippet can be rewritten this way: \"<code>A.Eq x y</code> doesn't imply the <code>B.Eq (f x) (f y)</code>\" and it will be correct because now we see that we have different equalities. But since <code>Eq</code> are not functions of the <code>A</code> and <code>B</code> types but are implementation of the ability <code>Eq</code> - the general case for the snippet should be guaranteed otherwise it's a violation of the contract and can be considered as a bug.</p>\n<p>Shortly, yes, it's not possible to guarantee the general case, but it's possible for the standard library.</p>",
        "id": 360825378,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684942404
    },
    {
        "content": "<p>I am confused by your first example, what is <code>{sortedUniqueItems, orderIndices}</code> supposed to be?</p>",
        "id": 360827477,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684942895
    },
    {
        "content": "<p>An abstract underlying structure, minimal implementation that corresponds the current behavior</p>",
        "id": 360828195,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684943051
    },
    {
        "content": "<p>Sure, but it is not representative of the perf characteristics. The current behavior is faster for some uses and slower for other uses. It is based on <a href=\"https://github.com/bluss/indexmap\">indexmap</a>. They tested replacing every hashmap in <code>rustc</code> with an indexmap and the perf was approximately the same. <code>rustc</code> has a lot of perf benchmarking, so I think this is an exceptionally minimal tradeoff.</p>",
        "id": 360829278,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684943318
    },
    {
        "content": "<p>For example, <code>insert</code> is basically the same cost and <code>toList</code> is actually free.</p>",
        "id": 360829494,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684943367
    },
    {
        "content": "<p>Yeah, Richard told the same. I’m not talking about the performance already</p>",
        "id": 360829751,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684943422
    },
    {
        "content": "<p>As for arbitrary order there are some issues. First, you have to decide if the dict is randomly or statically seeded. Then based on that you hit different issues.</p>\n<p>Statically seeded:</p>\n<ul>\n<li>We can never change your hashing algorithm without it being a breaking change to user.</li>\n<li>It is trivial to attack the hashmaps (I've already done it). This means if you use a Dict in a web server with client specified keys, I can DOS you much easier.</li>\n</ul>\n<p>Randomly seeded:</p>\n<ul>\n<li>A user can extract a random number at any time. This means that <code>x == y</code> implies <code>f x == f y</code> is broken for the entire language.</li>\n</ul>",
        "id": 360831396,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684943820
    },
    {
        "content": "<p>With insertion order, we can be randomly seeded without issues since the hashed order is never exposed to userland.</p>",
        "id": 360831736,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684943901
    },
    {
        "content": "<blockquote>\n<p>both <code>insertion order</code> and <code>equality by hash</code></p>\n</blockquote>\n<p>This is possible. We do it for <code>Set</code>.</p>",
        "id": 360832024,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684943985
    },
    {
        "content": "<p>hmm, actually we don't currently do it for <code>Set</code>, but we have <a href=\"https://github.com/roc-lang/roc/blob/main/crates/compiler/builtins/roc/Hash.roc#L115-L137\">hashUnordered</a> which means we could do it.</p>",
        "id": 360832619,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684944123
    },
    {
        "content": "<blockquote>\n<p>more valuable to have custom equality in the language than this guarantee</p>\n</blockquote>\n<p>I don't really get this one ... is there some way to define == such that the user never 'feels a missing need' for a custom == implementation _and_ they get a wider guarantee for more values x,y that x == y =&gt; f x == f y ?  </p>\n<p>Type-specific definitions for a notion of 'sameness comparison' that lose x eq y =&gt; f x eq f y trends more toward 'type specific' operations to me -- is there really a reason to force the variety of kinds of 'application specific sameness operations for a type' to share the == operator name ...?  </p>\n<p>What is the unifying design principle for == in roc such that folks implementing a custom == would be likely to minimize surprise when implementing a custom == for their types?</p>",
        "id": 360833760,
        "sender_full_name": "Ben Cohen",
        "timestamp": 1684944388
    },
    {
        "content": "<p>A simple example here that can break <code>x == y =&gt; f x == f y</code> is any structure with a capacity or group of unused elements. If any information is exposed about the capacity or unused elements in any way, you can depend on that in <code>f</code> to make the comparison no longer equal.</p>",
        "id": 360834665,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684944662
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"584248\">Kiryl Dziamura</span> <a href=\"#narrow/stream/231634-beginners/topic/Dict.20insertion.20order/near/360825378\">said</a>:</p>\n<blockquote>\n<p>it's not possible to guarantee the general case, but it's possible for the standard library.</p>\n</blockquote>\n<p>sure, but as guarantees go, I don't think that's a particularly valuable one. <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span> </p>\n<p>to me, the main value in guarantees is that they let you quickly rule things out and/or stop thinking about them altogether, without getting burned</p>",
        "id": 360835435,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684944871
    },
    {
        "content": "<p>\"can I rely on <code>a == b</code> implying <code>f a == f b</code>? hang on, let me real quick just make sure that <code>f</code>, <code>a</code>, and <code>b</code> only use builtin functions and data structures...\"</p>",
        "id": 360835569,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684944907
    },
    {
        "content": "<p>I think as a Roc programmer, it's more helpful to have a mental model of \"I can never rely on <code>a == b</code> implying <code>f a == f b</code>\" so I don't really see much value in having that be true for builtins (and one could even argue it's a footgun because you might get accustomed to that being true, and then get burned when you discover it's not true after using a userspace opaque type with custom equality)</p>",
        "id": 360835973,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684944992
    },
    {
        "content": "<p>as a quick note, which might be helpful: here are some of the things that are important to me in this design decision:</p>\n<ul>\n<li>how fast does it run</li>\n<li>how error-prone is it</li>\n<li>how surprising is the behavior</li>\n<li>how easy is it to learn and understand</li>\n<li>what does it permit you to do in the language</li>\n</ul>",
        "id": 360836433,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684945096
    },
    {
        "content": "<p>so for example, \"let's change it so that you are no longer permitted to do custom equality in Roc\" is a big downside, and so I think there would need to be a correspondingly large upside <em>on one of these dimensions</em> to justify it</p>",
        "id": 360836651,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684945148
    },
    {
        "content": "<p>e.g. \"people are seeing bugs all the time in Python because they also maintain dictionary insertion order but don't consider it during equality checks\" would be a compelling point because it speaks to \"how error-prone is it\" (I haven't heard this from Python programmers though)</p>",
        "id": 360837046,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684945241
    },
    {
        "content": "<p>but like \"this design just feels wrong to me\" is not specific enough a reason to change it, given all the tradeoffs here...we've discussed a lot of alternative designs in the past, and they all had more serious downsides than \"it feels wrong\" (and often included that one too, in one way or another!)</p>",
        "id": 360837316,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684945304
    },
    {
        "content": "<p>also worth noting: \"how surprising is the behavior\" has an unfortunately high minimum amount of surprise here because...</p>\n<ul>\n<li>if <code>toList a == toList b</code> is false when <code>a == b</code>, that is surprising to some people</li>\n<li>if <code>a == b</code> were to be false just because the order was different, that would also be surprising to some people</li>\n</ul>\n<p>so either design would be surprising to one substantial group or another. Also, if we were to get rid of traversals altogether, that would be an extreme loss of functionality.</p>",
        "id": 360837860,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684945435
    },
    {
        "content": "<p>we could require <code>toList</code> (and <code>walk</code>, and any other traversals where ordering becomes observable) to take a sorting function or something like that, but that would have an extremely high performance cost for the most common case where all you want to do is to traverse the collection and don't care about order</p>",
        "id": 360840216,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684946022
    },
    {
        "content": "<p>No offense from my side. Your reasoning means that <code>Eq</code> doesn't require the extensionality property. It’s strange to me but I can live with that 😊</p>",
        "id": 360840386,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684946056
    },
    {
        "content": "<p>fair enough! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 360840630,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684946125
    },
    {
        "content": "<p>General question, do any languages have extensional equality across all types? I would assume that would be pretty impossible with reasonable ergonomics. You wouldn't be able to have any types with custom equality (at least to my understanding).</p>",
        "id": 360845599,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684947391
    },
    {
        "content": "<p>I doubt, will ask my friend Gepete <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span><br>\nI think it's in general an expected property, but can’t be mandatory. Btw, it would be nice to add the <code>Set.toList</code> as an example of such behavior to the <code>Eq</code> doc</p>",
        "id": 360848884,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684948209
    },
    {
        "content": "<p>Interesting!  Thanks for the thoughts :)</p>\n<p>Out of curiosity -- I wonder the degree to which the examples mentioned actually fully cover the design space for custom == </p>\n<p>eg</p>\n<ul>\n<li>sometimes you want to exclude certain fields from an equality comparison entirely (like the capacity example)</li>\n<li>sometimes you want some variation in the handling of sequence like fields (comparison of values without order)</li>\n</ul>\n<p>These seem like compelling examples ... are they actually the only ones that matter?  </p>\n<p>Sorry if Im asking folks to rediscuss something that has been debated  sufficiently and well settled -- I just wandering into this discussion by wondering if there might be a design where less power could actually be \"better\" and more likely to maximize the benefit ... - like maybe custom == is not a general function users should be able to define for types -- but more like an optional description per type of some fields that are not observable for equality comparison and some fields that have a particular behavior with regard to sequences and ordering ...</p>",
        "id": 360853473,
        "sender_full_name": "Ben Cohen",
        "timestamp": 1684949401
    },
    {
        "content": "<p>Another example, though in a similar line is having a file and collision resistant large hash stored together. Then only comparing the hash instead of the entire file.</p>",
        "id": 360856166,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684950224
    },
    {
        "content": "<p>I have seen that in systems.</p>",
        "id": 360856206,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684950234
    },
    {
        "content": "<p>Also, in Roc, opaque types do not have equality by default. So any struct with an opaque type in it would lose equality without having custom equality on the opaque type.</p>",
        "id": 360856724,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684950360
    },
    {
        "content": "<p>But yeah, I think it mostly comes down to custom handling of fields (ignored, out of order, only going to length instead of capacity)</p>",
        "id": 360856899,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684950405
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Dict.20insertion.20order/near/360834665\">said</a>:</p>\n<blockquote>\n<p>A simple example here that can break <code>x == y =&gt; f x == f y</code> is any structure with a capacity or group of unused elements. If any information is exposed about the capacity or unused elements in any way, you can depend on that in <code>f</code> to make the comparison no longer equal.</p>\n</blockquote>\n<p>In the case of capacity the structures with the same payload but different capacities are equal as long as the capacity doesn't affect any properties of the structure. If capacity means allocation, which can be extended/panic when the capacity is exceeded, then capacity is a kind of metadata, not data itself, and shouldn't affect the eq check. On the other hand, if the capacity is a part of business logic and acts as a limiter that ignores new data when the cap is exceeded - it’s part of the payload.</p>\n<p>I mean, capacity, length, empty items - they are parts of metadata if we are talking about a preallocated array. The same way the order is part of metadata for a set. Since the set has no order by its nature - it’s only a nuance of implementation.</p>\n<p>The exposed capacity of an array or the exposed order of a set - they are exposure of implementation details. From that perspective, there are no problems with the insertion order.</p>\n<p>I apologize for being picky and annoying. Just wanted to explain my intuition. I think we are on the same page. In the end of the day, what is considered as meta is the matter of the domain</p>",
        "id": 360905845,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684966214
    },
    {
        "content": "<p>Not picky and annoying. A good clarification of how you view it.</p>",
        "id": 360909198,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684967919
    },
    {
        "content": "<p>I do agree that the order of a set can just be an implementation detail (we have decided to expose it in a specific way).</p>",
        "id": 360909259,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684967961
    },
    {
        "content": "<p>I think where this gets complex is that people want to convert sets to lists or walk the elements of a set. Those are common use cases.</p>",
        "id": 360909286,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684967994
    },
    {
        "content": "<p>In order to avoid a large cost, exposing the set order explicitly is the cleanest option (at least from our view so far based on looking at tradeoffs. Totally open to consider other solutions)</p>",
        "id": 360909382,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684968030
    },
    {
        "content": "<p>If Roc wasn't a pure functional language, I definitely would push for a random order. Sadly, that leaks randomness into Roc userland: Insert 0 to 10 into a set; Convert it to a list; Get the first element; you now have a random number.</p>",
        "id": 360910309,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684968594
    },
    {
        "content": "<p>For security purposes, the problem with the weak hash system you outlined (predictable hashes) is a problem of the developer's expertise and choice of tool, I think. I believe there are crypto structures based on a stable but configurable entropy source. But it would be cumbersome to do in std, of course, thus it makes sense to have a predictable order in terms of reliability. I see only three ways to do so: insertion order, sorted order, and rnd based as a special case for the sorted.  Since rnd variant requires an explicit input for the structure, and sorting requires the implementation of <code>Ord</code> for the elements, the only simple choice is the insertion order that anyway allows sorting afterward.<br>\nSo all points in the thread make sense to me.</p>",
        "id": 360964170,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1684998781
    },
    {
        "content": "<p>Just to clarify, the problem isn't with a weak hash system. The problem is having a known hash system and seed (anyone can look at the roc source code and find out what it is)</p>\n<p>Even if we were to switch to a cryptographically secure hash, this attack is totally doable due to the limited capacity of a dict/set. On top of that a cryptographically secure hash is so slow that it isn't reasonable to begin with.</p>\n<p>We did chat a good bit about requiring a userland specified seed. Which could alleviate the larger problem. The issue is that not all platforms provide a way to get randomness and if a user hardcodes a seed cause it is convenient, they are back to the same issue.</p>",
        "id": 361074318,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1685024079
    },
    {
        "content": "<p>Aside: maybe not yet in the latest nightly, but Set hashing and Dict hashing + equality should now fully work.</p>\n<p>So sets as dict keys and checking if dict1 == dict2 should now work. Though dict only has Eq if the value it holds has Eq.</p>",
        "id": 361075589,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1685024338
    },
    {
        "content": "<p>I understand the problem with public algo, just used too general wording.<br>\nA great point regarding the platform constraints on crypto security btw!</p>",
        "id": 361077979,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1685024861
    }
]