[
    {
        "content": "<p>Should Types have their doc comments included in the generated html? I've been trying to follow along and figure out why they aren't being included, but it's a long way down the rabbit hole. I'm currently looking at peg_grammar and highlight_parser and I'm pretty sure I'm way off course.  Can anyone help me understand why the comments for types aren't being generated?</p>",
        "id": 304607072,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1666066422
    },
    {
        "content": "<p>I don't know, but I do know it's a bug - types should definitely be included in the docs!</p>",
        "id": 304608529,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1666067933
    },
    {
        "content": "<p>I'm not sure where the problem is happening, but I'd look for code using the Rust CommonMark parser - that should be where we parse the doc comments, so it ought to be a starting point at least!</p>",
        "id": 304608633,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1666068008
    },
    {
        "content": "<p>I don't know the reason either but if you feel you're veering off course then I recommend inserting some debug print statements to look at variable values. <code>dbg!(&amp;some_variable);</code>. The <code>&amp;</code> is usually enough to pacify the borrow checker.</p>",
        "id": 304608806,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1666068213
    },
    {
        "content": "<p>Can I confirm the design/intent for comments, <code>#</code> is for inline comments while <code>##</code> is document comments for inclusion in generated docs? Using <code>#</code> as a line comment should not be permitted? or is that for comments that are intentionally left out of generated docs?</p>",
        "id": 304610831,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1666069955
    },
    {
        "content": "<p>I'm just adding a section on comments into the tutorial for future reference.</p>",
        "id": 304611010,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1666070077
    },
    {
        "content": "<p><code>peg_grammar</code> and <code>highlight_parser</code> are currently unused for the docs generation.</p>",
        "id": 304615865,
        "sender_full_name": "Anton",
        "timestamp": 1666073564
    },
    {
        "content": "<p>yeah <code>#</code> is for comments intentionally left out of docs, and <code>##</code> is for doc comments!</p>",
        "id": 304627881,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1666079874
    },
    {
        "content": "<p>Also, I think I've finally figured out the issue is I was referring to above... I was concerned about at the opaque types which are not currently being generated to html. I am reasonably sure the doc comments are there in the LoadedModule but I think they are just assigned <code>NoTypeAnn</code> for the <code>TypeAnnotation</code> specifically line 247 in crates/compiler/load_internal/src/docs.rs. Not sure how easy this is to add, my Rust is pretty basic.</p>",
        "id": 304635550,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1666082980
    },
    {
        "content": "<p>I've added a PR <a href=\"https://github.com/roc-lang/roc/pull/4357\">#4357</a> which adds some discussion on comments to the Tutorial. There was some information in the Roc for Elm devs, so I used that and expanded it based on what I have learn't about comments so far. It should be ready for review.</p>",
        "id": 304640641,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1666085045
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span>, I'll take a look :)</p>",
        "id": 304640719,
        "sender_full_name": "Anton",
        "timestamp": 1666085078
    }
]