[
    {
        "content": "<p>I've got a question regarding the documentation and the public milestone:</p>\n<p>Currently, it seems to me that the documentation is more focused on the how, but we are still missing the why / where there. To me, it seems that we are missing a short pitch where we see the language heading (and where not, perhaps based on use cases) and assume that people interested know its potential benefits.</p>\n<p>So it seems to me that it might be beneficial to add some answers to the questions right in the FAQ / Readme:</p>\n<ol>\n<li>What are Rocs use cases (and what not)?<br>\n1.1 Why is Roc beneficial for that use case compared to other options?<br>\n1.2 What is the state of support for that use case?<br>\n1.3 Where do we not see support for that use case in the mid-term future?</li>\n</ol>\n<p>However, these are likely to depend on the platforms that are made available early on which, apart from the main contributors, are likely to be of most interest to potential Roc developers.</p>\n<p>I know that some of these answers are implicitly given in some of Richard's talks, but I guess we can't assume everybody to watch through them. Is anyone else of the same opinion? Is this something we should be working on?</p>",
        "id": 289424158,
        "sender_full_name": "Tobias Steckenborn",
        "timestamp": 1657697642
    },
    {
        "content": "<p>just my 2c - but I think there is an emergent aspect of Roc that makes it tricky to plan its use cases ahead.</p>\n<p>the platform approach is very hackable and I'm super curious about what people will come up with. it would be sad to encourage specific use cases on its infancy instead of just being surprised for a while and then showcasing all the different things that happened.</p>",
        "id": 289527027,
        "sender_full_name": "Georges Boris",
        "timestamp": 1657749729
    },
    {
        "content": "<blockquote>\n<p>Currently, it seems to me that the documentation is more focused on the how, but we are still missing the why / where there. To me, it seems that we are missing a short pitch where we see the language heading (and where not, perhaps based on use cases) and assume that people interested know its potential benefits.</p>\n</blockquote>\n<p>this is partly by design, actually! I don't want to \"market\" Roc as more polished than it actually is.</p>\n<p>so right now it's <em>almost</em> good for certain use cases, but it's not there yet. Once it is actually good for certain use cases (e.g. hopefully CLIs soon, and then hopefully servers after that!) I think it's worth talking about how to present that with caveats (e.g. \"Roc is a viable choice for a personal project where you're okay with hitting compiler crashes. The compiled executable should run fast, and compile times should be low, but we still regularly find new bugs where the compiled executable segfaults, the compiler itself crashes, or compile times get super long because there's a pathological code path that hasn't been optimized yet.\")</p>",
        "id": 289529307,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1657751333
    },
    {
        "content": "<p>I think setting clear expectations around these things has served the project well so far (it turns out lots of people are interested in a language well before it's reached maturity!) and I'd like to continue doing that <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 289529499,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1657751485
    },
    {
        "content": "<p>Anti-marketing campaign! :)</p>",
        "id": 289579976,
        "sender_full_name": "Zeljko Nesic",
        "timestamp": 1657798361
    },
    {
        "content": "<p>I agree with all of the above, though I think that the term \"use case\" might be more specific than <span class=\"user-mention\" data-user-id=\"513294\">@Tobias Steckenborn</span> means. Use cases are supported by platforms and will change with time, as <span class=\"user-mention\" data-user-id=\"364014\">@Georges Boris</span> said, but I feel like Roc definitely already has something like use <strong>categories</strong> or use <strong>styles</strong> - reasons why a developer might want an app/platform distinction, purely functional code, or in-place mutation. Perhaps these are just \"language advantages/features\", but the README currently assumes familiarity with them or delegates their marketing to conference talks. What if there was a short section on such advantages, which are platform-agnostic and timeless?</p>",
        "id": 289580764,
        "sender_full_name": "jan kili",
        "timestamp": 1657798796
    },
    {
        "content": "<p>In addition to what others wrote, I think it's best if the Roc community grows slowly in order to give time for best practices and standards to emerge. I think it's really valuable for an ecosystem when there are single, well written, packages to address particular needs. For example, a single package for managing colors that all other packages build upon, rather than several color packages with inconsistent feature sets and have opaque types you need to convert between because PackageA uses ColorPackageA and PackageB uses ColorPackageB.</p>\n<p>Edit: Here's another example from the Elm community <a href=\"/user_uploads/22008/yyLnxs-DiuoXM4yAMARMgIzu/image.png\">image.png</a>. And to make it worse, I have a package for sending emails that uses its own implementation because none of these 3 suit my needs. This is the sort of situation want to want avoid in Roc <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/yyLnxs-DiuoXM4yAMARMgIzu/image.png\" title=\"image.png\"><img src=\"/user_uploads/22008/yyLnxs-DiuoXM4yAMARMgIzu/image.png\"></a></div>",
        "id": 289581112,
        "sender_full_name": "Martin Stewart",
        "timestamp": 1657798981
    },
    {
        "content": "<p>kinda drifting the topic but in response to you <span class=\"user-mention\" data-user-id=\"432314\">@Martin Stewart</span> - it would be awesome if Roc's package system contained more information than Elm's... having multiple published packages is a much smaller problem when you have more info available \"what is the most used? what is the one with most recent adoption?\" etc.</p>",
        "id": 289588041,
        "sender_full_name": "Georges Boris",
        "timestamp": 1657803418
    },
    {
        "content": "<p>this is probably worth a separate thread, but I think \"what is the most used?\" and \"what is the one with the most recent adoption?\" are problems that haven't been reliably solved in any language <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 289588341,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1657803598
    }
]