[
    {
        "content": "<p>It looks Roc supports directly exposing functions and types? This for example <code>import A exposing (functionA)</code> and writing <code>functionA</code> directly vs <code>import A</code> and then needing to qualify the function call with<code>A.functionA</code>.</p>\n<p>Assuming that is true, I want to make an argument for not supporting it. With Elm, elm-format spares us from having debates over code style. But when it comes to imports, some people want to directly expose everything from a particular module, other people want to only directly expose types, and often there's special cases for Test functions or Html. At work we lose time now and then debating this stuff but since Roc is going to have a purpose built editor, what if direct imports could be an editor configuration? Then everyone can have it their way without any conflict.</p>\n<p>The <code>.roc</code> files themselves would have no direct imports but when someone opens it in their editor, directly imported functions and types would be shown without any qualifiers. And when the user writes one of those functions and saves, the editor will add qualifiers to the <code>.roc</code> file.</p>",
        "id": 262190565,
        "sender_full_name": "Martin Stewart",
        "timestamp": 1637424205
    },
    {
        "content": "<p>I believe if you want to import <code>functionA</code> from <code>A</code>, the syntax is <code>imports [ A.functionA ]</code>.<br>\nFor tools it might be useful to have the default be direct imports so they do not need to parse the whole file to know what is used, only the header.<br>\nI do like the idea.</p>",
        "id": 262191840,
        "sender_full_name": "Anton",
        "timestamp": 1637425970
    },
    {
        "content": "<p>The editor idea is cool, but complex. Most likely people only want some direct imports and not all things to be direct imports.</p>",
        "id": 262192364,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1637426595
    },
    {
        "content": "<p>As for whether or not they should be supported. I would say an argument for not supporting them is that someone can do it manually if they really want it.</p>\n<p>Import A</p>\n<p>functionA = A.functionA</p>\n<p>Also, most style guides i have seen for various languages definitely promote A.* Syntax because it removes ambiguity in a large code base.</p>",
        "id": 262192545,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1637426830
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code> Most likely people only want some direct imports and not all things to be direct imports.\n</code></pre></div>\n<p>Uhu, I find myself doing the same.</p>",
        "id": 262192632,
        "sender_full_name": "Anton",
        "timestamp": 1637426933
    },
    {
        "content": "<p>I am open to either option, but I understand only supporting one syntax. The big advantage of both is that it let's the user pick their style here. I think that is fine, but as said above, it can lead to debates when the rules aren't set in stone.</p>",
        "id": 262192637,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1637426942
    }
]