[
    {
        "content": "<p>I was wondering if there's any way/library in Roc to write full stack code. I'm in search of a functional language to write isomorphic code for the frontend and backend (used to do this with Haskell, but GHCJS is a mess) and Roc looks like a great candidate.</p>\n<p>If there's no library there that could do this but it is doable with Roc, I'd like to try doing so myself :)</p>\n<p>I know that there are some Rust libraries that compile to WASM that allow you to write frontends in that way, was wondering if there was something done like this so I don't reinvent the wheel :)</p>",
        "id": 383090270,
        "sender_full_name": "Nikita Tchayka",
        "timestamp": 1691532605
    },
    {
        "content": "<p>Aaaand I just found <a href=\"https://github.com/roc-lang/roc/tree/main/examples\">https://github.com/roc-lang/roc/tree/main/examples</a> with all the stuff I need, thanks for getting into this thread and reading these messages :)</p>",
        "id": 383092013,
        "sender_full_name": "Nikita Tchayka",
        "timestamp": 1691533337
    },
    {
        "content": "<p>I'm maintaining a <a href=\"https://github.com/lukewilliamboswell/roc-things\">roc awesome</a> page which might be helpful. Also I think <span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> is working on a webserver at the moment for use at work. Keen to hear how you go with this, sounds like a fun project.</p>",
        "id": 383115148,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1691543533
    },
    {
        "content": "<p>Roc compiles to Wasm so it can be a full stack solution.<br>\nBut the virtual dom example doesn't compile so we put \"WIP\" in the directory name. When building it last year, we found some very difficult compiler bugs that aren't resolved yet.</p>",
        "id": 383154617,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1691560108
    },
    {
        "content": "<p>We got the type checking bugs fixed but there's still some problems in later stages of the compiler (probably monomorphization, possibly code generation). I think we still have open issues on GitHub, which we should probably update!</p>",
        "id": 383200050,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1691572108
    },
    {
        "content": "<p>I think as soon as the compiler issues are ironed out, then MVP could be express handlers calling roc wasm library + elm front end. Then gradually replace the non roc parts. I have no experience with roc, just eagerly awaiting</p>",
        "id": 384487652,
        "sender_full_name": "kanishka",
        "timestamp": 1691931192
    },
    {
        "content": "<p>That stack could be a cool project. But \"full stack Roc\" probably wouldn't be the right term for it because it uses Elm for the front end.<br>\nAnd in fact that means it does not require implementing a virtual dom in Roc, so it would not be blocked by the compiler issues I mentioned.</p>",
        "id": 384554610,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1691949627
    },
    {
        "content": "<p>I think my dream stack is roc + rest API + jsonschema + json-schema-to-elm + elm-land ( I know it's not full stack roc).</p>",
        "id": 391700528,
        "sender_full_name": "kanishka",
        "timestamp": 1695043878
    }
]