[
    {
        "content": "<p>Broadly speaking, after creating a GitHub issue that would benefit from community feedback, when should we cross-post/discuss that issue in Zulip? I just made <a href=\"https://github.com/roc-lang/roc/issues/4120\">https://github.com/roc-lang/roc/issues/4120</a>, and my first impulse was to come here to ask \"What do y'all think?\", but I feel bad downgrading the quality/thoroughness of public discussion in that issue as a result. Zulip history is much less searchable/accessible/available to the Roc community than GitHub issue history... but at the same time posting in Zulip generates much more discussion &amp; thought than simply tagging some people in an issue and hoping the community stumbles across it to give their two cents.</p>\n<p>Thoughts?</p>",
        "id": 301115767,
        "sender_full_name": "jan kili",
        "timestamp": 1664312068
    },
    {
        "content": "<p>One approach I've seen in the past is to create a proposal/summary/something in a GitHub issue, tag a core contributor like Richard, then cross-post in Zulip after it's clear that the answer isn't obvious (or would benefit from crowdsourced validation). However, if that was the intended workflow, it seems like that could be inefficient and might not scale.</p>",
        "id": 301116236,
        "sender_full_name": "jan kili",
        "timestamp": 1664312260
    },
    {
        "content": "<p>Regardless, when a conversation is routed to Zulip, it can be very opaque from a GitHub reader's perspective what discussion took place, or whether any happened at all. I don't see an easy fix for this, though we could try to somehow indicate that Zulip was involved in an issue/PR.</p>",
        "id": 301116482,
        "sender_full_name": "jan kili",
        "timestamp": 1664312365
    },
    {
        "content": "<p>I love both discussion forums, so I simply want to better preserve our communal insights (without adding an unnecessary overlay of <code>p r o c e s s</code>) <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 301116702,
        "sender_full_name": "jan kili",
        "timestamp": 1664312446
    },
    {
        "content": "<p>I think Zulips can be public. Maybe this is a way?</p>",
        "id": 301519015,
        "sender_full_name": "Brian Hicks",
        "timestamp": 1664480801
    },
    {
        "content": "<p>(Gren is, for example, at least in one stream.)</p>",
        "id": 301519037,
        "sender_full_name": "Brian Hicks",
        "timestamp": 1664480814
    }
]