[
    {
        "content": "<p>As I'm brand new to the Roc lang, I was wondering what kind of feedback would be absolutely amazing for you, a Roc developer?</p>",
        "id": 263351559,
        "sender_full_name": "Jason Hobbs",
        "timestamp": 1638389725
    },
    {
        "content": "<p>Currently it is really easy to hit panics. All panics should be remove and replaced with either internal errors (that should never get hit) or proper user facing errors. I think easy contributions/issues to file would be ones about tracking and updating error messages. That way when a user hits an error, they will know if it is a todo we already know about, a user error message that just needs pretty printing, or an actual compiler bug that should get filed. <a href=\"https://github.com/rtfeldman/roc/issues/2046\">Related tracking issue</a></p>",
        "id": 263352167,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1638390014
    },
    {
        "content": "<p>Otherwise, my general thought on feedback is that it should come with code and minimal examples if possible. That makes it much easier to quickly debug.</p>",
        "id": 263352218,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1638390048
    },
    {
        "content": "<p>Also, if you more mean related to language direction and development, the <a class=\"stream\" data-stream-id=\"304641\" href=\"/#narrow/stream/304641-ideas\">#ideas</a>  stream is the place to discuss.</p>",
        "id": 263352277,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1638390090
    },
    {
        "content": "<p>Thanks! I'll be sure to help document what I'm finding as I go... The project looks really exciting in general. I don't think I'll be contributing to #ideas for awhile, as I should really get more acquainted with the Roc mindset first.</p>",
        "id": 263354086,
        "sender_full_name": "Jason Hobbs",
        "timestamp": 1638391009
    },
    {
        "content": "<p>As an extra note, our docs are definitely still lacking in a number of places, so if you document as you learn, especially around what is harder to learn, that would be really useful information. Either direct contributions or just sharing what is missing/poorly explained so we can keep working on updates to the docs.</p>",
        "id": 263355121,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1638391543
    },
    {
        "content": "<p>I was planning on doing this as well... It kind of feels like a steep learning curve at the moment, and I'm imagining it's just the lack of docs.   Things are starting to click, but I have to play around some more before I really get how things are wired together.</p>",
        "id": 263355744,
        "sender_full_name": "Jason Hobbs",
        "timestamp": 1638391826
    },
    {
        "content": "<p>have you read through the tutorial? I'd love to get feedback on it!</p>",
        "id": 263360208,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1638394188
    },
    {
        "content": "<p>Actually, no - not yet.  I started to skim it earlier and didn't realize it would get into the connection between Platforms and Applications. So, I stopped and went looking to understand how to set up a Platform. I figured I'd return to it once I had that in place, then I'd learn about Strings, Numbers, Records, etc.</p>\n<p>I see now that I scrolled right past the \"Building an Application\" section and didn't realize it covered it! Going to start there when I return</p>",
        "id": 263362927,
        "sender_full_name": "Jason Hobbs",
        "timestamp": 1638395533
    },
    {
        "content": "<p>I'm considering doing the advent of code in Roc, i was wondering where can i find the available functions?<br>\nAnd is there an import everything from platform shorthand?</p>",
        "id": 313398359,
        "sender_full_name": "Ian Erik Varatalu",
        "timestamp": 1669936984
    },
    {
        "content": "<p>Does Stdin.line return an empty string if there is no more input?</p>",
        "id": 313398818,
        "sender_full_name": "Ian Erik Varatalu",
        "timestamp": 1669937211
    },
    {
        "content": "<p>I think it blocks until end of field?</p>",
        "id": 313398868,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1669937253
    },
    {
        "content": "<p>Are you looking for the <a href=\"https://www.roc-lang.org/packages/basic-cli/Stdout#line\">basic cli docs</a>?</p>",
        "id": 313399539,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1669937561
    },
    {
        "content": "<blockquote>\n<p>i was wondering where can i find the available functions?</p>\n</blockquote>\n<p>I think you're looking for the <a href=\"https://www.roc-lang.org/builtins/Str\">builtin docs</a>.</p>\n<blockquote>\n<p>And is there an import everything from platform shorthand?</p>\n</blockquote>\n<p>No, I believe this was done to make it easy to track from where a function was being imported.</p>",
        "id": 313471183,
        "sender_full_name": "Anton",
        "timestamp": 1669977855
    }
]