[
    {
        "content": "<p>Are there any plans to have the compiler only accept programs that it can guarantee terminate?</p>\n<p>For example, Dhall is intentionally not turing-complete and guarantees programs terminate. (they link to <a href=\"https://en.wikipedia.org/wiki/Total_functional_programming\">https://en.wikipedia.org/wiki/Total_functional_programming</a> to explain this.) Idris does this by default too, although you can turn it off.</p>\n<p>I'm thinking about this in context of build scripts (<a class=\"stream\" data-stream-id=\"289819\" href=\"/#narrow/stream/289819-rbt\">#rbt</a>.) There are a couple situations in build script land where it'd be really helpful to only accept terminating functions or scripts!</p>",
        "id": 253606802,
        "sender_full_name": "Brian Hicks",
        "timestamp": 1631808639
    },
    {
        "content": "<p>Shouldn't that be a feature of the platform that you are compiling Roc to? Or even better some Type-level wizardry?</p>\n<p>Eg, webservers and health monitors do not want to terminate.</p>",
        "id": 253615453,
        "sender_full_name": "Zeljko Nesic",
        "timestamp": 1631811942
    },
    {
        "content": "<p>it turns out you can prove totality for long-running processes, actually! Say you're writing a <code>map</code> function over a stream. If you can prove that it terminates with an empty stream, and a stream with one more than the last thing, you can prove it's total for an infinite stream.</p>",
        "id": 253633039,
        "sender_full_name": "Brian Hicks",
        "timestamp": 1631818861
    },
    {
        "content": "<p>I don't know that it'd be a platform feature; I think it'd have to be specified in the types of the language.</p>",
        "id": 253633102,
        "sender_full_name": "Brian Hicks",
        "timestamp": 1631818885
    },
    {
        "content": "<p>so I'm pretty interested in trying what Rust does and seeing if there's still a concern</p>",
        "id": 253683595,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1631848786
    },
    {
        "content": "<p>Rust isn't total, but the compiler detects and reports a few cases where you <em>definitely</em> have an infinite loop</p>",
        "id": 253683643,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1631848804
    },
    {
        "content": "<p>e.g. every branch inside a function results in recursion</p>",
        "id": 253683661,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1631848821
    },
    {
        "content": "<p>the reason I know it reports these is that I've accidentally made those mistakes on more than one occasion, and the compiler told me about it before I ran the program <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 253683671,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1631848843
    },
    {
        "content": "<p>my concern about having \"total mode\" is that there will be some functions that won't work with it, and sometimes they'll be in packages you've imported, and you won't necessarily know which ones they are (unless we advertise \"total-mode-compatible\" as part of the package metadata or something)</p>",
        "id": 253683713,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1631848905
    },
    {
        "content": "<p>so there are nontrivial ecosystem implications there, and I'd want to be careful about introducing something like that</p>",
        "id": 253684381,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1631849549
    },
    {
        "content": "<p>I believe the ergonomics implications are also potentially pretty serious for the Dhall approach as compared to the Idris approach;  as I understand it, Idris can tell at compile time when a termination condition is \"making progress\" towards terminating on each recursive call, but Dhall can't and so it just disallows unbounded recursion and makes (for example) recursive sum types impossible to use directly</p>",
        "id": 253684496,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1631849692
    },
    {
        "content": "<p>Makes sense, thanks! It’s true that Idris can make much more progress here. I wonder if it’s something in dependent types that enables it or if it’s just that Edwin Brady is a Very Clever Human (or at least a Human Who Applies Implements Important Type Theory Papers)</p>",
        "id": 253728383,
        "sender_full_name": "Brian Hicks",
        "timestamp": 1631878671
    },
    {
        "content": "<p>types help. Say you calculate the factorial <code>factorial n</code>: in idris, the <code>n</code> is a natural number (at compile time anyway, at runtime it's just an <code>i64</code>) and so you can do inductive reasoning. You could do this in roc too of course, but without compiler support it's verbose and slow.</p>",
        "id": 253755860,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1631890846
    },
    {
        "content": "<p>hah, right? I wouldn't want to have to actually use peano numbers at runtime <span aria-label=\"dizzy\" class=\"emoji emoji-1f635\" role=\"img\" title=\"dizzy\">:dizzy:</span></p>",
        "id": 253758990,
        "sender_full_name": "Brian Hicks",
        "timestamp": 1631892117
    }
]