[
    {
        "content": "<p>Hi,</p>\n<p>I may well have some basic misunderstandings about roc's abilities and design philosophy, but let me elaborate.</p>\n<p>I've been thinking how one would build colorful pretty-printing like the <code>rich</code> library in python provides, which has become the de-facto standard for nice human readable output. It features reasonable defaults but its behavior can also be extended for user-defined types.</p>\n<p>As far as I undrestand, <code>pprint</code> renders some piece of data like this:</p>\n<ul>\n<li>If it  has a <code>__rich_repr__()</code> method, use its value to build up the repr</li>\n<li>otherwise, fall back to a reasonable default defined for e.g. lists, dictionaries or dataclasses (which would be records in roc)</li>\n</ul>\n<p>roc does not have python's dynamic introspection, so I figured I had to choose between this:</p>\n<ol>\n<li>build a giant function which switches based on the argument type, and continue to add special cases. but since there is neither ad-hoc polymorphism nor an „any“ type, this can't be done.</li>\n<li>try to associate a function <code>rich_repr</code> to existing types. Since, in contrast to e.g. rust, we cannot associate functions to a type outside the original type definition, we'd need a wrapper type, say <code>Rich</code>, providing <code>rich_repr()</code>. But then we essentially just moved the problem: how do we define a <code>to_rich</code> function which, depending on the type, returns a different instance of <code>Rich</code>containing the information about how to format?</li>\n</ol>\n<p>Is roc missing some kind of overloading (rust's „trait X can be implemented from various sources“ compile-time-lookup of what a method may mean would also count as overloading in a broad sense), or am I just lacking a smart idea?</p>\n<p><em>(edit: I'm talking about the new compiler, and specifically not about “abilities”)</em></p>",
        "id": 569955294,
        "sender_full_name": "Lukas Juhrich",
        "timestamp": 1769348504
    },
    {
        "content": "<p>I think you could implement this kind of pretty-printing in terms of 'encode', at least in the fully built-out version of encode that's planned. If you did it this way, 'RichRepr' would be an encoding format (kind of fitting into the same slot as 'json' or 'cbor').<br>\nBrendan also said that a pattern like this was how <code>dbg</code> statements and the associated Inspect module was implemented in the old rust compiler.<br>\n<a class=\"stream-topic\" data-stream-id=\"304641\" href=\"/#narrow/channel/304641-ideas/topic/Encode.2FDecode.20and.20reflection.20use-cases/with/567410751\">#ideas &gt; Encode/Decode and reflection use-cases</a></p>",
        "id": 569956827,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769350013
    },
    {
        "content": "<p>I haven't come around to a full understanding of encode yet, so I will take this opportunity to think about it more deeply. Thank you for the pointer!</p>",
        "id": 569956976,
        "sender_full_name": "Lukas Juhrich",
        "timestamp": 1769350168
    }
]