[
    {
        "content": "<p>I am new to Roc, have looked at some closed issues implementing built-in functions, and would like to learn more about how they are implemented from a general point of view.</p>\n<p>My first impression is that built-in functions are implemented in Rust by defining Rust representations of Roc expressions - mimicking what the Roc parser would create. </p>\n<p>Is that impression accurate? </p>\n<p>Are all standard-library functions implemented like this?</p>\n<p>Would it be possible to implement built-in / standard-library functions in Roc if (like for Result.isOk) no external functionality is required for the implementation?</p>\n<p>I can imagine these questions have already been discussed but did not find anything relevant. Are there relevant discussions in issues you can point me to?</p>",
        "id": 262234703,
        "sender_full_name": "Sebastian Fischer",
        "timestamp": 1637492378
    },
    {
        "content": "<p>Welcome Sebastian! I've been involved in the project for a few months and I can answer some of this but not all!</p>\n<p>Yes as far as I can tell, all of Roc's standard library functions are builtins rather than being written in Roc. I hadn't realised that it was literally all of them until you mentioned it!</p>\n<p>Most languages have at least some functions built in to the compiler for efficiency. Sometimes that lets you do things in a more optimised way than you could in the source language. Most of Roc's builtins are implemented using the compiler's internal data structures, as you mentioned. A few of them are implemented in <a href=\"https://ziglang.org/\">Zig</a>. The Zig functions are <a href=\"https://github.com/rtfeldman/roc/tree/trunk/compiler/builtins/bitcode/src\">here</a>.</p>\n<p>As I mentioned, I'm not sure why we have 100% of them as builtins. Intuitively it seems like Roc would work just as well in many cases. Maybe the feeling was that if we need some of them as builtins, might as well just do all of them that way. Someone else will have to fill in the history there.</p>",
        "id": 262237998,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1637497236
    },
    {
        "content": "<p>it's to prevent an elm native/kernel code scenario: if you can change or add roc builtins too easily, you can break the guarantees of the language (purity, mostly) and that would be a worse experience</p>",
        "id": 262238948,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1637498560
    },
    {
        "content": "<p>also it's a minor efficiency gain: fewer files to load or cache</p>",
        "id": 262238949,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1637498581
    },
    {
        "content": "<p>Thanks Brian and Folkert!</p>\n<p>I now understand, the standard library is not implemented in Roc intentionally, although I'm not sure I fully understand the reasoning. On a high level, I can see that it would be easy to break purity if it was easy to add built-in functions using Rust. I do not yet see how implementing pure library functions in Roc could break purity.</p>\n<p>When I started with Haskell twenty years ago, I learned a lot of the basics from reading the Haskell 98 Prelude. Considering programs not only for computers to run but also for people to communicate ideas, I think a standard library (mostly) implemented in Roc could be a default example for new Rocsters where they could learn about the API of the standard library and how to write idiomatic Roc code.</p>\n<p>I'd like to understand better why Roc seems to follow a different path, implementing even pure functions that could be efficiently implemented in Roc using Rust instead. I'm curious to learn more, if anyone can elaborate or link to previous discussions regarding this decision.</p>",
        "id": 262240013,
        "sender_full_name": "Sebastian Fischer",
        "timestamp": 1637500135
    },
    {
        "content": "<p>Couple of things</p>\n<ul>\n<li>the roc stdlib will remain relatively small. haskell has a lot of other stuff in there that  we want to put into packages (which are of course all roc code)</li>\n<li>our core data structures are more complex: haskell's <code>List</code> module is full of common haskell patterns. But our list is an Array (chunk of memory) and so we can't write those nice recursive functions for lists</li>\n</ul>",
        "id": 262240343,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1637500632
    },
    {
        "content": "<p>we also annotate a lot of the stdlib functions with extra information that optimization steps use later. Those annotations shouldn't be in userspace because Roc couldn't claim to be memory safe anymore if they were <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 262240410,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1637500780
    },
    {
        "content": "<p>there are a nonzero number of convenience functions in the stdlib there could be implemented in a plain .roc file purely in terms of other functions that couldn't be implemented that way, but:</p>\n<ul>\n<li>it would be a sizeable project to get the compiler infrastructure set up to seamlessly stitch together the .roc functions and the must-be-baked-in ones into the same module(s)</li>\n<li>it would make builds of the compiler take longer and be more complex, because we'd have to prebuild .roc files in order to run the compiler. (The alternative would be to slow down roc application builds, which I definitely don't think we should do for this!)</li>\n</ul>",
        "id": 262240645,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1637501104
    },
    {
        "content": "<p>so overall the downsides seem to outweigh the upsides.</p>",
        "id": 262240700,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1637501170
    },
    {
        "content": "<p>I see. Thanks for elaborating!</p>",
        "id": 262240730,
        "sender_full_name": "Sebastian Fischer",
        "timestamp": 1637501235
    },
    {
        "content": "<p>great question! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 262241041,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1637501645
    }
]