[
    {
        "content": "<p>I'm new to building compilers, but I've learned that I love working on the concept and code from an interpreted math engine I'm building in Zig. I'd like to learn how this codebase works so that I can actively use it to learn and actively contribute to it.<br>\nI've found the document on Project ideas, but It'd also be cool if someone could point me to a list of the use cases so I have an more end to end idea of the direction of the language. I've listen to a lot of content from <span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span>, so I have a pretty good idea of what its used for and the benefits which is why I'm interested, but they're not super concrete.</p>",
        "id": 422036757,
        "sender_full_name": "Christian Queyrouze",
        "timestamp": 1708197972
    },
    {
        "content": "<p>welcome!</p>",
        "id": 422037556,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708198791
    },
    {
        "content": "<p>I'm not sure exactly what you're looking for in terms of \"list of use cases\" but maybe this interview might help? <a href=\"https://www.youtube.com/watch?v=ssw0_udPla0&amp;pp=ygUTcmljaGFyZCBmZWxkbWFuIHJvYw%3D%3D\">https://www.youtube.com/watch?v=ssw0_udPla0&amp;pp=ygUTcmljaGFyZCBmZWxkbWFuIHJvYw%3D%3D</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ssw0_udPla0\" href=\"https://www.youtube.com/watch?v=ssw0_udPla0&amp;pp=ygUTcmljaGFyZCBmZWxkbWFuIHJvYw%3D%3D\"><img src=\"https://uploads.zulipusercontent.net/7f8645f06616d5dbeead6ec07aa1bbcee97b15e3/68747470733a2f2f692e7974696d672e636f6d2f76692f737377305f7564506c61302f64656661756c742e6a7067\"></a></div>",
        "id": 422037620,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708198830
    },
    {
        "content": "<p>in general, the idea is for Roc to be useful in the \"long tail of use cases\" by giving platform authors a way to write tailored platforms for those use cases</p>",
        "id": 422037643,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708198861
    },
    {
        "content": "<p>some non-goals include:</p>\n<ul>\n<li>compiling to VMs or to other high-level languages (e.g. BEAM, JS, C)</li>\n<li>competing on performance with non-garbage-collected languages like C, C++, Rust</li>\n<li>self-hosting the compiler, ever</li>\n</ul>",
        "id": 422037743,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708198997
    },
    {
        "content": "<p>a non-exhaustive list of use cases we're aiming for:</p>\n<ul>\n<li>command-line interfaces</li>\n<li>servers</li>\n<li>native GUI applications (desktop and mobile apps)</li>\n<li>games in some form (e.g. in places where something like Lua would sound appealing)</li>\n<li>editor plugins and database extensions</li>\n<li>hardware with limited resources, e.g. raspberry pi, possibly arduino (but realistically not the type of embedded systems where you need to hardcode all your array lengths and reference counting wouldn't be an option)</li>\n</ul>",
        "id": 422037960,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708199260
    },
    {
        "content": "<p>browser GUIs might work too, although it wasn't an original motivating use case (because Elm is so good at that already) and we don't have a working proof of concept at this point</p>",
        "id": 422038039,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1708199332
    },
    {
        "content": "<p>Thank you! and I'll check out the video when I'm not in public.<br>\nI think that list gives me a pretty good idea of what the language is for. I want some toy projects I can build a run to understand how the code works and should be working.<br>\nI'm a pretty big fan of the idea of hot swapping functions and not deallocating data until the end of a program including other language concepts that you've talked about on you're podcast. I'm a big believer that this language can run at or close to the speed of Zig, C, and other low level languages for the right use cases, and I think it can beat Rust for what it's good at because of the cost of abstracting memory management. I've also been looking for a functional language to replace Elixir in the web world.<br>\nQuick question, what's the benefit of self hosting the compiler? I've used a lot of high level languages that do that, and it always seems to be more of detriment than a benefit (obviously take what I say with a grain of salt. I'm not super knowledgeable on the topic).</p>",
        "id": 422039106,
        "sender_full_name": "Christian Queyrouze",
        "timestamp": 1708200354
    },
    {
        "content": "<p>I'm also happy you said it's good for games, because I was thinking about how useful it'd be for a game idea I had today.</p>",
        "id": 422039197,
        "sender_full_name": "Christian Queyrouze",
        "timestamp": 1708200420
    },
    {
        "content": "<blockquote>\n<p>Quick question, what's the benefit of self hosting the compiler?</p>\n</blockquote>\n<p>For a lot project it means the dev team actually gets to program in the language they built and love. So it is a huge boon in that sense. Otherwise, it is mostly done to test the compiler more. In many cases the compiler itself is one of the first large projects in a language.</p>",
        "id": 422039931,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1708201191
    },
    {
        "content": "<p>Also, in some cases, it is done cause the compiler is more mature and could really use a rewrite in general.</p>",
        "id": 422039998,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1708201239
    },
    {
        "content": "<blockquote>\n<p>Quick question, what's the benefit of self hosting the compiler?</p>\n</blockquote>\n<p>Bonus tip when you have decided you want to self host: You could create the first version of the compiler in a language which is really fast to iterate in for that purpuse, like OCaml (I've heard), and switch to the new version asap. <br>\nIf you want to write a fast compiler, you do it in a systems language like C. But you would not want to write C for too long if your new language is also a systems language.</p>",
        "id": 422122321,
        "sender_full_name": "Norbert Hajagos",
        "timestamp": 1708284398
    }
]