[
    {
        "content": "<p>In my use it would be very useful feature to have that<br>\nMost likely it would be possible to create arm64 linux and compile \"natively\" using qemu, but it sounds like something  cumbersome</p>",
        "id": 312589421,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1669629135
    },
    {
        "content": "<p>for macos?</p>",
        "id": 312590102,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1669629394
    },
    {
        "content": "<p>linux x86  -&gt;  arm64</p>",
        "id": 312590221,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1669629454
    },
    {
        "content": "<p>well it is technically possible, but would require some linker additions I think</p>",
        "id": 312591390,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1669629853
    },
    {
        "content": "<p>we should get there eventually</p>",
        "id": 312591406,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1669629859
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"343810\">@Brendan Hansknecht</span> we use iced to fix up the indirect calls, but that is not essential. Are there other x86_64 specific parts to the elf surgical linker?</p>",
        "id": 312591617,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1669629935
    },
    {
        "content": "<p>yeah I expected that cross compilation is a little far fetch at this point of development. Anyway I want to share my view on planned use case to give you a little bit of insight into my thought process. I am working  with  embedded linux right now. Sometimes  (and  those  are  rare  cases like 3-4/per year) there is some more complicated issue to be fixed. In order to gather some additional information about the problem I introduce  some  very  small c++ application  to  have better  insight, c++ works  but  there is downside to  this. In many cases application  itself  needs to keep track of  some relevant  linux statistics to  act on those. Ideally  I would  make  pair c++ app  &lt;--&gt;  some  parsing app/s  and  provide  c++ with already  parsed  result. Normally I would use  python  for  this  parsing part (I don't necessarily like python but  I can do job  fast and with not to much effort ). In this case I can't because linux does not have python, because  of resources constraints(for  this reason  all script  languages are eliminated). I know that FP is good  for parsing so I looked for some alternatives and for  example haskell  is just to expensive, after  like 2 weeks of trying I was  able to create  something  but it is just  to difficult  to create something  fast, and I want  to spend like 2-3 hours  for  specific  task  max  with not so huge  intellectual effort. This is just not  possible  with  languages like  haskell. I went  through examples of  roc  applications you  provided  and I see that this level  of complexity suits me( although  I haven't  go  beyond some  tutorial examples myself). I see that  it may leverage my work process  quite a bit. Doing everything  in C++ always  works but experience  is  mediocre  at times, especially when I am facing  some  kind of  parsing. I just waste  to much time  and energy for  that. The energy  I want to  invest into actual  problem I am solving.. Its  the reason  why I want  cross compilation  instead of having setup  ubuntu  on  qemu it's just   yet another hurdle on my way.</p>",
        "id": 312605092,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1669634454
    },
    {
        "content": "<p>a fun alternative here might be to run webassembly. roc has good wasm support and a minimal wasm interpreter is in the works</p>",
        "id": 312605553,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1669634634
    },
    {
        "content": "<p>seems like it will not work in our target device  though</p>",
        "id": 312608083,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1669635553
    },
    {
        "content": "<p>constraints are quite limiting</p>",
        "id": 312608161,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1669635585
    },
    {
        "content": "<blockquote>\n<p>we use iced to fix up the indirect calls, but that is not essential. Are there other x86_64 specific parts to the elf surgical linker?</p>\n</blockquote>\n<p>No, i don't think so.</p>",
        "id": 312661715,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1669651489
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"568088\">@Artur Swiderski</span>, what do you mean when you say embedded? Is it low level embedded where you don't have a Linux os and have to compile for the specific device in a special way, or is it Linux based embedded like a raspberry pi would be?</p>",
        "id": 312662160,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1669651603
    },
    {
        "content": "<p>fwiw at work we do plan to use wasm on bare-metal devices</p>",
        "id": 312662364,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1669651663
    },
    {
        "content": "<p>safer than sending arm32 bytes over the air and having devices execute them</p>",
        "id": 312662497,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1669651685
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/is.20.20cross.20compilation.20possible.20.20x86.20-.3E.20arm64/near/312662160\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"568088\">Artur Swiderski</span>, what do you mean when you say embedded? Is it low level embedded where you don't have a Linux os and have to compile for the specific device in a special way, or is it Linux based embedded like a raspberry pi would be?</p>\n</blockquote>\n<p>small device but with linux(heavily customized and limited)</p>",
        "id": 312822724,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1669722006
    },
    {
        "content": "<p>but I believe I can always just create arm64 VM machine and  setup rust and  roc environment there?</p>",
        "id": 312823166,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1669722188
    },
    {
        "content": "<p>We do not run CI tests on arm64 linux, so that may require some small fixes here and there. it's probably not that difficult to get working because we do test on macos arm64.</p>",
        "id": 312824301,
        "sender_full_name": "Anton",
        "timestamp": 1669722567
    },
    {
        "content": "<p>btw  do roc applications have some hidden dependency line shared librares for a c++ application, or it will just run and is fully portable?</p>",
        "id": 312828479,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1669724027
    },
    {
        "content": "<p>These are the dynamically loaded libraries for a roc app with a C platform and for another app using a rust platform:</p>\n<div class=\"codehilite\"><pre><span></span><code>ldd rocWithCPlatform\n    linux-vdso.so.1\n    libm.so.6\n    libpthread.so.0\n    libdl.so.2\n    librt.so.1\n    libutil.so.1\n    libc.so.6\n    /lib64/ld-linux-x86-64.so.2\n\nldd rocWithRustPlatform\n    linux-vdso.so.1\n    libgcc_s.so.1\n    librt.so.1\n    libpthread.so.0\n    libm.so.6\n    libdl.so.2\n    libc.so.6\n    /lib64/ld-linux-x86-64.so.2\n</code></pre></div>",
        "id": 312835130,
        "sender_full_name": "Anton",
        "timestamp": 1669726297
    },
    {
        "content": "<p>in theory, at a language level Roc is designed to have no C library dependencies - not even libc - so you should be able to make a platform that does not use libc, and everything should be ok</p>",
        "id": 312882747,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1669739669
    },
    {
        "content": "<p>however, in practice LLVM automatically emits things that assume libc is present (e.g. recognizing certain patterns and turning them into <code>memcpy</code> calls) and we don't currently have workarounds for those</p>",
        "id": 312882904,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1669739723
    },
    {
        "content": "<p>so it's an explicit goal to have Roc applications be able to run on platforms that link zero libraries, including libc, but I don't think in practice it's safe to assume that's possible today (and I don't know if it's ever been tested with the LLVM backend!)</p>",
        "id": 312883175,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1669739798
    },
    {
        "content": "<blockquote>\n<p>but I believe I can always just create arm64 VM machine and setup rust and roc environment there?</p>\n</blockquote>\n<p>Yeah, that should definitely work.</p>\n<p>To actually cross compile today, you would have to:</p>\n<ol>\n<li>use <code>roc build --lib</code> or <code>roc build --no-link</code> to generate a shared library or object file. You can use <code>ar rcs</code> to convert the object file to a static library. Just use <code>--target</code> to target arm64.</li>\n<li>Modify the platform to cross compile. In doing so, make it depend on the shared or static library from Roc.</li>\n<li>Send over the binary/shared library</li>\n</ol>",
        "id": 312888757,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1669741300
    },
    {
        "content": "<p>In the future, once an arm64 surgical linker exists, it should be possible to just modify the platform to support an arm64 toolchain. The surgical linker and roc should be able to deal with everything else without any special config.</p>",
        "id": 312889153,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1669741414
    },
    {
        "content": "<blockquote>\n<p>(e.g. recognizing certain patterns and turning them into memcpy calls) and we don't currently have workarounds for those</p>\n</blockquote>\n<p>Surgical linker is a workaround for platforms that support it</p>",
        "id": 312889191,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1669741425
    },
    {
        "content": "<p>Note on <code>--target</code>, it might need to be expanded to actually support specific arm hardware, but probably works currently with generic arm64 that can run linux.</p>",
        "id": 312889536,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1669741515
    },
    {
        "content": "<p>I have started to setup qemu based ubuntu, I think I have to little knowledge to hack through compilation and dependency  building on my own, to cross compile.</p>",
        "id": 312891052,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1669741917
    },
    {
        "content": "<p>Would it be useful to borrow zig's approach to cross-compilation, where they bundle minimal compressed versions of libc headers / binary stubs for a bunch of platforms?</p>",
        "id": 312927653,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1669752316
    },
    {
        "content": "<p>Probably not. Roc doesn't need to use libc and is totally dependent on the platform to decided what cross compilation is supported.</p>",
        "id": 312954259,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1669762601
    }
]