[
    {
        "content": "<p>Is anyone here using Neovim? I've got tree-sitter-based syntax highlighting working and I believe I have the LSP stuff wired up mostly correct.</p>\n<p>However, when I make a syntax error while writing a file,  I can see in Neovim there is an error because it says 'E:1' in the status line but the error isn't actually printed out in the editor. If I open the file from the command line, then the error is printed out.</p>\n<p>I realise troubleshooting someone else's Neovim is like pulling teeth but does anyone here use Neovim and can point me at their configuration so I can see how they're doing it?</p>",
        "id": 447023605,
        "sender_full_name": "pyrmont",
        "timestamp": 1719359695
    },
    {
        "content": "<p>I don't experience this problem. Isn't it the case that the error message is at the very top of the file? <br>\nYou can look at <a href=\"https://github.com/HajagosNorbert/dotfiles/tree/main/.config/nvim\">my nvim config</a>. Nothing exotic there. I have <code>roc_language_server</code> as an executable in path, compiled from source. I have the treesitter module installed for Roc, but that was done the easy way (not through compiling the treesitter grammar, I think it is in some kind of central repository I could just install from nvim).<br>\nAlso, my language server is not very up to date. I last recompiled when module params got introduced.</p>",
        "id": 447153737,
        "sender_full_name": "Norbert Hajagos",
        "timestamp": 1719390042
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"577599\">@Norbert Hajagos</span> Thanks for the reply (and the link to your config)! I think part of the issue might have been expectations. I intentionally wrote <code>imort</code> rather than <code>import</code> in a test file and expected the error to be visible on the line with <code>imort</code>. I do see it on the top line (and see that that's how it works in Zed, too).</p>",
        "id": 447187745,
        "sender_full_name": "pyrmont",
        "timestamp": 1719400142
    },
    {
        "content": "<p>With pleasure! Yes, where the error is displayed depends on the language server's response, which is kinda shaped like </p>\n<div class=\"codehilite\"><pre><span></span><code>{\nmessage: &quot;unexpected token &#39;imort&#39;, maybe you intended &#39;import&#39;?&quot;,\nrange: {\n start: {\n  line: 0, column: 0\n } ,\n end: {\n  line: 0: column: 5\n  }\n }\n}\n</code></pre></div>\n<p>So it is not nvim's job to decide if that is in the right place. Also, the lang server right now can only do analysis on source code without errors, which might be why it defaults to the beginning of the file .</p>",
        "id": 447207616,
        "sender_full_name": "Norbert Hajagos",
        "timestamp": 1719405511
    }
]