[
    {
        "content": "<p>Since Roc uses automatic reference counting instead of garbage collection, how does it deal with memory fragmentation? As I understand it, that's something garbage collection does but ARC doesn't.</p>",
        "id": 260561446,
        "sender_full_name": "Martin Stewart",
        "timestamp": 1636273250
    },
    {
        "content": "<p>tracing GC, especially generational, can directly do things about memory fragmentation, whereas memory fragmentation isn't really in scope for reference counting - that all depends on the allocation strategy, which can be adjusted independently of whatever is going on with reference counting</p>",
        "id": 260561535,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636273431
    },
    {
        "content": "<p>here's an example of an allocator that deals with memory fragmentation: <a href=\"https://youtu.be/c1UBJbfR-H0\">https://youtu.be/c1UBJbfR-H0</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"c1UBJbfR-H0\" href=\"https://youtu.be/c1UBJbfR-H0\"><img src=\"https://uploads.zulipusercontent.net/0532f2b8d4c988efc1a70facbb3c00197f178016/68747470733a2f2f692e7974696d672e636f6d2f76692f633155424a6266522d48302f64656661756c742e6a7067\"></a></div>",
        "id": 260561586,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636273487
    },
    {
        "content": "<p>since roc puts platforms in charge of all allocations, if a platform author was concerned about memory fragmentation, they could use an allocation strategy like this - with or without reference counting! <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 260561649,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636273576
    },
    {
        "content": "<p>so I guess all of that is to say \"at the language level Roc doesn't do anything about it, but it does give platform authors the ability to do something about it if that's something it makes sense to optimize that platform for\"</p>",
        "id": 260561676,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636273653
    },
    {
        "content": "<p>(defragmenting memory has costs, and for many platforms - such as noninteractive batch scripts - that cost may not be worth it!)</p>",
        "id": 260561728,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636273731
    },
    {
        "content": "<p>Thanks for the link. I vaguely remember seeing that but it was a while ago. I'll have to rewatch it.</p>\n<p>Will each platform author need to implement their own defragmenter (for those who need it) or will there a default implementation people can use? Maybe I'm misremembering the video but I think it did something sneaky with OS pages to defragment memory and that seems like something that might not work on simpler hardware?</p>",
        "id": 260561957,
        "sender_full_name": "Martin Stewart",
        "timestamp": 1636274119
    },
    {
        "content": "<p>I guess the platform could do its own \"stop the world\" defragmentation as well. I'm not that familiar with what kind of information the platform has access too but if it knows what Roc data is pointers then it could change them and make the memory compact again.</p>",
        "id": 260562587,
        "sender_full_name": "Martin Stewart",
        "timestamp": 1636275051
    },
    {
        "content": "<p>in general, allocation is entirely up to the platform author to implement; the language doesn't get involved at all</p>",
        "id": 260562679,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636275226
    },
    {
        "content": "<p>that said, code sharing among systems languages is still a thing! It's not like everyone would have to write it themselves; more likely they'd get that allocator from a library someone else wrote, unless they wanted to customize it <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 260569051,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636285095
    },
    {
        "content": "<p>I realized some of my confusion was thinking that an allocator couldn't fix fragmentation since it doesn't move around existing memory. But of course, it can prevent fragmentation by allocating memory in a smart way.</p>",
        "id": 260576164,
        "sender_full_name": "Martin Stewart",
        "timestamp": 1636294322
    },
    {
        "content": "<p>yes, one example of that is <a href=\"https://github.com/microsoft/mimalloc\">https://github.com/microsoft/mimalloc</a></p>",
        "id": 260576217,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1636294408
    },
    {
        "content": "<p>it does list sharding, where it has many lists of allocations of various sizes, and when you allocate something new, it doesn't \"randomly\" pick a location on the heap, but puts it into one of those lists</p>",
        "id": 260576289,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1636294467
    }
]