[
    {
        "content": "<p>I thought explicit subcommand <code>run</code> was still supported, just the default if not specified.  was it removed entirely?</p>",
        "id": 571073383,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769790555
    },
    {
        "content": "<p>yeah, that's intentional! I want to reserve <code>run</code> for potential future use, and also to have it so that <code>roc foo.roc</code> runs it just like how e.g. <code>python foo.py</code> does</p>",
        "id": 571088752,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1769794802
    },
    {
        "content": "<p>not sure python is a good comparison here. the <code>python</code> executable ONLY runs scripts, it does  not have subcommands. In python land you have a thousand different tools for each purpose (python, pip, venv, pylint, etc.). It is changing now with <code>uv</code>/<code>pixi</code> but still.</p>\n<p><code>roc run foo.roc</code> seems the cleanest to me. But <code>roc foo.roc</code> can error with \"Did you mean to <code>roc run foo.roc</code> ?\"</p>\n<p>If no subcommand matched, check if first arg looks like a path to a roc file.</p>\n<p>It is really an mistake you may make the first few times anyway</p>",
        "id": 571116672,
        "sender_full_name": "Romain Lepert",
        "timestamp": 1769804281
    },
    {
        "content": "<p>somewhat inversely, I think there should be a \"mandatory\" subcommand, but it can default to the <code>run</code> subcommand, whatever shall it be named henceforth</p>",
        "id": 571119352,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769805393
    },
    {
        "content": "<p>One of the nice things about <code>roc &lt;path&gt;</code> running the file is that it makes for a really nice scripting excperience. You can put a <code>#!/usr/bin/env roc</code> shebang at the top of a file and then simply run the file itself like you would a python or bash script.</p>",
        "id": 571193568,
        "sender_full_name": "Jasper Woudenberg",
        "timestamp": 1769863396
    },
    {
        "content": "<p>What prevent it from being ´#!/usr/bin/env roc run’ ?</p>",
        "id": 571269206,
        "sender_full_name": "Romain Lepert",
        "timestamp": 1769935619
    },
    {
        "content": "<p>I don't know.. but I wonder if that messes with adding cli args or something like that</p>",
        "id": 571269288,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769935678
    },
    {
        "content": "<p>some platforms accept multiple arguments, some platforms accept a single argument, some platforms treat multiple arguments as a single one. In the third case (linux is here) you can split the args \"manually\" with <code>#!/bin/env -S roc run --moreflags</code></p>\n<p>as an alternative to <code>roc file.roc</code> you can install a separate program named \"rocrun\" which  is just symlinked to the main roc binary, then in the program, check for the executable name <code>argv[0]</code> in C, and decide whether to treat the argument as a file or subcommand. that's what busybox does with ls, cat, etc.</p>",
        "id": 571283303,
        "sender_full_name": "Pei Yang Ching",
        "timestamp": 1769949257
    },
    {
        "content": "<p>or just having <code>roc exec</code> be the default subcommand if none provided (<code>exec</code> because <code>run</code> is being reserved for another purpose)</p>",
        "id": 571292496,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769957570
    },
    {
        "content": "<p>yeah, initially it was <code>roc run</code> and then ran into the complexity around <code>/bin/env</code> not always accepting that</p>",
        "id": 571294604,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1769959364
    },
    {
        "content": "<p>we certainly could have <code>roc</code> default to <code>roc run</code>, but I think it's hard to make the case that if we already need the more concise way (<code>roc foo.roc</code>) for <code>/bin/env</code>, we should go out of our way to add a second, redundant way to do it that's more verbose (<code>roc run foo.roc</code>), so that now everyone needs to learn both, decide which to use, and then probably always use one and never use the other</p>",
        "id": 571294705,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1769959452
    },
    {
        "content": "<p>I agree that it's not a necessary feature, and potentially confusing;  however, it provides a clear mental model: <code>roc &lt;subcommand&gt;</code> (test, check, build, etc)    and <code>run</code> or <code>exec</code> operates the same way.  But we support run/exec as the default without being specified for <code>#!/bin/env roc</code></p>",
        "id": 571294791,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769959547
    },
    {
        "content": "<p>I'd like to continue not having it and see how it goes</p>",
        "id": 571295022,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1769959718
    }
]