[
    {
        "content": "<p>Is it time to inform curious new users about the new compiler split?  e.g. somewhere prominent on <a href=\"http://roc-lang.org\">roc-lang.org</a>? If I were onboarding a new dev, I might tell them something like: Roc-alpha-4 is stable and relatively frozen but also somewhat deprecated.  All of the docs are oriented to the old Roc system.  The new Roc system is much different, call it Roc-nightly.  Different syntax, different features, different builtins (stdlib).  Currently, this has the normal expectations of \"bleeding edge development\" with underspecified docs that are scattered throughout the ecosystem.  Here is a rough guide: ...</p>",
        "id": 568459329,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768576943
    },
    {
        "content": "<p>Yeah, that sounds good to me. I will wait a bit for others to weigh in before adding it.</p>",
        "id": 568459640,
        "sender_full_name": "Anton",
        "timestamp": 1768577014
    },
    {
        "content": "<p>Shall I create an issue and go from there?</p>",
        "id": 568460743,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768577301
    },
    {
        "content": "<p>There seems to be a lot of new users joining confused by the compiler split. I feel like there's this awkward tension between not broadcasting the new compiler too loudly since it's still very nascent, and broadcasting the new compiler because it's the preferred way to do things going forward and all the old stuff is essentially deprecated. Not just the language runtime but fundamental things like syntax etc</p>",
        "id": 568462031,
        "sender_full_name": "nandi",
        "timestamp": 1768577617
    },
    {
        "content": "<blockquote>\n<p>Shall I create an issue and go from there?</p>\n</blockquote>\n<p>Yes, thanks :) Feel free to keep it a bit vague so that we can discuss specifics here and avoid duplication.</p>",
        "id": 568462035,
        "sender_full_name": "Anton",
        "timestamp": 1768577619
    },
    {
        "content": "<p><a href=\"https://github.com/roc-lang/roc/issues/9040\">https://github.com/roc-lang/roc/issues/9040</a></p>",
        "id": 568462255,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768577679
    },
    {
        "content": "<blockquote>\n<p>awkward tension between not broadcasting the new compiler too loudly since it's still very nascent</p>\n</blockquote>\n<p>We can make the current state clear on the website</p>",
        "id": 568462435,
        "sender_full_name": "Anton",
        "timestamp": 1768577723
    },
    {
        "content": "<blockquote>\n<p>Is it time to inform curious new users about the new compiler split?</p>\n</blockquote>\n<p>I am not sure if we are there yet. But I know for certain this is something Richard has put a lot of thought into. In the last meetup he talked about an idea for an awesome blog post and video he had in mind. <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 568535807,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1768603324
    },
    {
        "content": "<p>There was this gist <a href=\"https://gist.github.com/rtfeldman/77fb430ee57b42f5f2ca973a3992532f\">https://gist.github.com/rtfeldman/77fb430ee57b42f5f2ca973a3992532f</a> which was intended for contributors in zulip and kind of got shared around the internet <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 568535895,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1768603384
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"361169\">Anton</span> <a href=\"#narrow/channel/231634-beginners/topic/New.20Compiler.3A.20learning.20and.20reference/near/568462035\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Shall I create an issue and go from there?</p>\n</blockquote>\n<p>Yes, thanks :) Feel free to keep it a bit vague so that we can discuss specifics here and avoid duplication.</p>\n</blockquote>\n<p><a href=\"https://github.com/ghostty-org/ghostty/issues/3558\">https://github.com/ghostty-org/ghostty/issues/3558</a></p>",
        "id": 568544465,
        "sender_full_name": "nandi",
        "timestamp": 1768610484
    },
    {
        "content": "<p>That's a really interesting approach the ghostty team have. I think I like it. Interested to hear what others think.</p>",
        "id": 568544851,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1768610776
    },
    {
        "content": "<p>I was tempted to make a suggestion to close our <a href=\"https://github.com/roc-lang/roc/issues\">over 1000 open issues</a> and then have a channel/topic where people discuss the ones they want to reopen</p>",
        "id": 568545167,
        "sender_full_name": "nandi",
        "timestamp": 1768610959
    },
    {
        "content": "<p>my hesitation is that the new compiler is so nascent, having that many issues doesn't necessarily seem too unreasonable</p>",
        "id": 568545496,
        "sender_full_name": "nandi",
        "timestamp": 1768611271
    },
    {
        "content": "<p>I feel like naturally opensource gets issues of various froms:</p>\n<ol>\n<li>drop by bugs</li>\n<li>general ideas from users</li>\n<li>concrete proposals/projects from contributors</li>\n<li>tasks from contributors (depending on the person, various sizes)</li>\n<li>helpdesk request</li>\n<li>complaints of whatever form</li>\n</ol>\n<p>With how roc and github work:<br>\ngeneral ideas from users, helpdesk request, and complaints of whatever form definitely belong in zulip<br>\ndrop by bugs often make sense to start in zulip but if they have enough info are fine as issues (they often don't have enough info though.<br>\nconcrete proposal also belong in zulip or maybe in rfcs<br>\nprojects from contibutors actually do below in github<br>\ntasks from contributors also belong in github, but they are complex. If they are really small, they get lost in the miles of bugs, but also the small ones like that are often best for new contributors.</p>",
        "id": 568545643,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1768611437
    },
    {
        "content": "<p>Anyway, all that to say that the ghostty idea is pretty reasonable. Funnel through zulip first.</p>",
        "id": 568545672,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1768611471
    },
    {
        "content": "<p>One inchoate idea I have is to make a roc-support-bot (or LLM).  I don't quite mean this literally, more conceptually or logically.  When a new user needs support, the first line could be a conversational LLM, or agentic.  When that avenue is exhausted, take it to Zulip.  Zulip decides whether to promote to an Issue.</p>\n<p>Obviously, I am True Believer (tm) in LLMs, but only because they have greatly accelerated my progress (in some direction, heh) in understanding (primarily) and writing working code (for various definitions of working) in unfamiliar arenas.  Not only in Roc.  They are not quite the bees' knees yet, but they already augment my own perception of my performance in the areas that matter to me.</p>",
        "id": 568717753,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768796072
    },
    {
        "content": "<p>Like <a href=\"https://chatgpt.com/g/g-fw4uYIned-rocgpt\">RocGPT</a> <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> -- not sure when this was last updated .. <span class=\"user-mention\" data-user-id=\"361169\">@Anton</span> might know</p>",
        "id": 568732148,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1768806373
    },
    {
        "content": "<p>Doubling the idea of site update. When I came in to try a new compiler, I was confused about relevance of info in tutorial. I thought it somehow should reflect new compiler changes. So until I searched for new interface in compiler docs, I did not understand whether std changed or I'm doing something else wrong</p>\n<p>Just having a warning would help a lot. And also this information might be relevant for new users who want to try Roc. I'm sure most would wait for new compiler if they new that everything is about to change</p>",
        "id": 568739374,
        "sender_full_name": "Artem",
        "timestamp": 1768809501
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/channel/231634-beginners/topic/New.20Compiler.3A.20learning.20and.20reference/near/568732148\">said</a>:</p>\n<blockquote>\n<p>Like <a href=\"https://chatgpt.com/g/g-fw4uYIned-rocgpt\">RocGPT</a> <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> -- not sure when this was last updated .. <span class=\"user-mention silent\" data-user-id=\"361169\">Anton</span> might know</p>\n</blockquote>\n<p>Not for a very long time, I think they require a paid chatGPT account for the user so it's not an ideal solution.</p>",
        "id": 568752354,
        "sender_full_name": "Anton",
        "timestamp": 1768813907
    },
    {
        "content": "<blockquote>\n<p>One inchoate idea I have is to make a roc-support-bot (or LLM). I don't quite mean this literally, more conceptually or logically.</p>\n</blockquote>\n<p>A simple version of this would be to make a general Roc prompt that explains all the basics, has links to useful resources, contains instructions for searching through github issues and zulip, etc.</p>\n<p>People like to use their own LLM.</p>",
        "id": 568753923,
        "sender_full_name": "Anton",
        "timestamp": 1768814384
    },
    {
        "content": "<blockquote>\n<p>People like to use their own LLM.</p>\n</blockquote>\n<p>yes, exactly.  I need some handholding myself, quite a lot actually, and so not only am I developing a platform as my 'hello world', I am simultaneously feeding everything I've learned into a claude skill, so I am learning how to make the LLM learn to be my handholder.</p>\n<p>I think this <code>roc-lang</code> claude skill that I'm working on is a good entry point, but I'm not sure how well it's going so far.</p>",
        "id": 568770708,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768819434
    },
    {
        "content": "<p>which \"new compiler docs\" are the most helpful?  where should I start my search?</p>",
        "id": 568772945,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768820094
    },
    {
        "content": "<blockquote>\n<p>which \"new compiler docs\" are the most helpful?</p>\n</blockquote>\n<p><a href=\"https://github.com/roc-lang/roc/blob/main/src/build/roc/Builtin.roc\">https://github.com/roc-lang/roc/blob/main/src/build/roc/Builtin.roc</a><br>\n<a href=\"https://github.com/roc-lang/roc/blob/main/test/fx/all_syntax_test.roc\">https://github.com/roc-lang/roc/blob/main/test/fx/all_syntax_test.roc</a><br>\nYou can also search through the test folder or test/snapshots if you the above links did not contain a useful example.</p>",
        "id": 568777680,
        "sender_full_name": "Anton",
        "timestamp": 1768821609
    },
    {
        "content": "<blockquote>\n<p>where should I start my search?</p>\n</blockquote>\n<p>Do you mean your search for all the info needed for your claude skill?</p>",
        "id": 568777791,
        "sender_full_name": "Anton",
        "timestamp": 1768821654
    },
    {
        "content": "<p>i've got those 2 in the bag, plus langref/* and my LLMs have poked all through src/  and test/snapshots/  I was hoping there was more \"documentation\", but totally understandable that we're not there yet.</p>",
        "id": 568780133,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768822447
    },
    {
        "content": "<p>\"my search\" is both for myself and a claude skill.  in general, my approach has been to feed good information to an LLM with fresh context.  then I ask the LLM to explain things to me.  so far, when it tries to write roc-nightly code, it makes a lot of mistakes.  All of its mistakes seem plausible to me, so I think it's doing a much better job than I could, given the source material and human limits on time and understanding.</p>\n<p>This is my best result so far, according to my own quite limited judgment: <a href=\"https://gist.github.com/rickhull/ad9a8ca20adf332242524d3b1db01e68\">https://gist.github.com/rickhull/ad9a8ca20adf332242524d3b1db01e68</a></p>\n<p>It's a lot, but tries to be comprehensive.  I would consider it a skeleton.  The explanation of \"tag union\" is kinda cringe.  I am treating this as my lodestar for now, but if anyone sees anything wrong or misleading, please let me know.</p>",
        "id": 568780930,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768822760
    },
    {
        "content": "<blockquote>\n<p>This is my best result so far, according to my own quite limited judgment: <a href=\"https://gist.github.com/rickhull/ad9a8ca20adf332242524d3b1db01e68\">https://gist.github.com/rickhull/ad9a8ca20adf332242524d3b1db01e68</a></p>\n</blockquote>\n<p>It looks pretty good from a quick scan :)</p>",
        "id": 568799083,
        "sender_full_name": "Anton",
        "timestamp": 1768828687
    },
    {
        "content": "<p>I think it's important to let people know ASAP how much of the documentation that's available won't apply to the new compiler. The website emphasises that the language is in alpha, but some won't realise how much of the syntax they are learning and writing will stop working.</p>\n<p>What do you all think of providing a warning that includes links to the Advent of Code document at the top of the existing tutorial and installation pages? That gives people the choice and might reduce the risk of putting people off starting learning altogether, while also ensuring they are using the right compiler for their goals.</p>",
        "id": 568921124,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768866863
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/channel/231634-beginners/topic/New.20Compiler.3A.20learning.20and.20reference/near/568544851\">said</a>:</p>\n<blockquote>\n<p>That's a really interesting approach the ghostty team have. I think I like it. Interested to hear what others think.</p>\n</blockquote>\n<p>Yes I like it too. Of course, it's unnecessary in smaller projects, and there might be other ways to mark certain issues as ready to be implemented, but in a project with over 1000 open issues it's probably a good idea. I think it's worth starting a separate Zulip thread on this if it hasn't been already. There might need to be a system developed for determining when a proposal gets promoted to an Issue, including this one.</p>",
        "id": 568922557,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768867917
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"780900\">Rick Hull</span> <a href=\"#narrow/channel/231634-beginners/topic/New.20Compiler.3A.20learning.20and.20reference/near/568717753\">said</a>:</p>\n<blockquote>\n<p>When a new user needs support, the first line could be a conversational LLM, or agentic.  When that avenue is exhausted, take it to Zulip.  Zulip decides whether to promote to an Issue.</p>\n</blockquote>\n<p>Yes, I think it's a good idea to support the use of LLMs before Zulip for both compilers. The head of the tutorial already does a decent job of encouraging LLM use by providing links to the LLM-friendly version of the docs, but the LLM --&gt; Zulip pipeline could be made clearer at the top of that page and at the top of the docs themselves, with docs for each compiler.</p>",
        "id": 568922796,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768868149
    },
    {
        "content": "<p>I'm totally up for putting a warning message on <a href=\"http://roc-lang.org\">roc-lang.org</a> - if anyone wants to contribute that, I'd appreciate it!</p>",
        "id": 568930803,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1768875614
    },
    {
        "content": "<blockquote>\n<p>If I were onboarding a new dev, I might tell them something like: <code>Roc-alpha-4</code> is stable and relatively frozen but also somewhat deprecated. All of the docs are oriented to the old Roc system. The new Roc system is much different, call it <code>Roc-nightly</code>. Different syntax, different features, different builtins (stdlib). Currently, this has the normal expectations of \"bleeding edge development\" with underspecified docs that are scattered throughout the ecosystem. Here is a rough guide: ...</p>\n</blockquote>",
        "id": 568933119,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768878052
    },
    {
        "content": "<p>I would simplify it a bit:</p>\n<p>\"The following is based on the stable Rust compiler, and some of the syntax will not work with the new Zig compiler. If you would like to experiment with the unstable Zig compiler, you can try the Advent of Code guide.\" (with hyperlink)</p>\n<p>That same text can be used for the top of the tutorial, examples and docs pages.</p>\n<p>Here's a commit for the tutorial page that I'll do a PR for if no one objects:</p>\n<p><a href=\"https://github.com/roc-lang/www.roc-lang.org/compare/main...alecgargett:www.roc-lang.org:patch-3\">https://github.com/roc-lang/www.roc-lang.org/compare/main...alecgargett:www.roc-lang.org:patch-2</a></p>",
        "id": 568941444,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768884752
    },
    {
        "content": "<p>I think it's better to link to the Advent of Code guide only, and people can leave comments on that guide with links to other resources.</p>",
        "id": 568942239,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768885327
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"1016544\">@riverstone</span> I'll check that out</p>",
        "id": 568973895,
        "sender_full_name": "Anton",
        "timestamp": 1768900632
    },
    {
        "content": "<blockquote>\n<p>call it <code>Roc-nightly</code></p>\n</blockquote>\n<p>This may be confusing, we've had <a href=\"https://github.com/roc-lang/roc/releases/tag/nightly\">nightlies of the old compiler</a> for many years. We typically use \"new/zig compiler\" and I think that's been the best name so far.</p>",
        "id": 568974352,
        "sender_full_name": "Anton",
        "timestamp": 1768900765
    },
    {
        "content": "<p>OK I've done two PRs on the website repo for Docs and Tutorial and one PR on the examples repo.</p>",
        "id": 568984693,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768903886
    },
    {
        "content": "<p>I should have use my real name on here haha. Any admin can change it if you like.</p>",
        "id": 568984784,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768903910
    },
    {
        "content": "<p>i'm sure I will find it, but what is the \"Advent of Code document\"?   I can tell AoC has some importance to Roc, but when I poked around, it looks like there was something from several years ago.  Was last year's about the new compiler?</p>",
        "id": 569021589,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768914920
    },
    {
        "content": "<blockquote>\n<p>\"Advent of Code document\"</p>\n</blockquote>\n<p>Is it this: <a href=\"https://gist.github.com/rtfeldman/f46bcbfe5132d62c4095dfa687bb9aa4\">https://gist.github.com/rtfeldman/f46bcbfe5132d62c4095dfa687bb9aa4</a></p>\n<p>I don't think we have another document</p>\n<blockquote>\n<p>it looks like there was something from several years ago</p>\n</blockquote>\n<p>Yeah, people do AoC with Roc every year :)</p>\n<blockquote>\n<p>Was last year's about the new compiler?</p>\n</blockquote>\n<p>Yes but it was not really ready to shine yet</p>",
        "id": 569032650,
        "sender_full_name": "Anton",
        "timestamp": 1768917543
    },
    {
        "content": "<p>oh nice!  how accurate is it today?</p>",
        "id": 569042619,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768919651
    },
    {
        "content": "<p>Should be pretty solid, you just need to use the latest release of the platform <a href=\"https://github.com/lukewilliamboswell/roc-platform-template-zig/releases/tag/0.6\">https://github.com/lukewilliamboswell/roc-platform-template-zig/releases/tag/0.6</a></p>",
        "id": 569042977,
        "sender_full_name": "Anton",
        "timestamp": 1768919719
    },
    {
        "content": "<p>that's what I am basing off of, or HEAD as of a week ago</p>",
        "id": 569043772,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768919873
    },
    {
        "content": "<p>LLM analysis of the 2025 AoC doc: <a href=\"https://gist.github.com/rickhull/da5824695d632ca34be686b4e9c84ad6\">https://gist.github.com/rickhull/da5824695d632ca34be686b4e9c84ad6</a></p>",
        "id": 569046110,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768920345
    },
    {
        "content": "<p>I'll make a todo for an updated version</p>",
        "id": 569047154,
        "sender_full_name": "Anton",
        "timestamp": 1768920573
    },
    {
        "content": "<p>Awesome!   this is a little bit of a validation of my <code>roc-language</code> skill.  I started a new LLM session, loaded the skill, and let it rip on the AoC doc.</p>\n<p>I am ready to share this skill -- host it somewhere and accept PRs.  Open to suggestions.</p>\n<p>I am also considering renaming it to <code>roc-lang</code>.  Open to suggestions.</p>",
        "id": 569054074,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768922055
    },
    {
        "content": "<blockquote>\n<p>I am ready to share this skill -- host it somewhere and accept PRs. Open to suggestions.</p>\n</blockquote>\n<p>We could include it in <a href=\"http://github.com/roc-lang/roc\">github.com/roc-lang/roc</a> and make a new init subcommand <code>roc init</code> that produces a starter roc project with a <code>.claude/skills/roc-lang</code>. Thoughts welcome</p>",
        "id": 569060147,
        "sender_full_name": "Anton",
        "timestamp": 1768923332
    },
    {
        "content": "<p>It eager loads a 400ish-line <code>ROC_TUTORIAL_CONDENSED.md</code>, which was LLM generated purely from <code>Builtin.roc</code> and <code>all_syntax_test.roc</code></p>\n<p>Then it has for reference, full loading, or searching:</p>\n<ul>\n<li><code>Builtin.roc</code></li>\n<li><code>all_syntax_test.roc</code></li>\n<li><code>ROC_LANGREF_TUTORIAL.md</code> 2300ish line LLM-generated doc from a long opus run on the roc-lang/roc repo</li>\n</ul>\n<p>I would suggest someone other than me make a new topic, maybe not in #beginners for further discussion.</p>",
        "id": 569061225,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768923538
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"780900\">Rick Hull</span> <a href=\"#narrow/channel/231634-beginners/topic/New.20Compiler.3A.20learning.20and.20reference/near/569046110\">said</a>:</p>\n<blockquote>\n<p>LLM analysis of the 2025 AoC doc: <a href=\"https://gist.github.com/rickhull/da5824695d632ca34be686b4e9c84ad6\">https://gist.github.com/rickhull/da5824695d632ca34be686b4e9c84ad6</a></p>\n</blockquote>\n<p>Thanks Rick. Could you post a link to all of your relevant docs in the comments on the Advent of Code doc?</p>",
        "id": 569131020,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768944496
    },
    {
        "content": "<p>short answer: yes.   long answer: they are now hosted in a (presumably temporary) repo: <a href=\"https://github.com/rickhull/roc-init\">https://github.com/rickhull/roc-init</a>   see the #ideas channel for more details; PRs welcome</p>\n<p>UPDATE: <a href=\"https://gist.github.com/rtfeldman/f46bcbfe5132d62c4095dfa687bb9aa4?permalink_comment_id=5948847#gistcomment-5948847\">https://gist.github.com/rtfeldman/f46bcbfe5132d62c4095dfa687bb9aa4?permalink_comment_id=5948847#gistcomment-5948847</a></p>",
        "id": 569131362,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768944637
    },
    {
        "content": "<p>OK. I'd be fine with updating the NOTE on the Tutorial page to include a link to this:</p>\n<p>\"...<a href=\"https://gist.github.com/rtfeldman/f46bcbfe5132d62c4095dfa687bb9aa4\">Advent of Code guide</a> and <a href=\"https://gist.github.com/rtfeldman/f46bcbfe5132d62c4095dfa687bb9aa4?permalink_comment_id=5948847#gistcomment-5948847\">LLM-generated documents</a>\".</p>",
        "id": 569132938,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768945239
    },
    {
        "content": "<p>The update to the Examples.md page hasn't gone live yet unlike the .html. Does the html builder need to be triggered manually?</p>",
        "id": 569133356,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768945412
    },
    {
        "content": "<p>within <a href=\"https://github.com/rickhull/roc-init/tree/master/docs\">roc-init/docs</a>, the <code>UPCASE.md</code> docs are (somewhat coincidentally) LLM-generated, and the <code>OtherCase.md</code> docs are handwritten (presumably)</p>",
        "id": 569137447,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768947342
    },
    {
        "content": "<p>I think that we can make (some of) the LLM-suggested changes to AoC25, and get rid of the analysis doc.  i think <span class=\"user-mention\" data-user-id=\"361169\">@Anton</span> has that in a TODO</p>",
        "id": 569138348,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768947774
    },
    {
        "content": "<p>This is the tracking issue, to my knowledge: <a href=\"https://github.com/roc-lang/roc/issues/9040\">https://github.com/roc-lang/roc/issues/9040</a></p>",
        "id": 569138914,
        "sender_full_name": "Rick Hull",
        "timestamp": 1768948038
    },
    {
        "content": "<p>Sounds good</p>",
        "id": 569147373,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768953293
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"1016544\">Alec Gargett</span> <a href=\"#narrow/channel/231634-beginners/topic/New.20Compiler.3A.20learning.20and.20reference/near/569133356\">said</a>:</p>\n<blockquote>\n<p>The update to the Examples.md page hasn't gone live yet unlike the .html. Does the html builder need to be triggered manually?</p>\n</blockquote>\n<p>I have triggered a new build, the website is not updated automatically if only the examples repo changed.</p>",
        "id": 569204822,
        "sender_full_name": "Anton",
        "timestamp": 1768987545
    },
    {
        "content": "<p>Thanks Anton</p>",
        "id": 569213340,
        "sender_full_name": "Alec Gargett",
        "timestamp": 1768989814
    }
]