[
    {
        "content": "<p>Hey,</p>\n<p>so I've been thinking about what made Rust as a language so successfull, after listening to <a href=\"https://rustacean-station.org/episode/042-ben-striegel/\">https://rustacean-station.org/episode/042-ben-striegel/</a> - and the point that rust was so successful in _the early days_ because it was open source and anyone could come up with proposals, that point is quite compelling.</p>\n<p>So... can we start a discussion on opensourcing roc?</p>",
        "id": 261426033,
        "sender_full_name": "Matthias Beyer",
        "timestamp": 1636908125
    },
    {
        "content": "<p>A nice benefit would be that people would not need to have access to master anymore, which would also solve the mess with the merge back-and-forth... Which is one of the points on why the history is such a mess (the other one being that people seem not to write commit messages at all...) <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 261426165,
        "sender_full_name": "Matthias Beyer",
        "timestamp": 1636908304
    },
    {
        "content": "<p>hey Matthias!</p>",
        "id": 261427323,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636909612
    },
    {
        "content": "<p>I definitely gave this a lot of thought before deciding to keep the repo private at first, because that's how I've done all my other projects <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 261427337,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636909634
    },
    {
        "content": "<p>So are there any plans on when to go open source and what has to be \"there\" before that happens?</p>",
        "id": 261427411,
        "sender_full_name": "Matthias Beyer",
        "timestamp": 1636909707
    },
    {
        "content": "<p>yes! the specific prerequisites are:</p>\n<ul>\n<li>the editor is usable as a daily driver</li>\n<li>the editor has a plugin system</li>\n<li>the plugins can be distributed with packages</li>\n</ul>",
        "id": 261427436,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636909752
    },
    {
        "content": "<p>the reason for these being the prerequisite is that I want to give the editor the best shot possible at becoming the thing everyone uses, because the value of the package ecosystem can potentially increase exponentially if everyone is making plugins for the same editor, and shipping them with their packages</p>",
        "id": 261427500,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636909819
    },
    {
        "content": "<p>but the default path of least resistance is for everyone to use the editor they already use (for me, Vim; for others, VS Code, Emacs, IntelliJ IDEA, etc)</p>",
        "id": 261427508,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636909845
    },
    {
        "content": "<p>so the aim of keeping the repo private (but letting anyone in who emails me; to date I've added 100% of people who ask for access) is to introduce a bit of intentional friction</p>",
        "id": 261427533,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636909888
    },
    {
        "content": "<p>to try to select for early users who have at least enough patience to send the email, and hopefully enough patience to be okay with waiting to see if that plan can work out! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 261427595,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636909940
    },
    {
        "content": "<p>because our best shot at creating that ecosystem is right from the get-go</p>",
        "id": 261427606,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636909958
    },
    {
        "content": "<p>if there's a LSP plugin for every major editor, and everyone gets used to that workflow, and is publishing packages with no plugins, then there will be a cultural norm that people will continue to use the editor they're most familiar with, and also there won't be a cultural norm of packages shipping with plugins</p>",
        "id": 261427631,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636909998
    },
    {
        "content": "<p>however, if we have plugins from day one of the package ecosystem, and also everyone is on board with using the editor as a daily driver (once it's far enough along to be usable as one, of course!) then we have the best chance at creating that ecosystem of packages+plugins, where basically every package you install comes with a plugin because that's a cultural norm</p>",
        "id": 261427689,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636910048
    },
    {
        "content": "<p>I don't know of any language which has done that before, and I think it's worth taking the unusual step of keeping the repo private longer to give it the best possible chance of success!</p>",
        "id": 261427711,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636910079
    },
    {
        "content": "<p>and I think the downside of \"what if someone finds out about Roc, but doesn't want to send an email to get access, but if they hadn't had to do that and instead were able to use the language right away, they then would have gone on to make an amazing contribution in the early days\" is less of a risk than the risk that we don't get the cultural momentum going on the package+plugin ecosystem <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 261427744,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1636910146
    },
    {
        "content": "<p>Okay, sounds reasonable. One question though: You're basically talking about everything except the language itself here <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span> does this mean the language is \"ready\" (as far as one could say this word in the current situation) <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 261428042,
        "sender_full_name": "Matthias Beyer",
        "timestamp": 1636910546
    },
    {
        "content": "<p>the assumption is that those targets will give the language enough time</p>",
        "id": 261428967,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1636911675
    },
    {
        "content": "<p>it's by no means done, both from a design perspective nor from an implementation perspective</p>",
        "id": 261428980,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1636911693
    },
    {
        "content": "<p>it’s also already UPL licensed. It’s not closed source necessarily, there’s just a few extra hoops to get access compared to just landing on a webpage</p>",
        "id": 261435149,
        "sender_full_name": "Lucas Rosa",
        "timestamp": 1636919433
    }
]