[
    {
        "content": "<p>Hi all,</p>\n<p>I'm going through the Roc tutorial and running into an issue with the step on destructuring. Following the tutorial fairly closely, I've ended up with this program:</p>\n<div class=\"codehilite\" data-code-language=\"roc\"><pre><span></span><code>birds = 3\niguanas = 2\ntotal = addAndStringify {birds, iguanas}\n\naddAndStringify = \\{birds, iguanas} -&gt;\n  sum = birds + iguanas\n  if sum == 0 then\n    \"\"\n  else\n    Num.toStr sum\n\nmain = Stdout.line \"There are $(total) animals.\"\n</code></pre></div>\n<p>This fails to compile with the error that the <code>birds</code> and <code>iguanas</code> identifiers in the destructured record are duplicates of the original <code>birds</code> and <code>iguanas</code> variables.</p>\n<p>The pattern of naming some variables, placing them in a record via punning and then pulling them out in a function parameter via destructuring seems like it would be a common one (I certainly expected it to just work}.  I also notice that this happens with \"normal\" parameter names (not just destructured field names), and also if I create <code>birds</code> or <code>iguanas</code> variables inside the function body itself.</p>\n<p>Is the no-shadow rule supposed to be this strict, in which case I think there is a rough edge here in the tutorial, or is this a bug?</p>\n<p>(Related-ish: I'd be interesting in knowing the rationale around banning underscores in identifiers? My first instinct for fixing my compile error was to rename the parameters <code>iguanas_</code> and <code>birds_</code>, but that refused to compile as well.)</p>",
        "id": 422594426,
        "sender_full_name": "Daniel Rivas",
        "timestamp": 1708514067
    },
    {
        "content": "<blockquote>\n<p>Is the no-shadow rule supposed to be this strict</p>\n</blockquote>\n<p>Currently, yes, but we're working on allowing shadowing.</p>",
        "id": 422603324,
        "sender_full_name": "Anton",
        "timestamp": 1708517545
    },
    {
        "content": "<blockquote>\n<p>in which case I think there is a rough edge here</p>\n</blockquote>\n<p>I agree but I don't know how we can avoid it here <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 422603482,
        "sender_full_name": "Anton",
        "timestamp": 1708517612
    },
    {
        "content": "<p>Richard has talked about underscores in identifiers <a href=\"#narrow/stream/231634-beginners/topic/Allow.20underscores.20in.20field.20names.20and.20variable.20names.20.233026/near/410543729\">here</a>.</p>",
        "id": 422603830,
        "sender_full_name": "Anton",
        "timestamp": 1708517734
    },
    {
        "content": "<p>Aha, thanks for the reply. It seems like this is a pretty common complaint--I'm definitely in the pro-shadowing camp! My general feeling is that it's hard to come up with variable names, and it's really annoying to have to think of a new one just because it happens to have been used before in some other context. This is exacerbated by my being one of those annoying people who tends to name short-lived variables things like 'x' or 'y'.</p>\n<p>WRT the tutorial: I suppose if the plan is to enable shadowing of some sort there's no reason for the tutorial to change in the meantime. I can't immediately think of a case where destructuring a parameter record would be useful _without_ allowing shadowing.</p>",
        "id": 422611450,
        "sender_full_name": "Daniel Rivas",
        "timestamp": 1708520324
    },
    {
        "content": "<p>To be fair, this example is something that is super rare and I have essentially never run into in practice. Having a global with a name and record fields with the same name. In this specific case you would just reference the globals directly.</p>",
        "id": 422668384,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1708535825
    },
    {
        "content": "<p>Generally you also don't put a value into a record and destructure in the same or a nested scope. You just use the variables directly in those cases. You would only build the record if sending the record to a totally unrelated scope. Which would be totally allowed to destructure.</p>",
        "id": 422668661,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1708535905
    },
    {
        "content": "<p>Of course there are other reasons to want shadowing.</p>",
        "id": 422668738,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1708535932
    },
    {
        "content": "<p>Hmm, that's interesting! This is a case that I run into <em>all the time</em>, but I'm primarily a Rust and TypeScript developer, so it might just be that I'm holding the language wrong. Anecdotally, a colleague of mine activated the equivalent no-shadow rule in our ESLint a few months ago, and it added hundreds of errors. But I understand that the no-shadow rule is inherited from Elm, and while I haven't used Elm very much personally I can't remember hearing anyone complaining about that rule, so maybe I'm just not using Roc correctly.</p>\n<p>Still though, I feel like it's going to be an annoyance for me. In JavaScript it's very common to use a destructured object as a function parameter, as a workaround for the lack of named arguments. But more generally, there are cases where there just aren't many good names for a certain thing. I'm thinking of, e.g., a <code>Point { x: I64, y: I64 }</code> type -- I really don't want to have to think of new names for <code>x</code> and <code>y</code> if I happen to pull them out into variables.</p>\n<p>Anyway, if you say it's not really an issue in practice, I'll take your word for it for now! I definitely don't have enough Roc experience to judge -- it's just something that definitely added friction as a beginner.</p>",
        "id": 422694385,
        "sender_full_name": "Daniel Rivas",
        "timestamp": 1708544925
    }
]