[
    {
        "content": "<p>Hi! Are there any discussions around platform proliferation becoming a problem long term? </p>\n<p>I know it's (very!) early days but could roc be very different depending on which platform you are using?  Could there be many ways to solve the same problem depending on which platform you choose?</p>\n<p>Related to this, how would different platform share code? Using for example rust crates?</p>",
        "id": 302222975,
        "sender_full_name": "Marcos Prieto",
        "timestamp": 1664875976
    },
    {
        "content": "<p>Definitely early days, but i will try to give rough answers:</p>\n<blockquote>\n<p>Hi! Are there any discussions around platform proliferation becoming a problem long term? </p>\n</blockquote>\n<p>I know it has been discussed some in various forms, but only the rough idea of it.</p>\n<blockquote>\n<p>I know it's (very!) early days but could roc be very different depending on which platform you are using? </p>\n</blockquote>\n<p>I am not sure I would call if very different. Still the same scoped language, but definitely like using a different framework/library as the base of your app.</p>\n<blockquote>\n<p>Could there be many ways to solve the same problem depending on which platform you choose?</p>\n</blockquote>\n<p>For sure. The hope is that over time canonical platforms will arise for various tasks... This is the standard cli platform, this one the standard web server...etc. that being said, if roc gets very popular, i would assume a decent amount of projects would tailor platforms to their specific app.</p>\n<blockquote>\n<p>Related to this, how would different platform share code? Using for example rust crates?</p>\n</blockquote>\n<p>Code sharing for platforms is completely dependent on the language the platform is written. Cargo and crates for rust. Etc for other languages.</p>",
        "id": 302265848,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1664891675
    },
    {
        "content": "<p>Thanks for answering, that makes sense <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 302407783,
        "sender_full_name": "Marcos Prieto",
        "timestamp": 1664957752
    }
]