[
    {
        "content": "<p>I'd like to generate some random numbers, so I looked around and found <a href=\"https://github.com/lukewilliamboswell/roc-random?tab=readme-ov-file\">roc-random</a>. It doesn't help you with seeding the RNG though, so I figured I could just pull a few bytes from <code>/dev/urandom</code>, but I'm not sure how to do that.</p>\n<p><code>File.read_bytes!</code> wants to read until EOF, which wouldn't work with <code>/dev/urandom</code>.</p>\n<p>I see <code>File.open_reader!</code>, but the only function that accepts a <code>Reader</code> seems to be  <code>File.read_line!</code>. Technically I guess that would work, since <code>/dev/urandom</code> will <em>probably</em> yield a <code>\\n</code> byte before too long, but I feel like there's probably a better way?</p>",
        "id": 543171815,
        "sender_full_name": "Joseph Montanaro",
        "timestamp": 1759680285
    },
    {
        "content": "<p>This totally could be a gap in the basic cli api</p>",
        "id": 543189092,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1759694078
    },
    {
        "content": "<p>I mean it probably should have a random seed generating function in general</p>",
        "id": 543189107,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1759694095
    },
    {
        "content": "<p>Yeah a proper \"system random\" function would be great b/c it could abstract away the cross-platform details.</p>\n<p>Is the basic-cli platform going to stay in Rust? I'd be happy to contribute a PR if that seems worthwhile, I'm certainly not a expert but it's basically a matter of pulling in a crate and wiring up a function or two</p>",
        "id": 543429662,
        "sender_full_name": "Joseph Montanaro",
        "timestamp": 1759799281
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"972318\">@Joseph Montanaro</span>, a PR would be great, if you provide claude code or codex with the changes from <a href=\"https://github.com/roc-lang/basic-cli/pull/380/files\">https://github.com/roc-lang/basic-cli/pull/380/files</a> as an example, it will likely be able to take care of the whole thing.</p>",
        "id": 543478397,
        "sender_full_name": "Anton",
        "timestamp": 1759827795
    },
    {
        "content": "<blockquote>\n<p>Is the basic-cli platform going to stay in Rust?</p>\n</blockquote>\n<p>I believe Richard wanted to port it to zig but I don't see a problem with adding random support in Rust for now.</p>",
        "id": 543478827,
        "sender_full_name": "Anton",
        "timestamp": 1759827922
    },
    {
        "content": "<p>Thanks! Should it go in an existing module, or get its own? The only module it sort of fits with would be <code>Env</code>, I guess? But it's not a great fit even there. Seems a little weird to have a whole module just for one function, but that's how <code>Sleep</code> is, after all.</p>",
        "id": 543493363,
        "sender_full_name": "Joseph Montanaro",
        "timestamp": 1759832378
    },
    {
        "content": "<p>I think another module is ok. We might find additional functionality we want in future.</p>",
        "id": 543493804,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1759832531
    }
]