[
    {
        "content": "<p>I'm just catching up on Roc's progress, and only just read the Abilities proposal followed immediately by <a href=\"https://docs.google.com/document/d/1OUd0f4PQjH8jb6i1vEJ5DOnfpVBJbGTjnCakpXAYeT8/edit?tab=t.0\">this methods/static dispatch/mainstream syntax proposal</a> - so pardon if this has changed since or if this opinion has been thoroughly expressed before.<br>\n<a href=\"/user_uploads/22008/ln4AXlGpb8rRRTugglqT7wb-/image.png\">image.png</a><br>\nThis side-by-side is the before/after from the syntax proposal. I have the most experience with js-style \"mainstream\" syntax like most people, but Elm is my favorite language, so that's my bias.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/ln4AXlGpb8rRRTugglqT7wb-/image.png\" title=\"image.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"1084x638\" src=\"/user_uploads/thumbnail/22008/ln4AXlGpb8rRRTugglqT7wb-/image.png/840x560.webp\"></a></div><p>The gist of it is: <br>\nThe old code (left) is beautiful, glanceable, explicit,  and reads like I would say it in my head. I can't say the same nearly as much for the new code on the left.</p>\n<p>Whitespace makes it so easy to separate the individual pieces of a line that I can even do it subconsciously for the code that's outside of my fovea - I can even do it without the syntax highlighting (which relies on colors). But it sounds like whitespace would be deprecated or removed (removed is probably best).  Much of the lines on the right are long unbroken strings of solid characters, and their separation is denoted with... more solid characters! It's a good thing this syntax highlighting scheme puts the parens in muted colors - the syntax highlighter is doing all of the heavy lifting on the right side.</p>\n<p>(I can imagine whitespace still working with the new syntax if the dot chains don't have to be touching each other, maybe there's a way to support that? Like <code>this.then.that</code> -&gt; <code>this .then .that</code> which I know currently means two different things)</p>\n<p>It's also all the operators in general. </p>\n<ul>\n<li>While the left one is !-ing at me 7 times, the right one is <span aria-label=\"exclamation\" class=\"emoji emoji-2757\" role=\"img\" title=\"exclamation\">:exclamation:</span><span aria-label=\"question\" class=\"emoji emoji-2753\" role=\"img\" title=\"question\">:question:</span> -ing at me 7 times. It's shouting and confused!?</li>\n<li>\"try\" tells me what's happening explicitly and intuitively - <code>?</code> feels more like a symbol I have to look up. (speaking from not knowing the language of course. \"try\" literally implies \"this could fail\", whereas \"?\" could mean any sort of \"uh, maybe, I guess?\" type thing - my first guess would be there's an optional value somewhere.) Something something \"there are worse things than being explicit\".</li>\n<li>The question mark is all the way at the end of the line. The left one reads \"try (this really long command here)\" but the right one, assuming I know ? means try, reads like \"do (really long command here) - no wait actually just try it!\". I guess I have a new appreciation for Elm's lack of postfix operators.</li>\n</ul>\n<p>Thing is, I really like the actual features of the new proposal, normal functions as methods seems like the right way to go, and the \".\" operator is nicer all around than the \"|&gt;\" operator. Perhaps in implementing this proposal there's no avoiding the loss of the old Elm style syntax (which reads more like poetry to me, the new  appearing more like a randomly generated password), but I just wanted to take a minute to put this perspective out there for those doing the great language design work.</p>",
        "id": 513930084,
        "sender_full_name": "Adroit",
        "timestamp": 1745430006
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"780770\">@Adroit</span>,<br>\nThis trade-off has been discussed in depth in <a class=\"message-link\" href=\"/#narrow/channel/304641-ideas/topic/.E2.9C.94.20reflecting.20on.20static.20dispatch.2E.2E.2E.20and.20discussing.20removin.2E.2E.2E/near/499362432\">#ideas &gt; ✔ reflecting on static dispatch... and discussing removin... @ 💬</a><br>\nI used to be on the whitespace side but after some experience with the new style I am completely used to it.</p>",
        "id": 513932020,
        "sender_full_name": "Anton",
        "timestamp": 1745430606
    },
    {
        "content": "<p>Ahh okay thanks, yeah I have 19796 unread \"recent conversations\" in this Zulip so it's hard to know where to find the discussion that's still relevant</p>",
        "id": 513932622,
        "sender_full_name": "Adroit",
        "timestamp": 1745430807
    },
    {
        "content": "<p>No problem, I'm happy to help people find stuff :)</p>",
        "id": 513932730,
        "sender_full_name": "Anton",
        "timestamp": 1745430842
    }
]