[
    {
        "content": "<p>Hi!</p>\n<p>I think Richard mentioned that he was using a SDL2 platform for one of his demos of Roc. I can't seem to find what talk it was. :(<br>\nDoes anyone know if that (or some SDL) platform/demo is available on GH somewhere?</p>",
        "id": 293689862,
        "sender_full_name": "Andreas T Jonsson",
        "timestamp": 1660645831
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"523479\">@Andreas T Jonsson</span> The fireworks demo in his recent <a href=\"https://youtu.be/XnbKVTO0eUE?t=1972\">Philly ETE talk</a> used an SDL2 platform. Is this the one you're looking for?<br>\nCan't see it in the roc-lang Github org, but Richard mentioned in that talk that <span class=\"user-mention\" data-user-id=\"343810\">@Brendan Hansknecht</span> made the fireworks demo (can't find it on their GH profile either), so they might know more</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"XnbKVTO0eUE\" href=\"https://youtu.be/XnbKVTO0eUE?t=1972\"><img src=\"https://uploads.zulipusercontent.net/f081fc98e0e8fa7b921cc36afebdb823be8d7f70/68747470733a2f2f692e7974696d672e636f6d2f76692f586e624b56544f306555452f64656661756c742e6a7067\"></a></div>",
        "id": 293707713,
        "sender_full_name": "David Dunn",
        "timestamp": 1660653785
    },
    {
        "content": "<p><a href=\"https://github.com/bhansconnect/roc-ecs\">https://github.com/bhansconnect/roc-ecs</a></p>\n<p>Also, some info in <a href=\"#narrow/stream/231634-beginners/topic/ECS\">#beginners &gt; ECS</a></p>",
        "id": 293709396,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1660654520
    },
    {
        "content": "<p>Might be slightly out of date from current Roc, but i can definitely update it if needed.</p>",
        "id": 293709971,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1660654730
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"343810\">@Brendan Hansknecht</span> I'm wondering how you went with the ECS experiment. I've been researching different ideas for the gui platform. One of the ideas I have is to implement a lot of the functionality in Roc. For example writing a pure Roc FlexBox layout using a Roc interface module. I'm just not entirely sure yet how that would interface with the platform. I definitely feel like some kind of data oriented architecture similar to ecs would be a good idea. I imagine the layout is just a system for the ui widgets. Looking for any pointers based on your experience.</p>",
        "id": 307218445,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1667257261
    },
    {
        "content": "<p>We have discussed ECS for the editor before but I'm not sure if you can view messages from before you joined. Does <a href=\"#narrow/stream/257722-editor/topic/Architecture.20Experiments.3A.20ECS/near/265282578\">this link</a> work for you <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span>?</p>",
        "id": 307262745,
        "sender_full_name": "Anton",
        "timestamp": 1667289508
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"361169\">@Anton</span> I hadn't seen that thread. I concur with <span class=\"user-mention\" data-user-id=\"461244\">@Matthias Devlamynck</span> and feel that it is worthwhile investigating further. I have been coming from my research into understanding Action-State and how that might be implemented in practice. With effects, and other Roc features I think it could make ECS really good to work with. It feels like it could fit well together, particularly with dynamically loading plugins. For example I was playing with ideas to support different layout libraries which you can swap out, i.e. flexbox. If we have a drawable widget then maybe it has position data which these libraries can update in the same way. Basically I have been looking for ideas about how we can provide primitives in the platform which play nicely with Roc modules to compose functionality.</p>",
        "id": 307274829,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1667295385
    },
    {
        "content": "<p>Excellent :) Being able to swap out layout libs sounds like a smart move!</p>",
        "id": 307277866,
        "sender_full_name": "Anton",
        "timestamp": 1667296678
    }
]