[
    {
        "content": "<p>Hi <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> noob here.<br>\n Could someone please explain Roc's threading model to me? I couldn't find it the docs nor in any of the talks.</p>",
        "id": 443379723,
        "sender_full_name": "Jan-Jan",
        "timestamp": 1717794233
    },
    {
        "content": "<p>Roc doesn't really have one</p>",
        "id": 443383745,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717796084
    },
    {
        "content": "<p>It is up to the platform</p>",
        "id": 443383753,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717796089
    },
    {
        "content": "<p>There has been more discussion on this somewhere here in zulip. The <a href=\"https://docs.google.com/document/d/1-h9bNNCLuYV2wSvjQA58SsGHOJivH9NHGr4wU_VF5I0/edit\">Task as builtin</a> proposal which will happen has points on this also.</p>",
        "id": 443445856,
        "sender_full_name": "Norbert Hajagos",
        "timestamp": 1717838782
    },
    {
        "content": "<p>(Correct me if I'm wrong pls) That would create a unified Roc api to ask for concurent execution of tasks from the platform (Roc could specify like: \"when all 5 of these tasks are done (I don't care about the order), do this next task\"). But yes, implementing it is still up to the platform, not up to Roc and the platform can choose to just execute those tasks on the same thread one after the other, so there is no guarantee they'll run in parallel.</p>",
        "id": 443446501,
        "sender_full_name": "Norbert Hajagos",
        "timestamp": 1717839350
    },
    {
        "content": "<p>Yeah, roc can define a nice API, but that really doesn't say much about the underlying threading model. Technically speaking a platform could suspend roc execution at ever <code>!</code> and move the roc application to a different core. Could theoretically even increment the refcount of everything in the task closure capture, store the state and have something to rewind back to.</p>",
        "id": 443501791,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717867994
    },
    {
        "content": "<p>Arguably, roc platform could expose an API to spawn threads for bulk compute tasks (i.e. give it a closure, await for completion). Naturally, you would not be able to communicate with the thread while it is doing its thing, so it would be fairly limited. The most natural way to achieve threading that makes sense for real work would be to target something like Lunatic runtime which can emulate CSP for wasm binaries. Might be a fun thing to do as well, given that Lunatic is inspired to some extent by Erlang VM, it would be fitting to run a modern FP language on a modern version of bean VM=))</p>",
        "id": 443837209,
        "sender_full_name": "Alexander Pyattaev",
        "timestamp": 1718044113
    },
    {
        "content": "<p>More info here <a href=\"https://crates.io/crates/lunatic\">https://crates.io/crates/lunatic</a></p>",
        "id": 443837578,
        "sender_full_name": "Alexander Pyattaev",
        "timestamp": 1718044231
    }
]