[
    {
        "content": "<p>Hi!</p>\n<p>I just discovered Roc a few minutes ago so I don't know much about it besides what was mentioned in the Youtube video uploaded by Developer Voices. But I had a question that I was hoping someone here with more experience could answer.</p>\n<p>At some point in the distant future I would like to make a video game that allows its users to write code to interact with the world. It will be in Rust via the Bevy engine. Does it make sense to use Roc for this scenario? There were some things mentioned in the video that made me think it might be great.</p>\n<p>What I would need is something that can quickly execute and compile small pieces of code. it doesn't need to be as fast as Rust, but I don't want it to be orders of magnitude slower either. It would also be fun if the users could do this in an online multiplayer environment, so sandboxing would be critical.</p>\n<p>edit: I realize that there are many other solutions I could look into, but I was wondering how easy/ergonomic it would be relative to those solutions. So it would be great to know of any difficulties or pitfalls with a possible Roc implementation. That way I can perhaps make comparisons with the other solutions</p>",
        "id": 409280073,
        "sender_full_name": "peeps",
        "timestamp": 1703116499
    },
    {
        "content": "<p>Okay, so I expected there to be topics on using Roc with Rust, but I didn't bother to look deeper to see if there were any bevy mentions in here, lol. Small world. Or bevy is bigger deal than I thought. In my defense, nothing came up when i looked up \"bevy\". I guess it was just looking at topic names.</p>",
        "id": 409288276,
        "sender_full_name": "peeps",
        "timestamp": 1703123068
    },
    {
        "content": "<p>That sounds like a perfect use case for a custom Roc platform.</p>",
        "id": 409481782,
        "sender_full_name": "Sky Rose",
        "timestamp": 1703201680
    },
    {
        "content": "<p>Glad to hear it. So does Roc support running the code in a sandbox environment? What are the details on that?</p>",
        "id": 409488781,
        "sender_full_name": "peeps",
        "timestamp": 1703205215
    },
    {
        "content": "<p>Oh hold on. So if my host doesn't provide a way to change files or access the internet, Roc apps will simply not be able to do that. So my host can be the sandbox by design. Is that correct?</p>",
        "id": 409490638,
        "sender_full_name": "peeps",
        "timestamp": 1703205922
    },
    {
        "content": "<p>Yeah</p>",
        "id": 409492229,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703206550
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409492229\">said</a>:</p>\n<blockquote>\n<p>Yeah</p>\n</blockquote>\n<p>I'm really not used to that. It makes too much sense lol.</p>\n<p>I think I'll just give it a shot with making a host for Bevy and if I have any questions il post them here. But I'm already aware of some issues because in the past I actually did <strong><em>some</em></strong> research into integrating a runtime in Bevy for user-made script and I did not get very far :/ .</p>",
        "id": 409497154,
        "sender_full_name": "peeps",
        "timestamp": 1703209205
    },
    {
        "content": "<p>Actually i just realized there's <a class=\"stream\" data-stream-id=\"302903\" href=\"/#narrow/stream/302903-Writing-a-platform\">#Writing a platform</a> so I might post my questions there.</p>",
        "id": 409500021,
        "sender_full_name": "peeps",
        "timestamp": 1703210522
    },
    {
        "content": "<p>Gonna post here for now, <a class=\"stream\" data-stream-id=\"302903\" href=\"/#narrow/stream/302903-Writing-a-platform\">#Writing a platform</a> feels like a place for more intelligent conversation <span aria-label=\"rolling on the floor laughing\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rolling on the floor laughing\">:rolling_on_the_floor_laughing:</span>.</p>\n<p>So I'm looking at a <a href=\"https://github.com/roc-lang/roc/blob/main/examples/glue/rust-platform/src/lib.rs\">simple rust platform</a> and it looks like a good place to start because its not super big but I'm not sure what the important files are and what anything means. There is very little documentation. If someone could go through it and put some comments in there, it would be a lot of help. If I missed something, please post a link. For now here is my interpretation of what I see:</p>\n<p>main.roc looks important, it looks like a platform definition file. No clue whats going on there. A breakdown of what everything does would be nice.</p>\n<p>The file that seems to be the bulk of the platform is <code>lib.rs</code>. it has functions like roc_realloc and roc_dealloc. Are all of these roc_ functions expected to exist in every platform? And are the ones in <code>lib.rs</code> gonna lead to memory leaks or any other memory management bugs? I was under the impression that the platform would need to do a bit more in terms of memory management, but it seems to me that Roc just needs a basic API to execute memory related tasks, such as allocating and deallocating, and Roc will just take it from there. I don't know if this is true though, but it is my current read of the situation. If that's true, then that's actually great news for me because I was anxious about how the memory management stuff was going to work and this seems very doable. Obviously for my case I still need to provide an API to deal with Bevy specific things, but my hope is that I wont have to write any unsafe blocks with memory management that I wont be able to effectively audit.</p>\n<p>The last thing is rust_main. Im confused about what the implementation means in general for platform development. I imagined that the platform is just a Roc API with a non-Roc implementation. If a Roc app uses something from the Roc API, it actually executes code in the host language without needing to know about it. And when you create variables in the Roc App that require heap memory, im assuming roc_alloc gets called automatically without the user needing to know about it. Thats all cool, but rust_main seems to be iterating through the roc app and resolving \"discriminants\". But my expectation was that I wouldn't need to run code in a loop like this, and instead just provide a specific function signature, similar to how we roc_alloc is defined. So I guess my question here is: what role does rust_main play? Would I need to do something similar in my case?</p>",
        "id": 409647257,
        "sender_full_name": "peeps",
        "timestamp": 1703282511
    },
    {
        "content": "<p>Oh, we have a partially working effect interpreter example. Didn't realize that was in the repo</p>",
        "id": 409650468,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703284559
    },
    {
        "content": "<p>That is the future of how roc effects will work. It enables async execution of roc effects among other things.</p>",
        "id": 409650559,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703284602
    },
    {
        "content": "<p>That probably isn't a good example to base off of today because it is using trying to use effect interpreters (the discriminant and switch in rust main that you noted). I'm not sure the best starting point to look at though. Probably <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span> knows the best base for a rust platform with glue, maybe basic CLI, but it is pretty large now and would need a lot of trimming.</p>",
        "id": 409650740,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703284694
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409650740\">said</a>:</p>\n<blockquote>\n<p>... a rust platform with glue...</p>\n</blockquote>\n<p>Im not super familiar with the concept of glue. I thought everything in this context would have it. But what you said implies it could not have it?</p>",
        "id": 409650923,
        "sender_full_name": "peeps",
        "timestamp": 1703284826
    },
    {
        "content": "<p>Glue is autogenerated host language (in this case rust) code to make interacting with roc easier.</p>",
        "id": 409650990,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703284895
    },
    {
        "content": "<p>Glue really only supports rust currently</p>",
        "id": 409651021,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703284921
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409650990\">said</a>:</p>\n<blockquote>\n<p>Glue is autogenerated host language (in this case rust) code to make interacting with roc easier.</p>\n</blockquote>\n<p>Ah, so theoretically I could decide to not rely on this and make my own glue?</p>",
        "id": 409651091,
        "sender_full_name": "peeps",
        "timestamp": 1703284952
    },
    {
        "content": "<p>It also, has a number of missing features, but when it works, it avoids needing to know roc internals and deal with all of the segfaults of manually writing the code.</p>",
        "id": 409651098,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703284964
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409651021\">said</a>:</p>\n<blockquote>\n<p>Glue really only supports rust currently</p>\n</blockquote>\n<p>Perfect, I'm a rust fanboy anyway :)</p>",
        "id": 409651123,
        "sender_full_name": "peeps",
        "timestamp": 1703284985
    },
    {
        "content": "<p>Yeah, the ffi can be written manually. That said, when glue is wrong or missing features, it is often best to manually edit it instead of starting from scratch.</p>",
        "id": 409651164,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703285027
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409651164\">said</a>:</p>\n<blockquote>\n<p>Yeah, the ffi can be written manually. And when glue is wrong or missing features, it is often best to manually edit it instead of starting from scratch.</p>\n</blockquote>\n<p>Is the plan for Glue to eventually have more features and never be wrong?</p>",
        "id": 409651250,
        "sender_full_name": "peeps",
        "timestamp": 1703285079
    },
    {
        "content": "<p>Yeah. It should become the default everywhere</p>",
        "id": 409651262,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703285097
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409651262\">said</a>:</p>\n<blockquote>\n<p>Yeah. It should become the default everywhere</p>\n</blockquote>\n<p>I really look forward to that. I find myself falling more in love with Roc as time passes <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 409651401,
        "sender_full_name": "peeps",
        "timestamp": 1703285189
    },
    {
        "content": "<p>Yeah, I feel kinda bad for all the people working on platforms or interested rn. We are in a gap where a lot of things are planned (some in progress) that will be pretty big changes to exactly how platforms work. So currently documentation is low priority cause it will be stale very fast. Also, currently tooling is only ok, but still has gaps.</p>\n<p>Hopefully medium term we will be transitioned with glue that just works and better docs, but there is a solid chunk of work to get there (just in platform impl changes before we even get to the glue or docs work)</p>",
        "id": 409651772,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703285467
    },
    {
        "content": "<p>Which so why currently, you kinda need someone like me to tell people the magic incantation to call roc successfully. That or just copy and paste and mess around.</p>",
        "id": 409651799,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703285507
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409651772\">said</a>:</p>\n<blockquote>\n<p>Yeah, I feel kinda bad for all the people working on platforms or interested rn. We are in a gap where a lot of things are planned (some in progress) that will be pretty big changes to exactly how platforms work. So currently documentation is low priority cause it will be stale very fast. Also, currently tooling is only ok, but still has gaps.</p>\n<p>Hopefully medium term we will be transitioned with glue that just works and better docs, but there is a solid chunk of work to get there</p>\n</blockquote>\n<p>I can't speak for everyone, but I really appreciate the work that you and other contributors do for cool projects like these, and I wouldn't want you to feel bad about something that is just a natural part of development. I am willing to wait longer if I need to, so no sweat!</p>\n<p>I don't want to seriously touch this until Bevy releases their dynamic querying and system registration (which will happen in 3-9 months by my estimation). For now I just wanted to try to learn whatever I can out of curiosity.</p>",
        "id": 409652113,
        "sender_full_name": "peeps",
        "timestamp": 1703285807
    },
    {
        "content": "<p>Regarding platforms, I think basic-webserver is probably the most mature re glue. But there are some papercuts and workarounds to get it to work. Definitely not a reflection of the desired end state, but just workable enough to save writing a bunch of glue for basic types.</p>",
        "id": 409652213,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1703285895
    },
    {
        "content": "<p>Also, are multiple different people working on a bevy related platform now/thinking about it?</p>",
        "id": 409652509,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703286108
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409652509\">said</a>:</p>\n<blockquote>\n<p>Also, are multiple different people working on a bevy related platform now/thinking about it?</p>\n</blockquote>\n<p>Right now I'm just trying to assess the viability of Roc for Bevy, so just thinking about it I guess. Luke and Alexander are working on something and I plan to join the effort at some point once I have caught up with their work, but I don't know where that path will lead so I'm also thinking about how I would go about this myself.</p>",
        "id": 409653070,
        "sender_full_name": "peeps",
        "timestamp": 1703286482
    },
    {
        "content": "<p>Ah..makes sense</p>",
        "id": 409654042,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703287276
    },
    {
        "content": "<p>Okay so i looked at the basic-webserver. In my case, the data  type id be sending into mainForHost is not knowable by the platform. Well, at least not during compile time. Let me explain...</p>\n<p>I might try to implement the following design: each user-made script must provide at least 2 functions: run() and query(). The query function will return something representing the data to query in the Bevy world. So the platform would first run roc_app::query() and then use the result to query the world, and then pass that data into roc_app::run(), which could be anything, but it should be the same types found in the query. Is this something that would be doable? Roc is statically typed, but that should be fine on the Roc side because once the user creates the script and it compiles, it wont need to change again during runtime. But as the author of the platform, I wont be able to know what query() will return (on the rust side I bet we would be dealing with generics). This also means I wont know the data type to pass into run(). </p>\n<p>Has someone run into this kind of situation before?</p>",
        "id": 409679580,
        "sender_full_name": "peeps",
        "timestamp": 1703303081
    },
    {
        "content": "<blockquote>\n<p>But as the author of the platform, I wont be able to know what query() will return (on the rust side I bet we would be dealing with generics)</p>\n</blockquote>\n<p>Using dynamic types over ffi definitely adds a layer of complication. In general, there are a handful of options here:</p>\n<ol>\n<li>Probably the easiest answer is to use tagged types. So everything that is passed from roc into rust would be in a form that describes the data. Rust would then dynamically deal with this info at runtime. This is would would happen in the case of lua or python being embedded in a generic way. That said, it obviously has a runtime cost.</li>\n<li>This next option is very use case specific as to whether or not it can be applied. First, you make all the data that roc is passing back to the host opaque. The host will receive what it thinks is a <code>Box {}</code>. Aka a pointer to nothing. Obviously the pointer will be to real roc data. When the host needs to interact with the boxed data, it needs to a generic method in roc to do so. For example, it might store arbitrary roc data and then call an update and render method on that data in roc. Could also use a <code>List {}</code> on the host side or similar if you want the data densely packed. But in general, this puts more responsibility on roc and likely more ffi communication and maybe more boxing.</li>\n<li>Last option would be the most complicated, but it would be to always compile the platform for the specific instance of the application. You would write the the platform using generics in rust. When compiling the roc app, each compilation would modify the platform and regenerate glue or have some other for of autogenerated rust code to deal with the generics. This has the potentially to be highest performance because it keeps everything static always. That said, it is much more complicated to manage and always requires the platform on an application data type changes.</li>\n</ol>\n<p>In general, I would lean towards 2 if you can make it work, if not probably 1 is best currently, but 3 would be really cool to see. But I would guess the cost isn't worth it especially for starting exploration.</p>",
        "id": 409729175,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703347604
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409729175\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>But as the author of the platform, I wont be able to know what query() will return (on the rust side I bet we would be dealing with generics)</p>\n</blockquote>\n<p>Using dynamic types over ffi definitely adds a layer of complication. In general, there are a handful of options here:</p>\n<ol>\n<li>Probably the easiest answer is to use tagged types. So everything that is passed from roc into rust would be in a form that describes the data. Rust would then dynamically deal with this info at runtime. This is would would happen in the case of lua or python being embedded in a generic way. That said, it obviously has a runtime cost.</li>\n</ol>\n<p>....<br>\n</p>\n</blockquote>\n<p>For option 1, could caching eliminate the runtime cost? I don't expect the types to change often. Actually, they should only change when the user changes them during some kind of dev session (imagining a hot reloading situation with script editing inside the game) but once they're in \"game mode\" i can guarantee that the types they ask for will never change.</p>",
        "id": 409729905,
        "sender_full_name": "peeps",
        "timestamp": 1703348295
    },
    {
        "content": "<p>I would have to think about it more and what exactly gets cached, but I think if you were to cache the type information, you might still have more complex/dynamic code, than fully static, but it should be a reasonable speed.</p>",
        "id": 409731104,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703349252
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"675776\">@peeps</span>  the whole point of thread about plugins in roc is to ultimately have working bevy example. However, currently there are some major stumbling blocks present. If you want I can add you into my repo where I make experiments with Roc-based bevy plugins with some help from roc dev <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span> . Code is currently here <a href=\"https://github.com/alexpyattaev/roc-plugin-example\">https://github.com/alexpyattaev/roc-plugin-example</a>, let me know your github handle if you want to poke at it.</p>",
        "id": 409749296,
        "sender_full_name": "Alexander Pyattaev",
        "timestamp": 1703365487
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"674610\">Alexander Pyattaev</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409749296\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"675776\">peeps</span>  the whole point of thread about plugins in roc is to ultimately have working bevy example. However, currently there are some major stumbling blocks present. If you want I can add you into my repo where I make experiments with Roc-based bevy plugins with some help from roc dev <span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> . Code is currently here <a href=\"https://github.com/alexpyattaev/roc-plugin-example\">https://github.com/alexpyattaev/roc-plugin-example</a>, let me know your github handle if you want to poke at it.</p>\n</blockquote>\n<p>Thanks for reaching out. I was going to clone the repo and mess around with it to figure out where you're at before reaching out with my thoughts/changes, but I'm having trouble finding time. But definitely in the near future. I also look forward to our meeting in January, I'm sure we will have some things to talk about <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 409750279,
        "sender_full_name": "peeps",
        "timestamp": 1703366537
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409652213\">said</a>:</p>\n<blockquote>\n<p>Regarding platforms, I think basic-webserver is probably the most mature re glue. But there are some papercuts and workarounds to get it to work. Definitely not a reflection of the desired end state, but just workable enough to save writing a bunch of glue for basic types.</p>\n</blockquote>\n<p>Can you help me get this to work? Currently getting the error in the screenshot (sorry, copy/pasting was not working so had to screenshot).<br>\n<a href=\"/user_uploads/22008/BIG05_x9R_guDpGUyyYFpN96/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/BIG05_x9R_guDpGUyyYFpN96/image.png\" title=\"image.png\"><img src=\"/user_uploads/22008/BIG05_x9R_guDpGUyyYFpN96/image.png\"></a></div>",
        "id": 409945093,
        "sender_full_name": "peeps",
        "timestamp": 1703544355
    },
    {
        "content": "<p>I wont be able to investigate this today, just out with family. I should be able to look at it tomorrow sometime. Can you run glue manually without the script?</p>",
        "id": 409947304,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1703546947
    },
    {
        "content": "<p>Actually it's probably because that script assumes roc repository is at a particlar place relative. Do you have roc cloned on your system? I am not sure if it works just using nightlies</p>",
        "id": 409947542,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1703547202
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409947304\">said</a>:</p>\n<blockquote>\n<p>I wont be able to investigate this today, just out with family. I should be able to look at it tomorrow sometime. Can you run glue manually without the script?</p>\n</blockquote>\n<p>No worries! No rush at all. Happy holidays <span aria-label=\"evergreen tree\" class=\"emoji emoji-1f332\" role=\"img\" title=\"evergreen tree\">:evergreen_tree:</span> </p>\n<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/409947542\">said</a>:</p>\n<blockquote>\n<p>Actually it's probably because that script assumes roc repository is at a particlar place relative. Do you have roc cloned on your system? I am not sure if it works just using nightlies</p>\n</blockquote>\n<p>I have it cloned on my system cus I needed the crates folder (was getting a different error before). But its using the nightly build for the actual roc command.</p>",
        "id": 409947637,
        "sender_full_name": "peeps",
        "timestamp": 1703547294
    },
    {
        "content": "<p>Oh thats weird, i think its working manually</p>",
        "id": 409947739,
        "sender_full_name": "peeps",
        "timestamp": 1703547390
    },
    {
        "content": "<p>i assumed one of the roc glue commands was throwing the error but i checked both and they work when i manually run them.</p>",
        "id": 409947877,
        "sender_full_name": "peeps",
        "timestamp": 1703547558
    },
    {
        "content": "<p>Okay so I didn't know I had to make helloweb.roc myself (its not in the repo anywhere). But i just did and its working. Cool. I still want that bash script to work tho so il play around with it to see whats up.</p>",
        "id": 409948090,
        "sender_full_name": "peeps",
        "timestamp": 1703547771
    },
    {
        "content": "<p>Maybe we made some changes and didnt update that script. Its not exactly checked in CI or anything. Also I cant remember but the glue that is generated may also have some minor tweaks by hand. I think we had an issue with generating invalid assert statements that can just be commented out.</p>",
        "id": 409951853,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1703550611
    },
    {
        "content": "<p>I see. Thanks for the help <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 409952976,
        "sender_full_name": "peeps",
        "timestamp": 1703551205
    },
    {
        "content": "<p>So I was trying to get the glue example to work and I was getting errors when trying to run the app so i just listened to the error and made the changes to the generated glue. Surprisingly, it actually allowed the app to run! Unfortunately, I got this runtime error:</p>\n<div class=\"codehilite\"><pre><span></span><code>🔨 Rebuilding platform...\nLet&#39;s do things!\nfree(): invalid pointer\nAborted\n</code></pre></div>\n<hr>\n<p>This is a sample of one of the errors i was getting prior to this (which was fixed by adding a Clone derive in 2 places):</p>\n<div class=\"codehilite\"><pre><span></span><code> Rebuilding platform...\nAn internal compiler expectation was broken.\nThis is definitely a compiler bug.\nPlease file an issue here: https://github.com/roc-lang/roc/issues/new/choose\nthread &#39;&lt;unnamed&gt;&#39; panicked at &#39;Error:\n    Failed to rebuild src/main.rs:\n        The executed command was:\n            cargo build --bin host\n        stderr of that command:\n               Compiling roc_app v1.0.0 (/home/peepo/stuff/roc/projects/roc/examples/glue/rust-platform/roc_app)\nerror[E0277]: the trait bound `RocFunction_67: Clone` is not satisfied\n  --&gt; roc_app/src/x86_64.rs:75:5\n   |\n71 | }#[derive(Clone, Debug, )]\n   |           ----- in this derive macro expansion\n...\n75 |     pub f1: RocFunction_67,\n   |     ^^^^^^^^^^^^^^^^^^^^^^ the trait `Clone` is not implemented for `RocFunction_67`\n   |\n   = note: this error originates in the derive macro `Clone` (in Nightly builds, run with -Z macro-backtrace for more info)\nhelp: consider annotating `RocFunction_67` with `#[derive(Clone)]`\n   |\n53 + #[derive(Clone)]\n54 | pub struct RocFunction_67 {\n   |\n\nFor more information about this error, try `rustc --explain E0277`.\nerror: could not compile `roc_app` (lib) due to previous error\n&#39;, crates/compiler/build/src/link.rs:1414:21\nnote: run with `RUST_BACKTRACE=1` environment variable to display a backtrace\nthread &#39;main&#39; panicked at &#39;Failed to (re)build platform.: Any { .. }&#39;, crates/compiler/build/src/program.rs:976:46\n</code></pre></div>\n<p>Roc version output: roc nightly pre-release, built from commit 613c6c4 on Di 26 Dez 2023 09:01:44 UTC</p>",
        "id": 410091535,
        "sender_full_name": "peeps",
        "timestamp": 1703642859
    },
    {
        "content": "<p>It is invalid to just clone a roc function</p>",
        "id": 410092727,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703643654
    },
    {
        "content": "<p>So you probably need to remove instead of add more clone</p>",
        "id": 410092747,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703643666
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/410092747\">said</a>:</p>\n<blockquote>\n<p>So you probably need to remove instead of add more clone</p>\n</blockquote>\n<p>Next i get this:</p>\n<div class=\"codehilite\"><pre><span></span><code>An internal compiler expectation was broken.\nThis is definitely a compiler bug.\nPlease file an issue here: https://github.com/roc-lang/roc/issues/new/choose\nthread &#39;&lt;unnamed&gt;&#39; panicked at &#39;Error:\n    Failed to rebuild src/main.rs:\n        The executed command was:\n            cargo build --bin host\n        stderr of that command:\n               Compiling roc_app v1.0.0 (/home/peepo/stuff/roc/projects/roc/examples/glue/rust-platform/roc_app)\nerror[E0599]: the method `clone` exists for struct `ManuallyDrop&lt;Op_StderrWrite&gt;`, but its trait bounds were not satisfied\n   --&gt; roc_app/src/x86_64.rs:255:69\n    |\n44  | pub struct Op_StderrWrite {\n    | ------------------------- doesn&#39;t satisfy `Op_StderrWrite: Clone`\n...\n255 |                     StderrWrite: unsafe { payload_union.StderrWrite.clone() },\n    |                                                                     ^^^^^ method cannot be called on `ManuallyDrop&lt;Op_StderrWrite&gt;` due to unsatisfied trait bounds\n    |\n   ::: /home/peepo/.rustup/toolchains/1.71.1-x86_64-unknown-linux-gnu/lib/rustlib/src/rust/library/core/src/mem/manually_drop.rs:50:1\n    |\n50  | pub struct ManuallyDrop&lt;T: ?Sized&gt; {\n    | ---------------------------------- doesn&#39;t satisfy `ManuallyDrop&lt;Op_StderrWrite&gt;: Clone`\n    |\n    = note: the following trait bounds were not satisfied:\n            `Op_StderrWrite: Clone`\n            which is required by `ManuallyDrop&lt;Op_StderrWrite&gt;: Clone`\n    = help: items from traits can only be used if the trait is implemented and in scope\n    = note: the following trait defines an item `clone`, perhaps you need to implement it:\n            candidate #1: `Clone`\nhelp: consider annotating `Op_StderrWrite` with `#[derive(Clone)]`\n    |\n44  + #[derive(Clone)]\n45  | pub struct Op_StderrWrite {\n    |\n</code></pre></div>\n<p>Similar for StdoutWrite.</p>",
        "id": 410093345,
        "sender_full_name": "peeps",
        "timestamp": 1703644070
    },
    {
        "content": "<p>Does StdoutWrite take a closure? If so, it also can't have clone (need to follow all the way up the chain). That said, not sure why it would take a closure currently. Should just be an FX function that takes a string and returns nothing.</p>",
        "id": 410100539,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703650265
    },
    {
        "content": "<p>Oh, that says op_StdoutWrite, so is probably based off of some of the earlier testing for effect interpreter stuff and not sure the current effect infrastructure?</p>",
        "id": 410100776,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703650515
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/410100776\">said</a>:</p>\n<blockquote>\n<p>Oh, that says op_StdoutWrite, so is probably based off of some of the earlier testing for effect interpreter stuff and not sure the current effect infrastructure?</p>\n</blockquote>\n<p>Im sorry but idk enough to answer these questions but like, i can share the file with you i think.<br>\n<a href=\"/user_uploads/22008/6Y5yqCKRAVG6HuKYGiAeYgHx/x86_64.rs\">x86_64.rs</a></p>",
        "id": 410101121,
        "sender_full_name": "peeps",
        "timestamp": 1703650897
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/410100776\">said</a>:</p>\n<blockquote>\n<p>Oh, that says op_StdoutWrite, so is probably based off of some of the earlier testing for effect interpreter stuff and not sure the current effect infrastructure?</p>\n</blockquote>\n<p>This is under examples/glue from the roc repo,  if that answers your question.</p>",
        "id": 410101247,
        "sender_full_name": "peeps",
        "timestamp": 1703651040
    },
    {
        "content": "<p>Ah yeah. That is early testing for the effect interpreter changes to come. So it isn't really a standard platform. We probably should put a more standard platform in the examples and move that to a testing location.</p>",
        "id": 410101922,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703651686
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/231634-beginners/topic/Roc.20as.20an.20embedded.20scripting.20language.20for.20a.20Bevy.20game/near/410101922\">said</a>:</p>\n<blockquote>\n<p>Ah yeah. That is early testing for the effect interpreter changes to come. So it isn't really a standard platform. We probably should put a more standard platform in the examples and move that to a testing location.</p>\n</blockquote>\n<p>Oh alright. Part of the reason why I wanted to try was because it was upcoming changes. I didnt want to learn anything that I was going to throw out anyway. At the moment I'm feeling pretty dissuaded, like maybe I should wait a bit before tackling Roc again.</p>",
        "id": 410102282,
        "sender_full_name": "peeps",
        "timestamp": 1703652010
    },
    {
        "content": "<p>Yeah, platforms are in a state where they are possible to make, but definitely hobbled together/require specific knowledge to make correctly. So it requires more effort to figure out the nuances.</p>",
        "id": 410178386,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1703695703
    }
]