[
    {
        "content": "<p>I'm really intrigued by Roc and I decided to try to port a Rust 2d toy game I'm building to it by implementing a platform with the 'framework' code and putting my game logic in Roc such that an exposed main function configures the game window and sets an update function to be called during rendering.</p>\n<p>I've started by trying to understand the basic-cli implementation, and there's two files: main.roc and main-glue.roc -- best I can tell there's layered abstraction happening here where main.roc is the user-facing platform code written entirely in Roc, which uses main-glue.roc which is itself another platform that actually links to Rust code implementations (types named Internal*).</p>\n<p>How does main.roc know of main-glue.roc? Is this a conventional thing or is there a bit of linkage here I am missing?</p>\n<p>BTW I've read <a href=\"https://www.roc-lang.org/platforms\">https://www.roc-lang.org/platforms</a> so far, any other required reading before embarking on this journey? <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 438176908,
        "sender_full_name": "Kyle Smith",
        "timestamp": 1715511604
    },
    {
        "content": "<p><code>main-glue.roc</code> is a workaround to get glue to generate correctly</p>",
        "id": 438185497,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1715521222
    },
    {
        "content": "<p>Aand I would add that it doesn't generate correct rust, so I normally fix it up by hand and also only use some parts of it. We had some issues recently and a bunch of basic-cli was rewritten to not use the glue parts. Basically glue is still a WIP unfortunately.</p>",
        "id": 438186231,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1715521966
    },
    {
        "content": "<p><a href=\"https://github.com/roc-lang/basic-cli/tree/refactor-host\">https://github.com/roc-lang/basic-cli/tree/refactor-host</a></p>",
        "id": 438186317,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1715522045
    },
    {
        "content": "<p>I would suggest checking out the implementation in this branch. It's laid out slightly differently to try and make it clearer the distinction between different parts.</p>",
        "id": 438186341,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1715522087
    },
    {
        "content": "<p>Thanks folks, I'll give this a look!</p>",
        "id": 438189714,
        "sender_full_name": "Kyle Smith",
        "timestamp": 1715525387
    }
]