[
    {
        "content": "<p>My basic-cli program is silently failing with an exit code of 11.<br>\nIt runs until a certain point and then just stops, no crash or errors reported.<br>\nHow can I find out more?</p>\n<p>Been trying to find the issue with dbg but haven't found the cause yet.<br>\nIt might be an infinite recursion bug, but I have no clue.<br>\nAny tips?</p>",
        "id": 439231912,
        "sender_full_name": "Musilitar",
        "timestamp": 1715955134
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"719629\">@Musilitar</span>,</p>\n<p>Usually a minimal reproducible example goes a long way - if you provide one, the likelihood of the issue getting resolved or closer to that will be exponentially higher.</p>\n<p>Without looking at the source-code, I'd suggest adding even more debug statements, in comparison to what you currently have in place (I'd put one after every single line, if that's feasible - that's the most I could suggest without access to a minimum reproducible example), but I suppose you've already added the maximum possible.</p>",
        "id": 439238558,
        "sender_full_name": "Hristo",
        "timestamp": 1715957314
    },
    {
        "content": "<p>Conventionally, exit code 11 is used to represent a segmentation fault. The last debug line in your output might give some direction regarding narrowing down where the issue might be.</p>",
        "id": 439238764,
        "sender_full_name": "Hristo",
        "timestamp": 1715957389
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"693045\">@Hristo</span> ,</p>\n<p>Yeah that makes sense, I didn't want to overcomplicate the question too soon.<br>\nI thought maybe there was a compiler flag to get more output or something.<br>\nGuess I'll try dbg'ing some more and if that doesn't work I'll come back with a code sample.</p>\n<p>Thanks for your help!</p>",
        "id": 439239574,
        "sender_full_name": "Musilitar",
        "timestamp": 1715957614
    }
]