[
    {
        "content": "<p>(this is a side-track from the error reported <a href=\"#narrow/channel/231634-beginners/topic/Eq.20ability.20for.20Dict\">here</a>) </p>\n<p>I know I am not a native English speaker, but I do like to think of myself as fluent enough <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span>. <br>\nOn that note, I don't know why this part of the sentence reads so \"weird\" to me: <code>(...) does not implement the abilities it's expected to:</code></p>\n<p>I guess maybe because in spoken English I would say \" (...)the abilities <strong>it is</strong> expected to\". I understand that \"it's\" is an abbreviation for it is. However, we also know you can't always abbreviate. The expression \"It is what it is\" would not sound right \"It's what it's\". </p>\n<p>I just cannot put a finger on why \"the abilities <strong>it's</strong> expected to\" sounds \"wrong\" to me <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span>. Am I the only one?</p>",
        "id": 513808976,
        "sender_full_name": "Fábio Beirão",
        "timestamp": 1745397295
    },
    {
        "content": "<p>Yeah \"it is\" seems better to me</p>",
        "id": 513809471,
        "sender_full_name": "Anton",
        "timestamp": 1745397434
    },
    {
        "content": "<p>I read it with a silent \"that\", as in \"does not implement the abilities <em>that</em> it's expected to\"</p>\n<p>I agree it's a slightly awkward wording</p>",
        "id": 513877417,
        "sender_full_name": "Hannes",
        "timestamp": 1745416195
    },
    {
        "content": "<p>I think I've heard Richard say on software unscripted that the elm compiler tends to have error messages in the first person from the perspective of the compiler, so maybe it could say \"does not implement the abilities I expected it to\"</p>",
        "id": 513877762,
        "sender_full_name": "Hannes",
        "timestamp": 1745416293
    },
    {
        "content": "<p>Seems like totally normal spoken English to me. Does have an implied that. Also, is a bit of a run-on sentence in vibe when written. Most likely the issue is that your brain assumes the sentence is coming to an end and then it surprises you and tacks on more. If you read it with a pause and a tack on, it reads really wrong. It has to read in one fluid go to read correctly.....this is at least my speculations</p>\n<p><code>(...) does not implement the abilities... it's expected to:</code></p>",
        "id": 513908764,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1745423706
    },
    {
        "content": "<p>Oh also, the colon is almost certainly wrong. That sentence does not suggest it would be followed by a list of things. It is a complete thought. The next sentence should be something like <code>The unimplemented abilities are:</code></p>",
        "id": 513909082,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1745423781
    },
    {
        "content": "<p>Anyway, not great wording for a written statement</p>",
        "id": 513909370,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1745423864
    }
]