[
    {
        "content": "<p>Hey all, I was looking to attempt the <a href=\"https://github.com/gunnarmorling/1brc\">1 billion rows challenge</a> with roc and since the input for this problem is pretty large (14.8GB in my case) I need to stream in the data. I looked at the <code>File.read</code> and <code>File.readBytes</code> docs and it seems they attempt to read it all in one go. Maybe I'm missing something. Is there an example of parsing large files I could look at?</p>",
        "id": 437554985,
        "sender_full_name": "Musab Nazir",
        "timestamp": 1715128972
    },
    {
        "content": "<p>I know this isn't answering your question, but just out of curiosity - did you manage to get correct answers in Roc on smaller-scale instances of the problem (my understanding is that the input size is effectively user-controlled)?</p>\n<p>I tried it some time ago, but was running into some - non-intuitive to me (without having had the time to have doven into the weeds) - floating-point rounding/truncation issues, which I couldn't dedicate the time to look into at the time.</p>\n<p>My plan was to eventually host a competition for the best Roc solution, which we could then showcase in the discussion section of the 1brc repository.</p>",
        "id": 437593989,
        "sender_full_name": "Hristo",
        "timestamp": 1715153263
    },
    {
        "content": "<p>Yeah, probably should have a way to open a file and then read a chunk (I did that in the false interpreter). Also would be really nice to have a way to just mem map a file into a roc list.</p>",
        "id": 437610578,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1715159832
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"693045\">@Hristo</span> honestly I haven't attempted a smaller scale version of the file yet. Maybe I'll try that until we get <code>File.readLine</code> in the cli platform or something similar to help with large files</p>",
        "id": 437628404,
        "sender_full_name": "Musab Nazir",
        "timestamp": 1715166867
    },
    {
        "content": "<p>I think that'd be the better approach for the time being, yes <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 437628719,
        "sender_full_name": "Hristo",
        "timestamp": 1715166996
    },
    {
        "content": "<p>Just fyi, we have an issue for this <a href=\"https://github.com/roc-lang/basic-cli/issues/205\">https://github.com/roc-lang/basic-cli/issues/205</a></p>",
        "id": 437631175,
        "sender_full_name": "Anton",
        "timestamp": 1715168112
    }
]