[
    {
        "content": "<p>Hello,</p>\n<p>I've been curious about Roc for a while and I wanted to share an observation about my first wrong impression about abilities in Roc. (I promise this isn't about typeclasses).</p>\n<p>The first time I read about <em>abilities</em> I thought it was about of cap<em>ability</em>-based programming, i.e., a kind of effect system. Other languages, like Unison, use that exact term. After reading a little bit a realized it was something unrelated (but that Roc did have managed effects <span aria-label=\"cool\" class=\"emoji emoji-1f192\" role=\"img\" title=\"cool\">:cool:</span> ).</p>\n<p>I thought this was just a personal mistake, but today on the <a href=\"https://news.ycombinator.com/item?id=38351241\">HN thread</a> I read:</p>\n<blockquote>\n<p>Yes, Koka is evidently a inspiration for Roc, which uses Perceus, in-place mutation and their effect system is called \"abilities\". Roc aims to be something like the \"practical version\" of Koka('s ideas).</p>\n</blockquote>\n<p>Clearly, I'm not the only one making this mistake.</p>\n<p>I understand that Roc chose not to call them typeclasses because they're not meant to be an all encompassing ontological soup of algebra, but I'd like to know why it didn't choose a more \"traditional\" term like <a href=\"https://en.wikipedia.org/wiki/Interface_(object-oriented_programming)\">interface or protocol</a>.</p>\n<p>Anyways, regardless term Roc chooses, it'd be nice if the reasoning for it was explained somewhere in the docs, since this is confusing to n &gt; 1 people.</p>",
        "id": 403254726,
        "sender_full_name": "Sergio Vargas",
        "timestamp": 1700518713
    },
    {
        "content": "<p>thanks for sharing!</p>\n<p>the <a href=\"https://docs.google.com/document/d/1kUh53p1Du3fWP_jZp-sdqwb5C9DuS43YJwXHg1NzETY/edit\">original proposal for the design</a> mentions the naming choice briefly under \"Avoiding the Classification Trap\"</p>",
        "id": 403262481,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1700522587
    }
]