[
    {
        "content": "<p>I finally read the details on roc lang and it sounds close to my ideal. I would like to keep watching the progress on libraries and possibly try the lang out occasionally in gitpod. Is there a checklist somewhere keeping track of what libraries are in progess and which ones haven't been started yet? (Gleam has a GitHub issue with a checklist)</p>",
        "id": 372431020,
        "sender_full_name": "kanishka",
        "timestamp": 1688515005
    },
    {
        "content": "<p>I've been trying to keep a list of interesting links <a href=\"https://github.com/lukewilliamboswell/roc-things\">in this repo</a> which might help you. I have a couple of new links from this past fortnight to add. <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 372436862,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1688517676
    },
    {
        "content": "<p>It would be cool to have a list of libraries ideas or ones that should be made. How would/could we generate that?</p>",
        "id": 372437506,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1688517897
    },
    {
        "content": "<p>Luke's repo seems like a good place for that, perhaps we should make a second .md file for library ideas. We could ask GPT4 for inspiration, have it list essential libraries for a general purpose language.</p>",
        "id": 372512772,
        "sender_full_name": "Anton",
        "timestamp": 1688547620
    },
    {
        "content": "<p>Something like gitpod seems very valuable for new contributors and people who want to try out roc. <span class=\"user-mention\" data-user-id=\"629941\">@kanishka</span> what do you think about gihub codespaces?</p>",
        "id": 372517480,
        "sender_full_name": "Anton",
        "timestamp": 1688548617
    },
    {
        "content": "<p>Whatever is simple to get going. Simple, non interactive tutorials like present are fine also</p>",
        "id": 372571640,
        "sender_full_name": "kanishka",
        "timestamp": 1688559884
    }
]