[
    {
        "content": "<p>I'm interested in learning more about the typechecker and its theory (I don't know enough to be able to contribute, I'm just curious). Is there maybe an overview documented somewhere? From my beginner point of view the type system is HM with row polymorphism, polymorphic variants, some additional layer of types for task effects tracking, and then there will be traits (abilities) for ad-hoc polymorphism... I think there probably aren't any scientific papers about Roc (yet!), but maybe there are papers that influenced Roc that I could read?</p>",
        "id": 305035513,
        "sender_full_name": "Michał Łępicki",
        "timestamp": 1666210830
    },
    {
        "content": "<p>It looks like classic polymorphic variants with all the usual flaws?</p>\n<div class=\"codehilite\"><pre><span></span><code>» foo = \\a -&gt;\n…   when a is\n…     A x -&gt; B x\n…     y -&gt; y\n…\n… bar =\n…   when foo C is\n…     B _ -&gt; &quot;ok&quot;\n…     C -&gt; &quot;ok&quot;\n… bar\n\n── UNSAFE PATTERN ──────────────────────────────────────────────────────────────\n\nThis when does not cover all the possibilities:\n\n10│&gt;        when foo C is\n11│&gt;          B _ -&gt; &quot;ok&quot;\n12│&gt;          C -&gt; &quot;ok&quot;\n\nOther possibilities include:\n\n    A _\n    _\n\nI would have to crash if I saw one of those! Add branches for them!\n</code></pre></div>",
        "id": 305038784,
        "sender_full_name": "Michał Łępicki",
        "timestamp": 1666212120
    },
    {
        "content": "<p>You are exactly right, it is HM with row polymorphism, polymorphic variants, and ad-hoc polymorphism. Effects are modeled entirely with polymorphic variants, there is nothing \"special\" there. Our model of ad-hoc polymorphism is simpler in expressiveness from most related systems. However we also have another sort of types that are not exposed to the user used to track how functions are called, and perform defunctionalization.</p>\n<p>There aren't any papers directly but the extensible records are like OCaml's, and polymorphic variants are like OCaml's but simpler (this is no <code>[&lt;]</code> constraint for variants like there is in OCaml). The model of specializing ad-hoc polymorphism (at least in the interesting ways) is described somewhat <a href=\"https://github.com/roc-lang/roc/blob/main/crates/compiler/solve/docs/ambient_lambda_set_specialization.md\">in this document in the repo</a></p>",
        "id": 305040525,
        "sender_full_name": "Ayaz Hafiz",
        "timestamp": 1666212800
    },
    {
        "content": "<p>Also, records can have optional keys (I don't know what this was what inspired by, <span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> or <span class=\"user-mention\" data-user-id=\"281543\">@Folkert de Vries</span> likely do). Roc's optional record keys mean \"polymorphic in optionality\", for example, a record type <code>{ a ? Str }</code> is not concrete, but rather a generalization of both <code>{}</code> (which does not have the record key) and <code>{ a : Str }</code>. So optional record keys have no runtime representation, and hence can only be pattern-matched with default values.</p>",
        "id": 305040958,
        "sender_full_name": "Ayaz Hafiz",
        "timestamp": 1666212981
    },
    {
        "content": "<p>that was just inspired by my wanting it for configuration records <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 305041286,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1666213156
    },
    {
        "content": "<p>by the way, i’m always excited to talk about this stuff with anyone who is interested. I also have a project that faithfully implements Roc’s polymorphic variants and ad-hoc polymorphism in much smaller core languages that may be easier to study and experiment with, if you are interested.</p>",
        "id": 305067500,
        "sender_full_name": "Ayaz Hafiz",
        "timestamp": 1666230408
    },
    {
        "content": "<p>I saw that, \"cor\", pretty cool! I appreciate putting out simpler examples, thank you!</p>",
        "id": 305084912,
        "sender_full_name": "Michał Łępicki",
        "timestamp": 1666246017
    }
]