[
    {
        "content": "<p>I have a few questions on how platforms work. From my understanding a platform is the only way a Roc app can have external side effects. I like the concept and think tasks with backpassing are an ingenious solution to handling side effects in a functional way. However relying on a single platform seems limiting.</p>\n<p>Is a rock app limited to one platform? What if I need to communicate with a database or external API, does the platform need to support that directly? What if I need PostgreSQL, MongoDB, Redis and Memcached all in one app? Having one platform match all of those requirements doesn't seem flexible.</p>",
        "id": 407299859,
        "sender_full_name": "Ryan Bates",
        "timestamp": 1702320418
    },
    {
        "content": "<p>Some general reading is at <a href=\"http://roc-lang.org/platforms\">roc-lang.org/platforms</a></p>",
        "id": 407299999,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1702320482
    },
    {
        "content": "<p>Quick answers to all of the questions:</p>\n<blockquote>\n<p>Is a rock app limited to one platform?</p>\n</blockquote>\n<p>yes.</p>\n<blockquote>\n<p>What if I need to communicate with a database or external API, does the platform need to support that directly?</p>\n</blockquote>\n<p>The hope is that the platforms can support a generic TCP and HTTP primitives and the rest can be built in roc. This will enable a lot of sharing.</p>\n<blockquote>\n<p>What if I need PostgreSQL, MongoDB, Redis and Memcached all in one app?</p>\n</blockquote>\n<p>There is already <code>roc-pg</code> that enables using Postgress just over TCP. the same could be done for all of those databases.</p>\n<blockquote>\n<p>Having one platform match all of those requirements doesn't seem flexible.</p>\n</blockquote>\n<p>I think for a number of use cases it will be common to just build a custom platform for the application. Maybe start with something more generic, but tune it to the specific extras of a use case.</p>",
        "id": 407300446,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1702320658
    },
    {
        "content": "<p>there's <a href=\"https://docs.google.com/document/d/110MwQi7Dpo1Y69ECFXyyvDWzF4OYv1BLojIm08qDTvg/edit#heading=h.cxx7dzgwu0ye\">a design</a> (currently being implemented) for how to have platform-agnostic effects!</p>",
        "id": 407300653,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1702320744
    },
    {
        "content": "<p>Thanks for the replies, glad to know this is addressed. <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 407300789,
        "sender_full_name": "Ryan Bates",
        "timestamp": 1702320819
    },
    {
        "content": "<p>Where can we find <code>roc-pg</code>?</p>",
        "id": 407322062,
        "sender_full_name": "Eelco Hoekema",
        "timestamp": 1702329741
    },
    {
        "content": "<p>nvm: <a href=\"https://github.com/agu-z/roc-pg\">https://github.com/agu-z/roc-pg</a></p>",
        "id": 407322329,
        "sender_full_name": "Eelco Hoekema",
        "timestamp": 1702329894
    }
]