[
    {
        "content": "<p>Commit \"crash section line 240 - 244\"<br>\n18b860962c077031007f96150f6367787bb194d0<br>\nin  file  <a href=\"https://github.com/salarii/peek/blob/main/regex.roc\">https://github.com/salarii/peek/blob/main/regex.roc</a></p>\n<p>this  crash  is very  annoying because  unlike in other  cases I can't figure out ways around  it : ( . I have to uncomment  for now</p>",
        "id": 403442722,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700592364
    },
    {
        "content": "<p>I'll try to take a look today</p>",
        "id": 403559292,
        "sender_full_name": "Anton",
        "timestamp": 1700647469
    },
    {
        "content": "<p>this  commit   37f0e9be0b014590b346cc75b6642938b352d78b  also crash <br>\nIt is   vicious because  it does not  inform  even that it is crashing, and it is unrelated to  previous issue</p>",
        "id": 403602903,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700663075
    },
    {
        "content": "<p>I won't be able to look at this today or tomorrow, is someone else able to help out?</p>",
        "id": 403637582,
        "sender_full_name": "Anton",
        "timestamp": 1700674479
    },
    {
        "content": "<p>I wanted to look but didn't get to it and will be travelling. Not sure I'll get a chance.</p>",
        "id": 403644948,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700677652
    },
    {
        "content": "<p>I haven't found the issue causing this segfault yet. </p>\n<p>But I do have some tips which I find help me with these kind of issues.</p>\n<ol>\n<li>I like to use type annotations it help the compiler to check the types are what I expect at various points. Even just top level definitions is really helpful, and significantly improves the error messages.</li>\n<li>I like to unit tests for my functions using <code>expect</code></li>\n<li>I find using <code>roc check</code> and working through to resolve all the warnings oftens helps lead me to a place where I see an issue.</li>\n</ol>",
        "id": 403663376,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700686195
    },
    {
        "content": "<p>The current implementation of <code>dbg</code> has been a common cause of bugs. It will soon be replaced with the <code>Inspect</code> ability which will significantly improve <code>dbg</code> stability I think.</p>",
        "id": 403663379,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700686198
    },
    {
        "content": "<p>In the below snippet you are using the <code>Character</code> tag in two different ways, one without a payload and one with.</p>\n<div class=\"codehilite\"><pre><span></span><code>getRegexTokens = \\result -&gt;\n    when result.tag is\n        Character -&gt;\n            when List.first result.parsedResult.matched is\n                Ok matched -&gt;\n                    Ok [createToken (Character matched) Once Bool.false]\n\n                Err _ -&gt; Err &quot;character  tag problem&quot;\n\n        _ -&gt;\n            Err &quot;wrong tag&quot;\n</code></pre></div>",
        "id": 403665524,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700687283
    },
    {
        "content": "<p>I'm finding it difficult to follow the types through this. I've spent some time adding annotations and looking at this, but it is a pretty big and complex. </p>\n<p>I would love to find the segfault, but I probably should move on to other things. </p>\n<p>If you  have the time and are able add more type annotations, I think you could narrow this issue down, and it would be really helpful to make an issue with a minimal reproduction of the segfault. Just keep removing code until you have a minimal example.</p>",
        "id": 403667661,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700688499
    },
    {
        "content": "<p>sorry I knew  where bug  was I spotted it myself  but I was complaining that that  application  does not report  crash  or  anything was it ok ?</p>",
        "id": 403678962,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700694875
    },
    {
        "content": "<p>clearly  I made  mistake  but that wasn't the point , I  did not expect  compiler to  show  just nothing as it is and I was reporting that</p>",
        "id": 403679199,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700695028
    },
    {
        "content": "<p>regarding  type annotation  good and bad point at the same  time, usually I don't know  what I want, so I let compiler  to  decide, additionally   I do not have  skill  to add proper types  anyway. Still  compiler  should do it's work and  provide  some  feedback about  crash  or some discrepancies.</p>",
        "id": 403679750,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700695393
    },
    {
        "content": "<p>beside that,  some  types, I am using  are complex and  to write them down it would be  painful , and I am grateful I don't have to</p>",
        "id": 403680109,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700695660
    },
    {
        "content": "<p>You might find out helpful to use <code>roc check</code> until there are 0 reported errors, and only then use <code>roc run</code>. Roc will still try to run your code when there are issues, but if it runs into one of the invalid code paths it will crash. Right now that crash message is not helpful.</p>",
        "id": 403680110,
        "sender_full_name": "Elias Mulhall",
        "timestamp": 1700695660
    },
    {
        "content": "<p>I was using  run  dev , I expect  it to show  something</p>",
        "id": 403680208,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700695718
    },
    {
        "content": "<p>because  it usually does but not this time</p>",
        "id": 403680228,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700695738
    },
    {
        "content": "<p>sorry  I messed up completely I was talking  about second  problem <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span><br>\nThx  for  tips  for   first  problem <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 403680508,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700695936
    },
    {
        "content": "<p>Sorry, I should have mentioned this additional context. I misunderstood your original question.</p>\n<p>It looks like you have found a compiler bug. The issue you are seeing is that the executable that is generated is invalid, and when executed it segfaults on your machine. </p>\n<p>You are not seeing a nice error message because it is not caused by a roc <code>crash</code> or rust <code>panic</code>. </p>\n<p>This is certainly a bug in the compiler. </p>\n<p>As Roc is still young and maturing, it is unfortunately still easy to run into these issues. </p>\n<p>In future these will be really uncommon as the compiler is battle tested against lots of different kinds of programs. To help us get there, it is really helpful when you find an issue like this to report it. This way it can be fixed, and a test added to prevent future regressions.</p>",
        "id": 403680693,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700696062
    },
    {
        "content": "<p>to be clear   first  issue I haven't solved  yet &lt;--- your tips for that is  to annotate more ??<br>\nsecond reported  issue   &lt;---  this is easy , just reported  that compiler is  silent </p>\n<p>type annotations  may help me  solve first  one?</p>\n<p>The  problem  is that when I  narrowed  down  a bit  problematic  code  it seemed to  work  only together it seems  to  fail. </p>\n<p>btw.  it is  true. In this  specific code I am using  sometimes  the  same  tag  by  name  in different  context without  warning.</p>",
        "id": 403681503,
        "sender_full_name": "Artur Swiderski",
        "timestamp": 1700696662
    }
]