[
    {
        "content": "<p>I've got an idea for a basic web app that I would like to write. It's a pretty simple CRUD app that replaces a spreadsheet for running and scoring fantasy hockey with my mates.</p>\n<p>I think it would be fun to write it using Roc, it would help test out some things and I might find issues along the way that benefit others. </p>\n<p>I would like to crowd source some architecture wisdom if possible. I've got the following idea and just wondering if I'll likely run into any major issues with this design.</p>\n<p><a href=\"/user_uploads/22008/dSj4pNMD4MdEOcOTHTT2HTKd/Screenshot-2023-11-25-at-09.47.54.png\">Screenshot-2023-11-25-at-09.47.54.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/dSj4pNMD4MdEOcOTHTT2HTKd/Screenshot-2023-11-25-at-09.47.54.png\" title=\"Screenshot-2023-11-25-at-09.47.54.png\"><img src=\"/user_uploads/22008/dSj4pNMD4MdEOcOTHTT2HTKd/Screenshot-2023-11-25-at-09.47.54.png\"></a></div><p>My goal is to keep it really simple. </p>\n<p>It doesn't need to be the most secure app, but I don't want random bots breaking things or turning my server into ransomware. </p>\n<p>It doesn't need to serve thousands of requests per second, but it would be nice if it was reliable enough that it isn't a headache to run during the season next year.</p>\n<p>I figured I'd just start building things and see how it goes, it may be easier to write a front end using Elm or React, but maybe it's also easy to just SSR everything.</p>",
        "id": 404027465,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700866123
    },
    {
        "content": "<p>You may want to add some sort of database pool to basic-webserver instead of launching a new connection to the database on every request, but otherwise, seems like this should be doable now.</p>",
        "id": 404029248,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700867436
    },
    {
        "content": "<p>I'm open to building that if that would make this better, I'm certainly in no hurry to get this done. I'll do some research and see how we might add that.</p>",
        "id": 404029393,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700867600
    },
    {
        "content": "<p>anyway, that is just an optimization, so you shouldn't need it to get this working.</p>",
        "id": 404029481,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700867676
    },
    {
        "content": "<p>a cool thing about doing server-side rendering is that you already have the tools to do everything in Roc that way <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 404030592,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1700868716
    },
    {
        "content": "<p>also yeah I have some ideas about how to make connection pooling part of the platform, such that you wouldn't need to change the code anyway (or at most swap out one function for a different one when making the connection) but I wouldn't consider that a blocker</p>",
        "id": 404030691,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1700868795
    },
    {
        "content": "<p>this is really exciting! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 404030695,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1700868801
    }
]