[
    {
        "content": "<p>I will start by the fact that I am not a big fan of JS and never used the async/await constructs in a complex real-world application, but I can tell from the fact when I have to read JS from time to time, that the approach is a mess. I saw in a few demos usage of async/await model and it was interesting to me if you want to pursue that path also. Elm uses it because it is ultimately constrained by the JS it is transpiled into, however in the case of roc you have full freedom of choice.</p>\n<p>So my question is: is there a big advantage for using a async/await approach instead of a actor-based or a similar model?</p>\n<p>Languages like go, that employ in their way the idea of passing messages around concurrent constructs seems to be very successful and from my personal experience of writing elixir in production (the processes from elixir work on same basis as actors) it seems a much better approach for designing systems and debug them.</p>",
        "id": 372573587,
        "sender_full_name": "Calancea Daniel",
        "timestamp": 1688560327
    },
    {
        "content": "<p>I think the best answer is that <code>roc</code> doesn't really have a concurrency model and it is decided by the platform.</p>\n<p>That said, we describe tasks in an async way in roc because there is no guarantee that they will be synchronous. Roc simply can not know and must pass continuations to the platform. How the platform runs after that is out of roc's control.</p>",
        "id": 372630423,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1688570608
    },
    {
        "content": "<p>As for models like actor and such, a platform definitely could be designed to support that.</p>",
        "id": 372630546,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1688570630
    },
    {
        "content": "<p>The platform could expose methods to create actors, pass messages between them, and set recovery policies.</p>",
        "id": 372631033,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1688570705
    },
    {
        "content": "<p>The individual roc actors would likely interact with those methods in an async/await style. That said, it is not strictly necessary.</p>",
        "id": 372631315,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1688570750
    },
    {
        "content": "<p>Also, in some platforms, it may be the case that roc is just defining pure functions that the platform parallelizes. So the roc app has no sense of concurrency at all.</p>",
        "id": 372631739,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1688570816
    },
    {
        "content": "<p>Currently, <code>Task</code> is a userland construct and is not needed in anyway.</p>",
        "id": 372631929,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1688570845
    },
    {
        "content": "<p>You have 2 options for returning data to a platform/requesting actions be done:</p>\n<ol>\n<li>Effects (the basis for tasks) that fundamentally are callbacks in design.</li>\n<li>Returning data directly to the platform and letting the platform act on that. Theoretically, that could be info on spawning actors and the like.</li>\n</ol>",
        "id": 372632561,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1688570952
    },
    {
        "content": "<p>This is very interesting, I will read about what represents the concept of platform, as it seemed I missed out on it.<br>\nThank you very much for the response!</p>",
        "id": 372684278,
        "sender_full_name": "Calancea Daniel",
        "timestamp": 1688582287
    },
    {
        "content": "<p>We also have a nice explanation of what a platform is on our <a href=\"https://github.com/roc-lang/roc/wiki/Roc-concepts-explained#platform\">wiki</a></p>",
        "id": 373138876,
        "sender_full_name": "Anton",
        "timestamp": 1688722113
    },
    {
        "content": "<p>I wonder how hard it would be to build a platform that's a wrapper around something like <a href=\"https://crates.io/crates/ractor\">https://crates.io/crates/ractor</a></p>",
        "id": 443156184,
        "sender_full_name": "Eric Rogstad",
        "timestamp": 1717706134
    },
    {
        "content": "<p>You would of course call it <code>roctor</code></p>",
        "id": 443156234,
        "sender_full_name": "Eric Rogstad",
        "timestamp": 1717706148
    },
    {
        "content": "<p>Interesting. Might be hard to figure out how to happily interact with the rust traits</p>",
        "id": 443164850,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717709308
    },
    {
        "content": "<p>That said, setting it up so that you have many roc \"applications\" that each define a single actor sounds quite plausible.</p>",
        "id": 443164934,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717709349
    },
    {
        "content": "<p>and could be really interesting.</p>",
        "id": 443164942,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717709353
    },
    {
        "content": "<p>So like more of a plugin setup.</p>",
        "id": 443164962,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717709363
    },
    {
        "content": "<p>Where you  have a ractor system, but any number of the actors can be defined in roc.</p>",
        "id": 443164984,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717709380
    },
    {
        "content": "<p>For a standalone platform, I guess you would just need to have a stand alone roc actor that is launched at startup.</p>",
        "id": 443165073,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717709410
    },
    {
        "content": "<p>Seems doable once we have the effect interpreter version of tasks.</p>",
        "id": 443165123,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1717709430
    },
    {
        "content": "<p>Hello everyone,</p>\n<p>I’ve been watching Richard's talks and I am fascinated by the language, especially how he markets the whole project. He describes Roc as a \"functional Go\" with simple build tools and blazing speed, though these aren’t the only aspects that make Go powerful. Personally, I think Go's main selling point is its concurrency model—simple enough for Average Joe yet powerful enough for enterprise-grade code.</p>\n<p>That said, I’m trying to understand how Roc handles concurrency. From what I’ve gathered, Roc relies on platforms that decide on the concurrency model. These platforms are hardcoded Rust programs that function like frameworks. Is that accurate, or am I missing something?</p>\n<p>I’m not well-versed in FP, but after deploying ZIO and Cats Effect services for the past three years, I’m familiar with _some_ FP concepts. One of the reasons I love ZIO is its concurrency model. It allows you to run stream computations and pure functions in parallel with a simple API call, like ZIO#withParallelism. Additionally, ZIO provides built-in concurrent data structures such as Hubs, Queues, and Streams.</p>\n<p>I’m curious—how do these concepts translate to Roc? Does it offer similar abstractions or tools for concurrency, or is its approach fundamentally different? </p>\n<p>Unrelated to my previous question but from what I’ve gathered, the Roc compiler will not be bootstrapped and will always depend on Rust. I assume the same would apply to platforms as well. Do you think this could cause issues if the language grows significantly? It seems that extending the language or writing frameworks for it would require knowing Rust as well, which doesn’t feel very ergonomic to me.</p>",
        "id": 485840477,
        "sender_full_name": "Mehmet",
        "timestamp": 1733229694
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"784771\">@Mehmet</span>,</p>\n<blockquote>\n<p>Roc relies on platforms that decide on the concurrency model</p>\n</blockquote>\n<p>That is correct</p>\n<blockquote>\n<p>These platforms are hardcoded Rust programs that function like frameworks.</p>\n</blockquote>\n<p>Platforms can use any language that supports the C ABI, we have platforms in zig, rust, go... Interop with python, java, javascript is also possible. There are some important differences with frameworks, take a look <a href=\"https://www.roc-lang.org/platforms\">here</a> for the full explanation.</p>",
        "id": 485845647,
        "sender_full_name": "Anton",
        "timestamp": 1733230889
    },
    {
        "content": "<blockquote>\n<p>Roc compiler will not be bootstrapped and will always depend on Rust.</p>\n</blockquote>\n<p>Always is a long time but yes, most of it will be written in Rust for the foreseeable future</p>",
        "id": 485846299,
        "sender_full_name": "Anton",
        "timestamp": 1733231034
    },
    {
        "content": "<blockquote>\n<p>It seems that extending the language or writing frameworks for it would require knowing Rust as well</p>\n</blockquote>\n<p>Things like a web framework can use existing platforms like basic-webserver and be written in pure Roc. In case your framework is a game engine, it seems easier to connect an existing game engine with Roc compared to writing it from scratch <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 485847347,
        "sender_full_name": "Anton",
        "timestamp": 1733231271
    },
    {
        "content": "<p>Can you share some specific use cases that require \"extending the language\"?</p>",
        "id": 485848713,
        "sender_full_name": "Anton",
        "timestamp": 1733231618
    },
    {
        "content": "<blockquote>\n<p>It allows you to run stream computations and pure functions in parallel with a simple API call, like ZIO#withParallelism.</p>\n</blockquote>\n<p>Running effects (e.g. multiple web requests) in parallel will be possible, I'm not sure about pure functions.</p>",
        "id": 485849724,
        "sender_full_name": "Anton",
        "timestamp": 1733231896
    },
    {
        "content": "<blockquote>\n<p>built-in concurrent data structures such as Hubs, Queues, and Streams.</p>\n</blockquote>\n<p>I think we've talked about that in the past but I don't recall any specifics</p>",
        "id": 485849856,
        "sender_full_name": "Anton",
        "timestamp": 1733231937
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"361169\">Anton</span> <a href=\"#narrow/channel/231634-beginners/topic/What.20is.20the.20concurrency.20model/near/485848713\">said</a>:</p>\n<blockquote>\n<p>Can you share some specific use cases that require \"extending the language\"?</p>\n</blockquote>\n<p>A cunning Go programmer can directly contribute to the language's development, but to contribute to Roc's development, one also has to learn Rust.</p>",
        "id": 485849961,
        "sender_full_name": "Mehmet",
        "timestamp": 1733231967
    },
    {
        "content": "<p>Yes, this is likely to stay this way. With Rust we can achieve maximum performance.</p>",
        "id": 485850318,
        "sender_full_name": "Anton",
        "timestamp": 1733232064
    },
    {
        "content": "<p>Contributing aside, it's definitely our intention that people do not need to learn a language like Rust to get things done with Roc.</p>",
        "id": 485850887,
        "sender_full_name": "Anton",
        "timestamp": 1733232214
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"361169\">Anton</span> <a href=\"#narrow/channel/231634-beginners/topic/What.20is.20the.20concurrency.20model/near/485847347\">said</a>:</p>\n<blockquote>\n<p>Things like a web framework can use existing platforms like basic-webserver and be written in pure Roc.</p>\n</blockquote>\n<p>My main concern is more about marketing than engineering. Nowadays, if you look at Scala job listings, they specifically ask whether you know ZIO, cats-effect, pekko, or any other shiny tool that type astronauts have recently come up with. Scala's market share is already small and now you have different competing ecosystems, which makes it hard to pitch Scala to a CTO. On the other hand, Go provides a default concurrency model and a good web stack with net/http.</p>\n<p>A web application also needs to connect to a message bus or a database, which requires some concurrency model as well. From what I gather, basic-webserver should also provide these features so that when they are combined, the effects can just click. This feels like exactly what Scala did wrong in the past because someone will inevitably come up with a competing platform in the future. I am probably missing something and definitely need to delve deeper into the documentation.</p>",
        "id": 485852863,
        "sender_full_name": "Mehmet",
        "timestamp": 1733232731
    },
    {
        "content": "<p>So do I understand correctly that the core of the problem is that; with our current setup we encourage too many ways to do the same thing?</p>",
        "id": 485854267,
        "sender_full_name": "Anton",
        "timestamp": 1733233119
    },
    {
        "content": "<p>Yup, at least this is what it feels like after taking a look for couple of hours. </p>\n<p>Although don't get me wrong, I hope you wonderful people succeed in this endeavor. Functional programming truly needs a marketable language that doesn’t cost a fortune to run on the cloud unlike JVM-based languages, and is simple enough to make it pragmatic for both recruitment and cost considerations.</p>\n<p>When I was at uni, it felt like Scala was that language. However, ten years later, it feels like Scala has failed. I just hope Roc will learn lessons from languages like Haskell, Scala and OCaml on why they failed to gain mainstream attention, whereas Go succeeded.</p>",
        "id": 485855309,
        "sender_full_name": "Mehmet",
        "timestamp": 1733233392
    },
    {
        "content": "<p>I was also using Scala ten years ago :)</p>",
        "id": 485868198,
        "sender_full_name": "Anton",
        "timestamp": 1733236427
    },
    {
        "content": "<blockquote>\n<p>we encourage too many ways to do the same thing?</p>\n</blockquote>\n<p>It's definitely something to watch out for although my current feeling is that platforms help prevent that. It seems likely that people will build new things on top of an existing well tested platform or modify it instead of starting from scratch.</p>",
        "id": 485870749,
        "sender_full_name": "Anton",
        "timestamp": 1733237013
    }
]