[
    {
        "content": "<p>so ive tried solving some aoc stuff in roc and compared to haskell having to convert to and from a list is kind of boilerplate-y, are there any specific reasons for strings not just being a distinct list of bytes</p>",
        "id": 480094903,
        "sender_full_name": "froge",
        "timestamp": 1730484192
    },
    {
        "content": "<p>For AOC I think most people should just directly use a <code>List U8</code> and not attempt to use strings at all. Fundamentally, a <code>Str</code> is guaranteed to be valid utf-8. That adds extra constraints and restrictions. On top of that, it is exceptionally easy to misuse unicode and have subtle bugs. We have a partially built unicode library that enables more powerful operations over strings, but in general, we are trying to push people towards correct design when using strings and that often requires extra thought and constraints.</p>",
        "id": 480124566,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1730499094
    },
    {
        "content": "<p>For AOC, everything is ASCII. So it has no need to be a string at all.</p>",
        "id": 480124698,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1730499162
    },
    {
        "content": "<p>We should really make an advent of code example that demonstrates the best practices, I've made <a href=\"https://github.com/roc-lang/examples/issues/216\">an issue</a>.</p>",
        "id": 480204779,
        "sender_full_name": "Anton",
        "timestamp": 1730542479
    },
    {
        "content": "<p>I had the same question many times. If Str is an alias for List U8, all arguments for correct design would still be true. The Unicode package could still exist and work on Str/List U8.</p>\n<p>There are many similar functions in the List and Str packets, that could be unified, if both types would be the same. And with the planned small list optimisation, there would be no different.</p>",
        "id": 480328814,
        "sender_full_name": "Oskar Hahn",
        "timestamp": 1730659051
    },
    {
        "content": "<p>Yeah, the only difference really is that str will be guaranteed to be correctly encoded utf-8</p>",
        "id": 480329011,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1730659263
    },
    {
        "content": "<p>It also attempts to restrict a few apis to make it more clear when someone might be using said utf-8 incorrectly. But currently those apis differences are pretty minimal</p>",
        "id": 480329084,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1730659327
    }
]