[
    {
        "content": "<p>I'm trying to run a roc program (outside of repl). I saw on the installation page that i can use a zig based platform, but the examples i've downloaded are, apparently, rust based. Is there anywhere i can learn about how to use a zig based platform? or more on working with platforms in general? it's not clear to me how to get a hello world program running at the moment without downloading rust . Really there's a lot more about platforms that I don't understand, aside from the general gist of the idea behind them.</p>",
        "id": 410904348,
        "sender_full_name": "Gregory Walker",
        "timestamp": 1704228848
    },
    {
        "content": "<p>On <a href=\"https://github.com/lukewilliamboswell/roc-awesome?tab=readme-ov-file\">https://github.com/lukewilliamboswell/roc-awesome?tab=readme-ov-file</a> I have linked to a few Zig platforms. The most minimal example is probably the Zig platform switching example <a href=\"https://github.com/roc-lang/roc/tree/main/examples/platform-switching/zig-platform\">https://github.com/roc-lang/roc/tree/main/examples/platform-switching/zig-platform</a></p>",
        "id": 410907154,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1704230299
    },
    {
        "content": "<p>Roc WASI is also a Zig platform <a href=\"https://github.com/ostcar/roc-wasi-platform\">https://github.com/ostcar/roc-wasi-platform</a></p>",
        "id": 410907481,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1704230518
    },
    {
        "content": "<p>For general information there is the guide <a href=\"https://www.roc-lang.org/platforms\">https://www.roc-lang.org/platforms</a></p>",
        "id": 410907730,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1704230645
    },
    {
        "content": "<p>To add to that: If you just want to use a platform, you should not have to care about the language of the platform.</p>",
        "id": 410914595,
        "sender_full_name": "Fabian Schmalzried",
        "timestamp": 1704234497
    },
    {
        "content": "<p>At the moment if you are using a platform locally it will rebuild from source everytime, unless you use <code>--prebuilt-platform</code>. If you use from a URL package then it will default to use the archive for your system architecture.</p>",
        "id": 410918545,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1704236892
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"559412\">Fabian Schmalzried</span> <a href=\"#narrow/stream/231634-beginners/topic/Zig.20platforms/near/410914595\">said</a>:</p>\n<blockquote>\n<p>To add to that: If you just want to use a platform, you should not have to care about the language of the platform.</p>\n</blockquote>\n<p>Thank you! I'm not quite sure what you mean by \"should not have to care about the language of the platform\". If a platform is, loosely, a sort of runtime, don't i need to know what the requirements of that runtime are, up to and including what language they might depend on? what's the best way to do that?</p>",
        "id": 410918722,
        "sender_full_name": "Gregory Walker",
        "timestamp": 1704237016
    },
    {
        "content": "<p>The platform is normally compiled to machine code for each architecture and distributed as a package, so end users can just use a URL and they do not need any tooling for the platform's host language installed, as roc will compile the users app and link with the platform to build the final executable.</p>",
        "id": 410919086,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1704237273
    },
    {
        "content": "<p>So you only need host tooling, e.g. cargo for a rust platform, or zig for a zig platform if you are developing a platform or would like to build the platform from source.</p>",
        "id": 410919248,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1704237383
    }
]