[
    {
        "content": "<p>I have been loving working my way through the backlog of the Software Unscripted podcast! Can't believe I didn't know of it sooner. Thought it'd be fun to have a thread in here to chat about it if there isn't one already.</p>\n<p><span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> thanks for hosting this, have really enjoyed it.</p>\n<p>Most recently listened to the episode with José Valim. Massive respect to him, I feel like he's been such an excellent steward of that language and community. Excited to see what they can do with static types.</p>",
        "id": 367683499,
        "sender_full_name": "Logan Lowder",
        "timestamp": 1687189249
    },
    {
        "content": "<p>thanks! I just recorded a follow-up episode with Jose, hopefully will be out in a month or so</p>",
        "id": 367701395,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1687193504
    },
    {
        "content": "<p>Can't wait. Huge fan of the podcast as well. Have you thought about inviting anyone in from the Koka team? So maybe <a href=\"https://www.microsoft.com/en-us/research/people/daan/\">https://www.microsoft.com/en-us/research/people/daan/</a> or <a href=\"https://webspace.science.uu.nl/~swier004/\">https://webspace.science.uu.nl/~swier004/</a>?</p>",
        "id": 371307422,
        "sender_full_name": "Uttam Narsu",
        "timestamp": 1688160185
    },
    {
        "content": "<p>I don't know any of them, but I'm totally open to it...I wonder if anyone knows them and could make an intro?</p>",
        "id": 371318692,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1688164452
    },
    {
        "content": "<p>Just listened to the episode with Jean Yang. It feels like all of the folks I've been following in software for the past few years end up on your guest list, Richard! Stellar guest line up! <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span> </p>\n<p>You guys shared some really challenging thoughts about how we want to create these \"worlds\" of software without chaos or disorder and maybe the right move is moving to the \"era of nuance\", trying to make things better where we can. Like 2nd law of thermodynamics. We can't escape entropy or Murphy's Law. </p>\n<p>Richard shared a thought about feeling like your role is to try to bring ideas from academia into industry and practical use. That resonates with me so much and is something that really draws me to Roc. Wanting to make something that's not just a marginally better programming language but something that at least attempts to make some significant steps forward and push the industry forward. </p>\n<p>Great stuff! Please keep up the podcast!</p>",
        "id": 372030451,
        "sender_full_name": "Logan Lowder",
        "timestamp": 1688394867
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/stream/306878-off-topic/topic/Software.20Unscripted/near/371318692\">said</a>:</p>\n<blockquote>\n<p>I don't know any of them, but I'm totally open to it...I wonder if anyone knows them and could make an intro?</p>\n</blockquote>\n<p>I reached out to see if there's any interest. I don't know them but worth a try!</p>",
        "id": 375020237,
        "sender_full_name": "Uttam Narsu",
        "timestamp": 1689271827
    },
    {
        "content": "<p>I just listened to the most recent episode with Troels Henriksen. What a great interview. He’s clearly brilliant, fun to hear him derive in real time the implications of Richard’s statements! <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 396754619,
        "sender_full_name": "Johan Lövgren",
        "timestamp": 1697376866
    },
    {
        "content": "<p>I wanted to hear more from him so I also listened to his episode on the array cast <a href=\"https://spotify.link/bVN8qHe2UDb\">https://spotify.link/bVN8qHe2UDb</a></p>",
        "id": 396758748,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1697380169
    },
    {
        "content": "<p>Casey Muratori not knowing about ORMs made my day. Must be nice <span aria-label=\"smiling face with tear\" class=\"emoji emoji-1f972\" role=\"img\" title=\"smiling face with tear\">:smiling_face_with_tear:</span></p>",
        "id": 405454843,
        "sender_full_name": "Agus Zubiaga",
        "timestamp": 1701473988
    },
    {
        "content": "<p>His reaction was so amazing lol</p>",
        "id": 405454932,
        "sender_full_name": "John Murray",
        "timestamp": 1701474034
    },
    {
        "content": "<p>Related to the latest podcast:</p>\n<p>So for mojo, I would say that the language essentially is c++ in python clothing. The python is jit compiled instead of interpreted. You can add a lot of extra typing to the python to make it static, templated, etc. Compared to C++ I would say the templating is a lot cleaner. They also have much nicer support for simd and things of that nature to make code faster. </p>\n<p>Lastly, mojo has the magic of MLIR. With that I mean, it is easy to extend the language with mlir primitives and then use those primitives. As a direct example, Tensorflow has an mlir dilect that can compile to gpu. You could use that directly in mojo to build a graph and then run it through tensorflow on the gpu. This gives a huge level of extra potential power and flexibility to the language.</p>",
        "id": 405464571,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1701478936
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"489294\">Agus Zubiaga</span> <a href=\"#narrow/stream/306878-off-topic/topic/Software.20Unscripted/near/405454843\">said</a>:</p>\n<blockquote>\n<p>Casey Muratori not knowing about ORMs made my day. Must be nice <span aria-label=\"smiling face with tear\" class=\"emoji emoji-1f972\" role=\"img\" title=\"smiling face with tear\">:smiling_face_with_tear:</span></p>\n</blockquote>\n<p>I also feel very vindicated after having struggled with CSS so much at work. “Nobody knows how to center things!” <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 405533250,
        "sender_full_name": "Johan Lövgren",
        "timestamp": 1701521547
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"595873\">Johan Lövgren</span> <a href=\"#narrow/stream/306878-off-topic/topic/Software.20Unscripted/near/405533250\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"489294\">Agus Zubiaga</span> <a href=\"#narrow/stream/306878-off-topic/topic/Software.20Unscripted/near/405454843\">said</a>:</p>\n<blockquote>\n<p>Casey Muratori not knowing about ORMs made my day. Must be nice <span aria-label=\"smiling face with tear\" class=\"emoji emoji-1f972\" role=\"img\" title=\"smiling face with tear\">:smiling_face_with_tear:</span></p>\n</blockquote>\n<p>I also feel very vindicated after having struggled with CSS so much at work. “Nobody knows how to center things!” <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>\n</blockquote>\n<p>I feel this on a deep level. I work in react native and even when you get the right flex styles on everything sometimes you just run into a Yoga bug that has been around for 5 years so you need to so some insane workaround that makes no sense.</p>",
        "id": 405556505,
        "sender_full_name": "Pearce Keesling",
        "timestamp": 1701541888
    },
    {
        "content": "<p>Disappointed at my ranking, but it mostly tracks  <a href=\"/user_uploads/22008/2IOMf1sc6LRjigqYKCgOiz7N/F115DFE2-2B12-4574-853C-8EB59AEFFF6B.jpg\">F115DFE2-2B12-4574-853C-8EB59AEFFF6B.jpg</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/2IOMf1sc6LRjigqYKCgOiz7N/F115DFE2-2B12-4574-853C-8EB59AEFFF6B.jpg\" title=\"F115DFE2-2B12-4574-853C-8EB59AEFFF6B.jpg\"><img src=\"/user_uploads/22008/2IOMf1sc6LRjigqYKCgOiz7N/F115DFE2-2B12-4574-853C-8EB59AEFFF6B.jpg\"></a></div>",
        "id": 407797647,
        "sender_full_name": "David Dunn",
        "timestamp": 1702496499
    },
    {
        "content": "<p>I’ll just have to listen more from now <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 407797957,
        "sender_full_name": "David Dunn",
        "timestamp": 1702496621
    },
    {
        "content": "<p>Sweet, I didn't know this was on Spotify, I've listened to a couple of podcasts before after hearing about it on this forum but always just downloaded the file from the website.</p>",
        "id": 407815016,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1702503684
    },
    {
        "content": "<p>It's also in the Apple Podcasts catalogue which means you can listen to it in apps like <a href=\"https://overcast.fm/\">Overcast</a> (which is my favorite podcast player).</p>",
        "id": 407997274,
        "sender_full_name": "Agus Zubiaga",
        "timestamp": 1702571165
    },
    {
        "content": "<p>and google podcast for us android users that don't use spotify.</p>",
        "id": 407999496,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1702571733
    },
    {
        "content": "<p>AntennaPod is also very good on android and open source too :)</p>",
        "id": 408144827,
        "sender_full_name": "Anton",
        "timestamp": 1702631636
    },
    {
        "content": "<p>AntennaPod also had a yearly summary, all generated on device with no telemetry! </p>\n<p>Software Unscripted was number 5 for me this year, but that's because I listened to the whole back catalogue, probably won't be so high next year unless Richard releases another 100 or so episodes in 2024 <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>\n<p><a href=\"/user_uploads/22008/0mPwnb3eMbUR8Zu2U3I05_KH/1146b010-45a3-4fb8-864e-ad6c78daf54e.png\">1146b010-45a3-4fb8-864e-ad6c78daf54e.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/0mPwnb3eMbUR8Zu2U3I05_KH/1146b010-45a3-4fb8-864e-ad6c78daf54e.png\" title=\"1146b010-45a3-4fb8-864e-ad6c78daf54e.png\"><img src=\"/user_uploads/22008/0mPwnb3eMbUR8Zu2U3I05_KH/1146b010-45a3-4fb8-864e-ad6c78daf54e.png\"></a></div>",
        "id": 408161750,
        "sender_full_name": "Hannes",
        "timestamp": 1702637261
    },
    {
        "content": "<p>Love that José has come back for three episodes now. I learned about Roc through him promoting the first elixir static typing episode. What a guy.</p>",
        "id": 411535254,
        "sender_full_name": "Elias Mulhall",
        "timestamp": 1704571759
    },
    {
        "content": "<p>I guess this is the topic for Software Unscripted discussions? I just listened to the Roc reverse interview, and am part-way through the Go one, and I have so many comments. I'm a — I guess somewhat expert? — Go programmer, working at Square, with a pretty huge Go monorepo.</p>",
        "id": 411632741,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704662108
    },
    {
        "content": "<p>I'm curious what your thoughts are! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 411632766,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1704662141
    },
    {
        "content": "<p>re: Go package management over-indexing on performance. It's actually trying to avoid falling into 3-SAT, which is very easy to do. Most package managers essentially have a custom solver for the 3-SAT equivalent problem. Go's packaging design is carefully avoiding that.</p>",
        "id": 411632855,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704662204
    },
    {
        "content": "<p>re: tabs vs spaces for indent and copy/pasting code: in Go, since it's not whitespace-sensitive, you can just past and reformat. IIUC, Roc indentation can indicate scope (or is it usually just laid out to look like that?). So, especially for the copy/paste situation, you might need to decide on your own solution based on first principles.</p>",
        "id": 411632987,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704662336
    },
    {
        "content": "<p>In a large monorepo, you get a <em>lot</em> of vendored code. <code>du -h</code> in our monorepo's <code>vendor</code> folder gives me a terrifying 740M!</p>",
        "id": 411633020,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704662383
    },
    {
        "content": "<p>That does bring the usual problems of \"I want to upgrade package X, but now I have to worry about matching versions of gRPC, protobufs, the GCP libraries, etc.\"  It's not as bad as in Java, but with an undisciplined use of third-party code, it definitely becomes something to think about.</p>",
        "id": 411633103,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704662452
    },
    {
        "content": "<p>The rest of the monorepo is less than twice that size, if I exclude the protobufs</p>",
        "id": 411633490,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704662831
    },
    {
        "content": "<p>Our <code>go.mod</code> has 5 <code>replace</code> directives, three related to protobufs (Square was very early with protobufs, and made a bunch of custom changes, which I have not yet in 8 years here managed to expunge.)  All 5 are to Square-specific forks of a corresponding open-source package.</p>",
        "id": 411633584,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704662943
    },
    {
        "content": "<p>Although they get less mention, in my personal, non-work Go, I find \"workspaces\" (<code>go work …</code>) essential: it lets you define a workspace below a set of directories, and then specify which of those directories to use instead of the real, remote version.<br>\nIn my \"blog\" workspace, for my personal blog, I have checkouts of <code>goldmark</code>, <code>goldmark-pikchr</code>, and <code>hugo</code>, since I had to do some custom stuff to make Hugo support pikchr diagrams (unfortunately currently broken, and never got enough \"tuits\" as the Perl folks used to say.)</p>",
        "id": 411633711,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704663104
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>blog🐚 ~/gh/blog ls\nbin             go.work         go.work.sum     goldmark        goldmark-pikchr hugo            zellyn.com\nblog🐚 ~/gh/blog cat go.work\ngo 1.20\n\nuse (\n    ./goldmark\n    ./goldmark-pikchr\n    ./hugo\n)\n</code></pre></div>",
        "id": 411633765,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704663136
    },
    {
        "content": "<p>(Off-topic, that \"<span aria-label=\"shell\" class=\"emoji emoji-1f41a\" role=\"img\" title=\"shell\">:shell:</span>\" is because I'm using <a href=\"https://github.com/cashapp/hermit\">hermit</a>, which is great. I've started using it in all my personal repos, since it dramatically improves the \"coming back to this thing in 3 years and how do I even get things compiling again?\" experience. I should write a roc package for hermit.)</p>",
        "id": 411633884,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704663267
    },
    {
        "content": "<p>One last comment on versioning. Go is very committed to the idea that v2 is a completely different package, with a different name. This does _not_ work well for projects that want to create versions every three months (I thought k8s was like that, but its github says it's on v1.26.12, so <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span>), nor projects that want to number releases based on year/month or similar things.</p>",
        "id": 411634238,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704663618
    },
    {
        "content": "<p>There are also some kind of subtleties around import paths and version tags and github repos that I really should just go read an internalize once and for all, because they get annoying to constantly not quite understand.</p>",
        "id": 411634294,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704663684
    },
    {
        "content": "<p><code>go.mod</code> also allows v0 \"pseudo-version numbers\", which look like <code>v0.0.0-20170915032832-14c0d48ead0c</code> — they encode the shasum and the… datetime, it looks like?</p>",
        "id": 411634404,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704663798
    },
    {
        "content": "<p>fwiw, the complaining about Go package management that I've seen mostly stems from how the team handled communication with the community: some folks had invested a huge amount of effort into independently developing a traditional solver-based solution, and Russ's more dramatic re-think, while very much in Go's style, kinda came out of nowhere. Opinions and hurt feelings abound, or abounded — it's receding into the past now.</p>",
        "id": 411634620,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704663995
    },
    {
        "content": "<p>“Functional Programming in Go” thoughts…</p>\n<p>One of the reasons it's harder to teach recursion than for loops, even when they compile down to the same CPU steps, is that that shape of tail-call recursion that emulates a loop is a slightly degenerate case of recursion: it's recursion, used to loop. But it's taking a much more powerful machine (recursion) and using an instance of it to do something simple (repeat these steps). Recursion can also do things that go down multiple paths, like graph search or tree traversal, or even fibonacci numbers.</p>",
        "id": 411652860,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704677792
    },
    {
        "content": "<p>Of course another reason is that recursion just seems to be hard for people to understand, in the same way that people find proof by induction a bit mind-bending. Repeating steps is something you do every day in normal life.</p>",
        "id": 411652968,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704677870
    },
    {
        "content": "<p>re: hot-code reloading. I love the idea that since all state is in the platform, you can easily swap out roc code! Definitely a win for functional programming. Go <em>does</em> have plugins (<a href=\"https://pkg.go.dev/plugin\">link</a>), so it should be possible to segregate, say, handler functionality, out into a plugin, and hot-reload that. Indeed, it appears someone has built a thing that does that: <a href=\"https://github.com/edwingeng/hotswap\">https://github.com/edwingeng/hotswap</a></p>",
        "id": 411653150,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704677991
    },
    {
        "content": "<p>re: goroutines and grow-on-demand stacks. IIRC (and it's been a while), the fact that Go has weird stacks and non-standard calling conventions means that it's not that hard to host c libraries in Go — I <em>think</em> the cffi code makes sure the stack is \"big enough\" and then does a little translation of calling conventions around the handoff — but (unless things have changed) means that it's difficult to host Go code inside of something with C calling conventions and stacks, etc. Even when Google was considering building a giant sidecar-like thing, or inside-out sidecar-like thing (\"envelope\"), I believe for Go, the plan was to have Go own <code>main</code>, then hand off to the envelope code and then have it call back into Go. (Although it's been a while… my memory is fuzzy.)</p>",
        "id": 411653448,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704678181
    },
    {
        "content": "<p>One question I'd be interested in your thoughts on, <span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> … y'all were talking about Functional Programming quite a bit, and Lane mentioned teaching Functional Programming in Python. Indeed, that was more or less how I learned Functional Programming, a very long time ago at Georgia Tech: the first few weeks of Lisp were limited to purely functional constructs (old-school lisp cons lists lend themselves to that anyway), and then as the quarter went on we settled on a \"you can be destructive inside a function, but you should still make it look purely functional to the outside world\". That seemed to be what Lane was using \"Functional Programming\" to mean. As a mostly observer, who has never used a purely functional programming language \"in anger\", that although that sort of completely <em>technically</em> defines what Functional Programming means, it's really only one half of the story.</p>\n<p>The other part seems to be a mix of very powerful higher-level tools for thought and programming: (a) sometimes I'll see Haskell folks talking about Functors and Lifting and Monads, and it seems very powerful: like they're reasoning at one level higher in abstraction than normal imperative programming would lead you to, like they've applied some kind of \"Lift\" operator on their abstractions (b) there's a sort of inside-out turning about that seems to happen in functional programming. The I/O or Task paradigms seem to do this. Although Roc code goes to some lengths to make Task-based code look sequential, under the covers, it's callbacks all the way down, and it's a slightly mind-bending blend of \"my response to this input is a set of instructions to run that'll depend on the next input\" kind of thing. It _may_ be analagous to the explicit inside-outing that seems to happen in finger trees and similar immutable data structures. All I know is that I look at monad code in Haskell, or Task code in Roc (a bit, although it <em>really</em> does look like imperative code <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span>), or, say, JSON-parsing code in Elm (or really any parsing code in any of them), and I feel like there's a level of familiarity/comfort with some kind of inside-outing going on that I just don't quite grok.</p>\n<p>I find the first paragraph above to be easy to get, as a fairly skilled (imperative) programmer. I've mostly bounced off the second one.</p>",
        "id": 411654513,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704678836
    },
    {
        "content": "<p>As an example, in the episode y'all did about gradually rewriting your backend Ruby code into Haskell, you mentioned a re-architecting that put the database queries at the start, and then the logic, and finally resulted in a set of mutations to apply. That feels <em>very</em> analagous to the overall way I/O or Tasks work in functional programming languages, and seems like something only a Haskell programmer would have come up with. (It also sounded like a <em>very</em> powerful and lovely abstraction/pattern, and I would gladly listen to like five podcasts in a row if they went deep into the concept until I could grok it enough to apply it elsewhere!)</p>",
        "id": 411654752,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1704678993
    },
    {
        "content": "<p>Wow. Hearing “Combo boxes” brought me back to hacking afternoons after a middle school day</p>",
        "id": 413144367,
        "sender_full_name": "Agus Zubiaga",
        "timestamp": 1705408401
    },
    {
        "content": "<p><a href=\"/user_uploads/22008/GSHU3STcFLQQr2ZvpHMPH7ED/Screenshot-2024-01-23-at-13.30.16.png\">Screenshot-2024-01-23-at-13.30.16.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/GSHU3STcFLQQr2ZvpHMPH7ED/Screenshot-2024-01-23-at-13.30.16.png\" title=\"Screenshot-2024-01-23-at-13.30.16.png\"><img src=\"/user_uploads/22008/GSHU3STcFLQQr2ZvpHMPH7ED/Screenshot-2024-01-23-at-13.30.16.png\"></a></div>",
        "id": 417445815,
        "sender_full_name": "Zeljko Nesic",
        "timestamp": 1706016639
    },
    {
        "content": "<p>Bug Report: Typo in the Spotify description of the last episode</p>",
        "id": 417445919,
        "sender_full_name": "Zeljko Nesic",
        "timestamp": 1706016680
    },
    {
        "content": "<p>Should be \"no squeal databsaes\" <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 417606233,
        "sender_full_name": "Emil Kloeden",
        "timestamp": 1706088913
    },
    {
        "content": "<p>If you found today's episode a bit hard to follow, here is the paper and a talk <a href=\"https://dl.acm.org/doi/10.1145/3591260\">https://dl.acm.org/doi/10.1145/3591260</a>  <a href=\"https://www.youtube.com/live/F3z39M0gdJU?feature=shared&amp;t=3545\">https://www.youtube.com/live/F3z39M0gdJU?feature=shared&amp;t=3545</a></p>",
        "id": 418354493,
        "sender_full_name": "Chris Wesseling",
        "timestamp": 1706304985
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> Maybe you can add them to the show notes? Hmmm I guess not, there are multiple references to the show notes from several podcast platforms. Mutating them would break referential integrity.</p>",
        "id": 418355099,
        "sender_full_name": "Chris Wesseling",
        "timestamp": 1706305296
    },
    {
        "content": "<p>In that talk, Roc was mentioned, btw</p>",
        "id": 418355290,
        "sender_full_name": "Chris Wesseling",
        "timestamp": 1706305397
    },
    {
        "content": "<p>thanks, good idea!</p>",
        "id": 418355559,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1706305546
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"677275\">@Chris Wesseling</span> is this an area of interest to you?</p>",
        "id": 418355581,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1706305560
    },
    {
        "content": "<p>It's a very cool subject. I just added HM type inference to the most ugly Lisp known to the internet (JsonLogic). Worked through the papers, and implemented in Python and Typescript.</p>",
        "id": 418355803,
        "sender_full_name": "Chris Wesseling",
        "timestamp": 1706305684
    },
    {
        "content": "<p>oh nice! The defunctionalization papers?</p>",
        "id": 418355875,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1706305715
    },
    {
        "content": "<p>And actually listening to your podcast has helped me solve a problem.</p>",
        "id": 418355925,
        "sender_full_name": "Chris Wesseling",
        "timestamp": 1706305735
    },
    {
        "content": "<p>that's awesome! What was the problem?</p>",
        "id": 418355966,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1706305763
    },
    {
        "content": "<p>Supporting variadic functions. JsonLogic has some operations that can have different arity. So I solved it in the parser by monomorphisation.</p>",
        "id": 418356129,
        "sender_full_name": "Chris Wesseling",
        "timestamp": 1706305867
    },
    {
        "content": "<p>very cool!</p>",
        "id": 418356161,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1706305897
    },
    {
        "content": "<p>I add versions of the functions to the context when I encounter them</p>",
        "id": 418356195,
        "sender_full_name": "Chris Wesseling",
        "timestamp": 1706305918
    },
    {
        "content": "<p>But getting nice error messages is hard.</p>",
        "id": 418356359,
        "sender_full_name": "Chris Wesseling",
        "timestamp": 1706306002
    },
    {
        "content": "<p>Mine were more like Purescript, when I really want Elm errors  <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 418356657,
        "sender_full_name": "Chris Wesseling",
        "timestamp": 1706306166
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span>, big fan of your podcast here. A friend and me think, that John A De Goes (@jdegoes on <a href=\"http://X.com\">X.com</a>), the head behind ZIO (great and innovative effect system  for Scala, with big focus on Dev Experience) and <a href=\"http://Golem.cloud\">Golem.cloud</a> (invincible cloud platform around WASM, written in Rust)  and You would be an perfect much for a podcast episode, what do You think?</p>\n<p>Here a great episode with him:<br>\n<a href=\"https://podcasters.spotify.com/pod/show/happypathprogramming/episodes/85-Scala--Rust--and-Durable-Computing-with-John-De-Goes-e29ca1s/a-a66th96\">https://podcasters.spotify.com/pod/show/happypathprogramming/episodes/85-Scala--Rust--and-Durable-Computing-with-John-De-Goes-e29ca1s/a-a66th96</a></p>",
        "id": 418367440,
        "sender_full_name": "A. Richter",
        "timestamp": 1706313347
    },
    {
        "content": "<p>thanks, I'll give it a listen!</p>",
        "id": 418368111,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1706313797
    },
    {
        "content": "<p>where's the issue for lambda set defunctionalization? and can you also send a link to your O-Camel implementation of it?</p>",
        "id": 419915432,
        "sender_full_name": "Christian Queyrouze",
        "timestamp": 1707162226
    },
    {
        "content": "<p>great question! I don't think we have a GitHub issue for it (unless <span class=\"user-mention\" data-user-id=\"454654\">@Ayaz Hafiz</span> knows of one?) but here's his OCaml implementation: <a href=\"https://github.com/ayazhafiz/cor\">https://github.com/ayazhafiz/cor</a></p>",
        "id": 419918076,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1707163179
    },
    {
        "content": "<p>This is the meta-issue <a href=\"https://github.com/roc-lang/roc/issues/5969\">https://github.com/roc-lang/roc/issues/5969</a></p>",
        "id": 420085002,
        "sender_full_name": "Elias Mulhall",
        "timestamp": 1707236731
    },
    {
        "content": "<p>I really enjoyed yesterday’s episode with Greg Wilson. I resonated a lot with the industrial design analogy.</p>\n<p>It’s super cool that he wants to do a book with Roc and I would love to participate! <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 421568809,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1707964283
    },
    {
        "content": "<p>Yeah, it was a very intriguing talk</p>",
        "id": 421581347,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1707973442
    },
    {
        "content": "<p>Lots to think about in terms of design and verification of design</p>",
        "id": 421581408,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1707973457
    },
    {
        "content": "<p>I really enjoyed that episode. Would love to contribute a chapter, or at least the start of a thing.</p>",
        "id": 421799919,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1708066018
    },
    {
        "content": "<p>I had not heard of Greg Wilson until earlier this month when I listened to the latest CoRecursive episode in which he told his story. I recommend that one as well to anyone who liked the Software Unscripted episode, he talks about some similar topics.</p>",
        "id": 422288276,
        "sender_full_name": "Johan Lövgren",
        "timestamp": 1708367288
    },
    {
        "content": "<p>Are there show notes for the Software Unscripted podcast? If so, where can I find them?</p>",
        "id": 424097355,
        "sender_full_name": "IsaacDynamo",
        "timestamp": 1709236730
    },
    {
        "content": "<p>there aren't any <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 424106085,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1709239966
    },
    {
        "content": "<p>is there something in particular you're looking for?</p>",
        "id": 424106109,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1709239977
    },
    {
        "content": "<p>Some books were mentioned and a website, but I could re-listen and make notes.</p>",
        "id": 424118592,
        "sender_full_name": "IsaacDynamo",
        "timestamp": 1709244955
    },
    {
        "content": "<h2>Quorum @ 8:00</h2>\n<p>The World's First Evidence Oriented Programming Language <br>\n<a href=\"https://quorumlanguage.com/\">https://quorumlanguage.com/</a></p>\n<p>@ 19:38<br>\nIndustrial design</p>\n<ul>\n<li>Does this thing serve the purpose it was build for?</li>\n<li>Is it ascetically pleasing?</li>\n<li>Is it designed in a way to make it easy to manufacturer and maintain?</li>\n</ul>\n<h2>Beautiful Code @ 23:10</h2>\n<p>How do the experts solve difficult problems in software development? In this unique and insightful book, leading computer scientists offer case studies that reveal how they found unusual, carefully designed solutions to high-profile projects. You will be able to look over the shoulder of major coding and design experts to see problems through their eyes.<br>\n<a href=\"https://www.amazon.com/Beautiful-Code-Leading-Programmers-Practice/dp/0596510047\">https://www.amazon.com/Beautiful-Code-Leading-Programmers-Practice/dp/0596510047</a></p>\n<p>@ 29:30 <br>\nEvery useful programming language has a certain amount of grit, you can sweep it in the corners, but you cannot get it out of the room.<br>\nBy <a href=\"https://en.wikipedia.org/wiki/Robin_Milner\">https://en.wikipedia.org/wiki/Robin_Milner</a> (no source)<br>\n<a href=\"https://en.wikipedia.org/wiki/The_law_of_conservation_of_misery\">https://en.wikipedia.org/wiki/The_law_of_conservation_of_misery</a></p>\n<h2>The Architecture of Open Source Applications @ 42:53</h2>\n<p>Architects look at thousands of buildings during their training, and study critiques of those buildings written by masters. In contrast, most software developers only ever get to know a handful of large programs well—usually programs they wrote themselves—and never study the great programs of history. As a result, they repeat one another's mistakes rather than building on one another's successes.<br>\n<a href=\"https://aosabook.org/en/index.html\">https://aosabook.org/en/index.html</a></p>\n<p>Current design can only be explained by \"challenge and response\" of the past.<br>\n<a href=\"https://en.wikipedia.org/wiki/Arnold_J._Toynbee#Challenge_and_response\">https://en.wikipedia.org/wiki/Arnold_J._Toynbee#Challenge_and_response</a></p>\n<h2>Software Design by Example @ 46:00</h2>\n<p>The best way to learn design in any field is to study examples, and the most approachable examples are ones that readers are already familiar with. These lessons therefore build small versions of tools that programmers use every day to show how experienced software designers think.<br>\n<a href=\"https://third-bit.com/sdxpy/\">https://third-bit.com/sdxpy/</a></p>\n<p>@ 46:48 <br>\nTake apart applications, look at how there designed to give you a vocabulary for larger scale design.</p>\n<p>@ 52:07 <br>\nLearn from experts arguing the specifics.</p>\n<p>@ 55:44 <br>\nWe need to get better in reading code and understanding what design is embodied in it. And how the code is manufactured.</p>",
        "id": 424414904,
        "sender_full_name": "IsaacDynamo",
        "timestamp": 1709388873
    },
    {
        "content": "<p>These are really helpful notes, thank you for sharing.</p>",
        "id": 424556935,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1709511988
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> would it be possible to create a Software Unscripted \"stream\" (I think that's the right name in Zulip) so that each episode could get its own conversation?</p>",
        "id": 427775806,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1710869043
    },
    {
        "content": "<p>Oh, the \"converations\" are called \"Topics\" apparently <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 427776436,
        "sender_full_name": "Zellyn Hunter",
        "timestamp": 1710869217
    },
    {
        "content": "<p>I'm ok with it, but I'm curious what others think</p>",
        "id": 427782667,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1710871207
    },
    {
        "content": "<p>I'm good with trying it, if it gets so active that it's distracting we could find a new home for it.</p>",
        "id": 427784687,
        "sender_full_name": "Anton",
        "timestamp": 1710871931
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"306878\" href=\"/#narrow/stream/306878-off-topic/topic/Software.20Unscripted\">#off-topic &gt; Software Unscripted</a> by <span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span>.</p>",
        "id": 427790702,
        "sender_full_name": "Notification Bot",
        "timestamp": 1710874029
    },
    {
        "content": "<p>discovered the pod through Roc and been really enjoying it. great combinations of good guests, good vibes, and good questions</p>",
        "id": 431574376,
        "sender_full_name": "nat-418",
        "timestamp": 1712338365
    },
    {
        "content": "<p>thanks, so glad you're enjoying it! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 431579002,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1712340179
    },
    {
        "content": "<p>been working through the back catalog of episdoes and I too recall keybase. recently I have been exploring the Codeberg organization and found this interesting project : <a href=\"https://keyoxide.org/\">https://keyoxide.org/</a></p>",
        "id": 434446291,
        "sender_full_name": "nat-418",
        "timestamp": 1713567007
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/stream/429850-Software-Unscripted-Podcast/topic/casual.20conversation/near/431579002\">said</a>:</p>\n<blockquote>\n<p>thanks, so glad you're enjoying it! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>\n</blockquote>\n<p>just listened this morning to your episode about vim etc. have you tried neovim? with neovim's tree-sitter integration you can have the structural movements etc. you were talking about wanting</p>",
        "id": 434737171,
        "sender_full_name": "nat-418",
        "timestamp": 1713789299
    },
    {
        "content": "<p>the last time neovim was my main editor, it didn't ship with tree-sitter integration - but I've recently been using Zed as my main Rust editor and it has tree-sitter built in! I'm really enjoying it <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 434756890,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1713794204
    },
    {
        "content": "<p>Been binging the podcast while driving to/from work, amazing conversations and guests. I've become more aware about a lot of topics I never knew about and definitely my favorite software/programming podcast. Also the intro/outro music is awesome.</p>\n<p>Would love to see a convo with ginger bill, since I've heard the issues with providing array programming built-in to not support general operator overloading mentioned and Odin has it. I remember hearing about how to use Arena's for something specific in a text editor, he'd probably be able to answer that too since Odin's <code>virtual.Arena</code> is common. Odin has a very pragmatic design philosophy, reminds me of Go. Also could mention using your own language at work. I believe (might be wrong) he said his team has a 700k+ LOC Odin codebase integrated with 500k+ LOC of other languages. I think there is a lot of interesting conversation there.</p>",
        "id": 448845597,
        "sender_full_name": "Der Schutz",
        "timestamp": 1720012246
    }
]