[
    {
        "content": "<p>After listening to you mention Serenity in the episode with Juan Vuletich on Cuis, I heard you mention not really knowing that much. One of the things I don't think you're aware of is that there's actually a programming language as part of the Serenity project as well, with the goal being to eventually replace C++ as the main language of implementation for the OS. I think a conversation between you and him would be really interesting.</p>\n<p>Also, just wanted to add I've really been enjoying the podcast. You always seem to find great guests and interesting topics.</p>",
        "id": 446649788,
        "sender_full_name": "Bobbias",
        "timestamp": 1719244043
    },
    {
        "content": "<p>I actually assumed that Andreas had already been a guest on Software Unscripted, so I was surprised when I found out he hadn't <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> I think I was thinking of an episode of the CoRecursive podcast. </p>\n<p>I completely agree, SerenityOS/Ladybird are fascinating projects and Andreas is an excellent speaker <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 446760531,
        "sender_full_name": "Hannes",
        "timestamp": 1719282173
    },
    {
        "content": "<p>I had the same thought. Sometimes it's hard to keep track of who has been on where :)</p>",
        "id": 446760578,
        "sender_full_name": "Bobbias",
        "timestamp": 1719282220
    },
    {
        "content": "<p>does anyone know Andreas? Could you make an introduction?</p>",
        "id": 446850681,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1719314079
    },
    {
        "content": "<p>I'm a member of the Serenity discord server, but I've only been lurking there.</p>",
        "id": 446923296,
        "sender_full_name": "Bobbias",
        "timestamp": 1719330751
    }
]