[
    {
        "content": "<p>In the most recent episode \"Building video editing software\" the topic of non square pixels comes up at around 32:00. </p>\n<p>I was hoping something interesting would come from that, but sadly both Richard and Andrew both didn't really understand it enough to comment. </p>\n<p>Well I worked in broadcast tv! So I'm here to enlighten y'all about the horrors of pixel aspect ratios.</p>\n<p>Let's get one thing out of the way, the shape of non square pixels is rectangular. I laughed out loud when Richard asked 'what's their shape' clearly imagining like octagonal pixels or something. Well I'm sorry to be a kill joy, but it's a rectangle. </p>\n<p>I want to acknowledge first up, your intuition of \"wow that seems really stupid, monitors can't stretch their pixels!\" Is entirely correct. <br>\nBut let's not forget that in the days of CRTs, monitors didn't really have pixels and the little dots could be any aspect ratio you'd like. Yeah, it does cause blurriness, but it's not a huge issue for non text content.</p>\n<p>You may also remember monitors used to be a completely different shape. Good old 4:3.</p>\n<p>Well imagine you want to suddenly change from broadcasting everything in 4:3 to broadcasting 16x9. Oh wait, literally all your extremely expensive broadcast equipment is designed to output a 4:3 signal at a specific resolution. Everything from the camera to the muxes and demuxes, the oscilloscopes, the antenna all works on this specific signal.<br>\nSo you could replace everything and that is specifically designed to handle a specific resolution... Or maybe you could just cheat, squish your 16x9 into 4:3 and then unsqish it at the other end. <br>\nBut now you have unsqished 4:3 into 16x9 so your pixels are no longer square.</p>\n<p>Hence pixel aspect ratios. </p>\n<p>I would be 99% sure anamorophic films also have rectangular pixels. Because animorophic lenses squeeze a wide image and then you digitally desqueeze it. </p>\n<p>I'm far from being an expert, but I hope this is enlightening. </p>\n<p>PS:<br>\nOne of the coolest things I did while working in news was debugging an issue with subtitles where I was using an oscilloscope to view that analog video signal looking for the pulse that denotes the start of the subtitle section of the \"header\" that is sent with every frame of video. <br>\nThat's what the overscan/underscan setting on you tv exists to cop off, that way you do t have weird little dots of data at the top of your picture.</p>",
        "id": 491250949,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1735545309
    },
    {
        "content": "<blockquote>\n<p>Well I worked in broadcast tv! So I'm here to enlighten y'all about the horrors of pixel aspect ratios.</p>\n</blockquote>\n<p>I feel like I am about to be scarred, but I shall read on</p>",
        "id": 491300517,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1735575299
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"651372\">Eli Dowling</span> <a href=\"#narrow/channel/429850-software-unscripted-podcast/topic/I.20can.20explain.20non.20square.20pixels!/near/491250949\">said</a>:</p>\n<blockquote>\n<p>Let's get one thing out of the way, the shape of non square pixels is rectangular. I laughed out loud when Richard asked 'what's their shape' clearly imagining like octagonal pixels or something. Well I'm sorry to be a kill joy, but it's a rectangle. </p>\n</blockquote>\n<p>hahaha that makes way more sense <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span></p>",
        "id": 491305588,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1735578063
    },
    {
        "content": "<p>I was actually thinking about like old CRT displays where the corners of the pixels are rounded at the edges if you look closely enough, and maybe somehow software was taking that into account?</p>",
        "id": 491305644,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1735578107
    }
]