[
    {
        "content": "<p>G'day all, just wanted to let you know we've merged the <a href=\"https://github.com/roc-lang/roc/pull/8548\"><code>roc build</code> PR</a> which has some nice upgrades in it. </p>\n<p>Just note that <strong>this is a breaking change for the platforms</strong> as we introduce a new header section.</p>\n<p>I have upgraded the zig template and made a new pre-release here <a href=\"https://github.com/lukewilliamboswell/roc-platform-template-zig/releases/tag/0.5\">https://github.com/lukewilliamboswell/roc-platform-template-zig/releases/tag/0.5</a> </p>\n<p>Note: theres a problem with <code>roc check</code> on an app using a URL package (local using relative paths doesn't have any issue) where it doesn't resolve the platform imports correctly. We decided to merge this PR anyway to prevent further merge conflicts and we are confident we can fix this smaller issue quickly. </p>\n<p>If you're interested this is what the new <code>platform/main.roc</code> looks like for the zig template platform. We have a \"targets\" section which specifies how roc should link the platform and app together. The platform author provides everything pre-built in object files or static libraries for each supported target, and also tells roc where to find these files in the URL package (once unbundled). This removes a lot of hardcoded details from linking and lays the foundation for roc building other non-exectuable binaries like shared libraries (eg WASM modules).</p>\n<div class=\"codehilite\"><pre><span></span><code>platform &quot;&quot;\n    requires {} { main! : List(Str) =&gt; Try({}, [Exit(I32)]) }\n    exposes [Stdout, Stderr, Stdin]\n    packages {}\n    provides { main_for_host! : &quot;main_for_host&quot; }\n    targets: {\n        files: &quot;targets/&quot;,\n        exe: {\n            x64mac: [&quot;libhost.a&quot;, app],\n            arm64mac: [&quot;libhost.a&quot;, app],\n            x64musl: [&quot;crt1.o&quot;, &quot;libhost.a&quot;, app, &quot;libc.a&quot;],\n            arm64musl: [&quot;crt1.o&quot;, &quot;libhost.a&quot;, app, &quot;libc.a&quot;],\n            x64win: [&quot;host.lib&quot;, app],\n            arm64win: [&quot;host.lib&quot;, app],\n        }\n    }\n</code></pre></div>\n<p>With these changes you can now cross-compile to a linux musl target (x64musl or arm64musl) from any system (as long the platform supports it) by adding a <code>--target</code> flag. For example <code>roc build --target=x64musl path/to/app.roc</code> will produce a fully statically linked <code>app</code> executable that you can transfer to an x64 linux machine and run.</p>",
        "id": 562780886,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1765308869
    },
    {
        "content": "<p><code>roc check</code> issue fixed in <a href=\"https://github.com/roc-lang/roc/pull/8600\">https://github.com/roc-lang/roc/pull/8600</a></p>",
        "id": 562799354,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1765314573
    }
]