[
    {
        "content": "<p>Hi all,</p>\n<p><a href=\"https://github.com/roc-lang/roc/issues/6894\">#6894</a> has just been merged! It fixes a major performance issue in Roc related to lists of refcounted things (e.g. <code>List Str</code>, <code>Dict Str I64</code>, <code>List (List U8)</code>, <code>Set Str</code>, etc). This PR can lead to code executing multiple 1000s of times faster by skipping <code>O(n)</code> refcounting of all list elements.</p>\n<p>For the most part, this change won't break anything. That said, platform effects that use lists of refcounted things will likely break until the platforms are updated. For example, <a href=\"https://www.roc-lang.org/packages/basic-cli/Dir#list\">Dir.list</a> in basic cli. So just a warning if you build from source on <code>main</code>.</p>\n<p>For those who just use nightlies, the plan is to skip a few nightlies as we merge a few other breaking changes and get all the core platforms up to date. So you won't see the benefits of this change for a bit.</p>\n<p>Otherwise, if you notice any crashes or memory leaks, please let us know.</p>\n<p>Enjoy the perf gains!</p>",
        "id": 451251057,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1720925146
    },
    {
        "content": "<p>This sounds fantastic.</p>\n<p>I don't understand, what exactly I have to do as a platform author. For example, here is the Go-code, which handles Roc lists: <a href=\"https://github.com/lukewilliamboswell/roc-glue-code-gen/blob/main/package/go-builtins/roc_std.go\">https://github.com/lukewilliamboswell/roc-glue-code-gen/blob/main/package/go-builtins/roc_std.go</a></p>\n<p>Is there an explanation, how the new refcounting works?</p>",
        "id": 451326271,
        "sender_full_name": "Oskar Hahn",
        "timestamp": 1720938939
    },
    {
        "content": "<p>I was thinking about sharing this video -- Brendan gave an awesome overview in a previous online meetup, <a href=\"https://drive.google.com/file/d/1uhxZ8vRJ_4a-RPccTGN8CsB5yWLjmdD2/view?usp=sharing&amp;t=2495\">here is the link to the time</a></p>",
        "id": 451326506,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1720939150
    },
    {
        "content": "<p>Thx. This will help to get started</p>",
        "id": 451338000,
        "sender_full_name": "Oskar Hahn",
        "timestamp": 1720949188
    }
]