[
    {
        "content": "<p>Just wanted to let everyone know that I just updated <a href=\"https://lukewilliamboswell.github.io/roc-parser/\">the documentation for roc-parser</a>. </p>\n<p>Thank you for the feedback from AoC, I really appreciate it. </p>\n<p>If anyone finds anything that could be improved, please raise an issue.</p>",
        "id": 405602495,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1701578313
    },
    {
        "content": "<p>Wow. I did not know this documentation existed. Maybe you could add a link to the readme on <a href=\"https://github.com/lukewilliamboswell/roc-parser\">https://github.com/lukewilliamboswell/roc-parser</a></p>",
        "id": 405602636,
        "sender_full_name": "Oskar Hahn",
        "timestamp": 1701578441
    },
    {
        "content": "<p>I tried to include examples for most of the usual suspects. You should be able to copy-paste the examples and they will work. </p>\n<p>We have discussed previously a design for enabling expectations in doc comments to be actually tests, but that isn't implemented yet. So these are included as tests in the <code>String</code> module.</p>",
        "id": 405602689,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1701578497
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"496321\">@Oskar Hahn</span> thats great feedback, will do</p>",
        "id": 405602747,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1701578528
    },
    {
        "content": "<p>I've been loving this library. I was just using it this morning for the Advent of Code. The examples in the documentation has helped a lot to use the library. I'm having trouble with the final composition of the parser, but I'll check if someone else has encountered a similar problem before opening a thread.</p>",
        "id": 406050230,
        "sender_full_name": "Chris Duncan",
        "timestamp": 1701780910
    },
    {
        "content": "<p>New release of <a href=\"https://github.com/lukewilliamboswell/roc-parser/releases/tag/0.4\">roc-parser 0.4.0</a>, primarily to update for changes with string interpolation.</p>",
        "id": 412643512,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1705105724
    },
    {
        "content": "<p>Documentation is great, and the keep and skip functions are very well named. I used to write parsers in haskell and until today I thought I would forever miss the &lt;$&gt;, &lt;$ and $&gt; operators, but now I think those operators are needlessly confusing and esoteric notation. It's also lovely that the examples I've seen are done without using &lt;- Very well thought out. Very well done. <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 416626116,
        "sender_full_name": "Andrew C",
        "timestamp": 1705602108
    },
    {
        "content": "<p>Glad to hear your enjoying using it. The skip and keep idea came from <span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> and I love it too!</p>",
        "id": 416639804,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1705607804
    }
]