[
    {
        "content": "<p>When the host calls a Roc function in parallel, is there a way to do arena allocations?</p>\n<p>For example, if many web requests are handled at the same time in parallel, each handler calls <code>roc_alloc</code>. As far as I know, there is no way to now, which call to <code>roc_alloc</code> is triggered by which request. So when a request is finished, there is no way to know, what to free. You can not create one arena for each call.</p>\n<p>Is there something I don't know about that could solve this?</p>\n<p>If not, would it be possible and in the scope of Roc to pass around a \"context-pointer\"? That would be an usize-value (could be 0, could be a pointer to something). It would be an argument to any function exported by Roc and would internally be past around with any function call. This would be nontransparent to the Roc language, so the application author does not know about it. But this context would be past to the host on every \"host\"-call. So the signature of <code>roc_alloc</code> would be <code>(context: usize,  size usize, alignment int)</code>. The same for every other function like <code>roc_realloc</code> <code>roc_dealloc</code>,  <code>roc_panic</code>,  <code>roc_dbg</code>, and all Effect/Task functions.</p>\n<p>This would give the host the possibility to add anything into this pointer. For example an allocator.</p>\n<p>If there  currently is nothing do distinct the calls from Roc to the host of parallel calls: Is this something you would consider?</p>",
        "id": 436122799,
        "sender_full_name": "Oskar Hahn",
        "timestamp": 1714418821
    },
    {
        "content": "<p><a href=\"https://github.com/roc-lang/roc/issues/6382\">https://github.com/roc-lang/roc/issues/6382</a></p>",
        "id": 436131257,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1714421781
    },
    {
        "content": "<p>Would this help in this use case?</p>",
        "id": 436131303,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1714421798
    },
    {
        "content": "<p>yeah we want to switch to that design!</p>",
        "id": 436133731,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1714422701
    },
    {
        "content": "<p>(more details in the issue)</p>",
        "id": 436133759,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1714422711
    },
    {
        "content": "<p>as a workaround, you can do it right now by having the host use a threadlocal to store which arena to use, and have <code>roc_alloc</code> read from that (and then change it whenever switching to work on a different request handler)</p>",
        "id": 436133978,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1714422792
    },
    {
        "content": "<p>I did miss this issue. This sounds even better and would solve the problem for me.</p>\n<p>The workaround does not work in go, since go does not have threadlocal. The goroutines get past around between all threads.</p>\n<p>I will be patience and wait, until this <a href=\"https://github.com/roc-lang/roc/issues/6382\">#6382</a> is implemented.</p>",
        "id": 436140787,
        "sender_full_name": "Oskar Hahn",
        "timestamp": 1714425311
    },
    {
        "content": "<p>ah good to know!</p>",
        "id": 436143312,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1714426227
    }
]