[
    {
        "content": "<p>Hi! I'm musing about using Roc as a way to let users extend an existing application. Specifically, in my case the application is a database written in Rust and it would be cool if users could define their own custom query logic using a pure language. Roc fits the \"pure\" bill, but I'm not sure its platform concept supports the use case too.</p>\n<p>My current thinking is that the user would somehow provide the Roc code to the database application, which would then compile it using a custom platform into wasm, and then invoke the wasm code to transform queried data.</p>\n<p>Does it seem like Roc would fit that bill? Are there any existing projects that attempt something similar?</p>",
        "id": 481481806,
        "sender_full_name": "teskje",
        "timestamp": 1731175879
    },
    {
        "content": "<p>Seems like that could work to me :)<br>\nI think I remember people talking about a wasm \"pipeline\" like this before, but I don't know of any implementations.</p>",
        "id": 481482637,
        "sender_full_name": "Anton",
        "timestamp": 1731176448
    },
    {
        "content": "<p>Sure, I think roc would be a good idea <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>\n<p>Here's a super simple example using native</p>\n<p><a href=\"https://github.com/lukewilliamboswell/roc-plugin-experiment-rust\">https://github.com/lukewilliamboswell/roc-plugin-experiment-rust</a></p>",
        "id": 481491084,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1731183250
    },
    {
        "content": "<p>Here's an older template for WASI</p>\n<p><a href=\"https://github.com/lukewilliamboswell/roc-platform-template-wasi\">https://github.com/lukewilliamboswell/roc-platform-template-wasi</a></p>",
        "id": 481491117,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1731183290
    },
    {
        "content": "<p>You should know that platform dev can be a little challenging at the moment, thinfs are still in development and changing and there's not a lot of documentation.</p>\n<p>But I'm happy to try and help people learn more. I've been tinkering away on various platforms trying to learn as I go.</p>",
        "id": 481491258,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1731183393
    },
    {
        "content": "<p>Yeah, I noticed the lack of documentation and am fully prepared to dig through source code. Just wanted to make sure the thing I'm trying to do actually makes sense first :)</p>\n<p>Thanks for the examples, that's exactly what I was looking for!</p>",
        "id": 481491609,
        "sender_full_name": "teskje",
        "timestamp": 1731183695
    }
]