[
    {
        "content": "<p>I'm very interested in trying Roc for gamedev, but this obviously needs a platform for each game engine. I know <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span> is working on a graphical platform, but I suspect that's still pretty for from being ready to handle everything a game platform requires. </p>\n<p>I recently remembered <a href=\"https://wasm4.org/\">WASM4</a>, it's a fantasy console similar to PICO-8, but instead of using Lua, it uses any language that can target WASM. I think this would be a great way to try Roc for small game projects because the engine can handle all the input, graphics and sound, and it has an intentionally small scope which will keep the Roc API simple.</p>\n<p>I've started working on a platform in Zig based on the existing WASM platform, but I have pretty much no Zig experience, so I'm going to need a lot of help!</p>",
        "id": 403272563,
        "sender_full_name": "Hannes",
        "timestamp": 1700527713
    },
    {
        "content": "<p>First thing I need help with: running the WASM platform from the Roc repo!</p>\n<p>I'm getting this error when I try to build the app:</p>\n<div class=\"codehilite\"><pre><span></span><code>❱ roc build --target=wasm32 examples/platform-switching/rocLovesWebAssembly.roc\n🔨 Rebuilding platform...\nAn internal compiler expectation was broken.\nThis is definitely a compiler bug.\nPlease file an issue here: https://github.com/roc-lang/roc/issues/new/choose\nthread &#39;&lt;unnamed&gt;&#39; panicked at &#39;cannot find `glue.zig`. Check the source code in find_zig_glue_path() to show all the paths I tried.&#39;, crates/compiler/build/src/link.rs:123:5\nnote: run with `RUST_BACKTRACE=1` environment variable to display a backtrace\nthread &#39;main&#39; panicked at &#39;Failed to (re)build platform.: Any { .. }&#39;, crates/compiler/build/src/program.rs:1021:46\n</code></pre></div>",
        "id": 403272891,
        "sender_full_name": "Hannes",
        "timestamp": 1700527834
    },
    {
        "content": "<p>Yeah, that is a bug. If you run it with <code>cargo run -- build --target=wasm32 ...</code> I think that is a workaround. The issue is that the roc cli is hardcoded to look for a glue.zig file and it is located relative to the executable. This definitely isnt needed, its just an interim workaround that is ready to be removed from roc cli.</p>\n<p>For building a wasm platform I highly reccomend using zig and a build.zig similar to my <a href=\"https://github.com/lukewilliamboswell/basic-graphics\">https://github.com/lukewilliamboswell/basic-graphics</a> platform. That will be a much nicer experience.</p>",
        "id": 403277140,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700529422
    },
    {
        "content": "<p>I'm definitely keen to help out with this project, sounds like fun!!</p>",
        "id": 403277278,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700529484
    },
    {
        "content": "<p>Also I have a super simple WASM platform which may be helpful to look at as it <a href=\"https://github.com/lukewilliamboswell/roc-serverless\">https://github.com/lukewilliamboswell/roc-serverless</a></p>",
        "id": 403277741,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700529704
    },
    {
        "content": "<p>Thanks Luke, I suspected this was something that had a workaround, those links will definitely be super helpful <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>",
        "id": 403277837,
        "sender_full_name": "Hannes",
        "timestamp": 1700529728
    },
    {
        "content": "<p>That's a really fun idea. Also, yeah, the wasm build target is currently very hobbled together. Like roc has great wasm code gen (including dev backend) , but the wasm linking and platform generation is basically hard coded to some zig stuff that just happened to be convenient at the time</p>",
        "id": 403277869,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700529752
    },
    {
        "content": "<p>Depending on how wasm4 works, it may be worth starting by just compiling roc to a wasm library and then loading it from a wasm4 application. That may be easier than full platform setup at the current moment.</p>",
        "id": 403277976,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700529816
    },
    {
        "content": "<p>Aside, maybe this could be a good project for us to look at for cleaning up wasm linking and making it work more generically.</p>",
        "id": 403278193,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700529910
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/302903-Writing-a-platform/topic/Help.20writing.20a.20Wasm4.20platform/near/403277976\">said</a>:</p>\n<blockquote>\n<p>compiling roc to a wasm library and then loading it from a wasm4 application</p>\n</blockquote>\n<p>Sorry for my ignorance about wasm, I haven't heard of wasm libraries. It sounds like it could be possible to compile all the Roc code into a wasm library, then import that into a Zig program that is compiled to a <code>.wasm</code> file, is that right?</p>",
        "id": 403279898,
        "sender_full_name": "Hannes",
        "timestamp": 1700530794
    },
    {
        "content": "<p>So my understanding is we would compile all roc code to a <code>.wasm</code> file then make zig generate a <code>.wasm</code> that links to and includes the roc <code>.wasm</code> file. So give zig control of the final build process to get around all of the hacky stuff we do when roc controls the build process.</p>",
        "id": 403280116,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700530914
    },
    {
        "content": "<p>Not sure how much time I'll have, but I'll look at making a really basic wrapper to show what I mean. That should at least be a base that could be built off of.</p>",
        "id": 403280279,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700530987
    },
    {
        "content": "<p>The platform build stuff is really easy I thknk using build.zig. The part of this project that I think will be a challenge to get started is the interface between roc and Zig. We dont have a zig-glue.roc spec yet, so you have to roll these by hand. <span class=\"user-mention\" data-user-id=\"343810\">@Brendan Hansknecht</span> was potentially going to look at implementing a basic init, update, render for the roc-graphics-mach experiment. Maybe this would be a better place to do that. This looks like a more mature game engine to target. I'm not confident I can build the zig-roc interface, but once we have that it should be pretty easy to add more capability. I could make a bare bones platform pretty quickly, with the build process etc just copying what I already have elsewhere. But without the integration we'd have to bundle a full json implementation from zig in wasm and use json between roc and zig which is less than ideal. It might be OK to get us started though.</p>",
        "id": 403280834,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700531303
    },
    {
        "content": "<p>yeah, I think it would be cool to make this work. I do agree that zig glue would help a lot. I may be one of the few peoples that will happily write glue code by hand and who has the knowledge to generally do so correctly-ish.</p>",
        "id": 403283638,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700532696
    },
    {
        "content": "<p>Working on this or working on zig glue would both probably be good things for me to do/to stream.</p>",
        "id": 403284202,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700532941
    },
    {
        "content": "<p>I just noticed that wasm4 supports rust first class. I assumed that it would just be a c project, but it has wrappers for tons of languages. If we want this platform to build robust and working soon, I would advise just making it with rust. Given rust glue already exists, it would be much more seamless to make a really nice platform. That said, pushing zig stuff is also important. So that could be the focus instead. Just depends on goals.</p>",
        "id": 403299036,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700540310
    },
    {
        "content": "<p>I spent an hour or so this afternoon looking at it with zig, and what I thought would be really straightforward isnt. I think this is a good project to sort out the roc build process, wasm32 makes this interesting. But totally agree, if we can use rust it would be much quicker to flesh out a working platform for actual gamedev.</p>",
        "id": 403305617,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700544444
    },
    {
        "content": "<p>I made a start on this, got something basic that doesn't work. <a href=\"https://github.com/lukewilliamboswell/roc-wasm4-games\">https://github.com/lukewilliamboswell/roc-wasm4-games</a></p>",
        "id": 403332607,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700557348
    },
    {
        "content": "<p>So the issue I'm facing is that Roc expects things like roc_malloc to be provided by the wasm runtime, however this isn't provided by the default <code>w4 run myCartridge.wasm</code></p>",
        "id": 403332934,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700557449
    },
    {
        "content": "<p>So, I'm not sure it will be possible to make a platform for this without forking the wasm4 runtime and providing the functions that Roc requires to be provided.</p>",
        "id": 403333158,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700557552
    },
    {
        "content": "<p>This will be the same issue with Rust too</p>",
        "id": 403333224,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700557566
    },
    {
        "content": "<p>Why is that a problem? I'm sure that zig has access to some chunk of memory that it can expose to roc. Wasm4 shouldn't need to expose it to roc.</p>",
        "id": 403397946,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700578549
    },
    {
        "content": "<p>Specifically, zig will have to expose a memory allocator that give some of the available program memory lifted here to roc: <a href=\"https://wasm4.org/docs/reference/memory/\">https://wasm4.org/docs/reference/memory/</a></p>",
        "id": 403403217,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700580020
    },
    {
        "content": "<p>Probably the simplest solution. Would be for the actual model to be stored in separate memory but for each frame to just use a clean arena allocator. Though given zig dowsnt know the exact size of the model, that may not be easy.</p>\n<p>In the worst case, a simple impl of malloc and free needs to be added on top of that available memory.</p>",
        "id": 403405696,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700580489
    },
    {
        "content": "<p><a href=\"/user_uploads/22008/cL0Dh5H1zDn-7KDgwh0j_3K6/Screenshot-2023-11-21-at-10.11.10AM.png\">Screenshot-2023-11-21-at-10.11.10AM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/cL0Dh5H1zDn-7KDgwh0j_3K6/Screenshot-2023-11-21-at-10.11.10AM.png\" title=\"Screenshot-2023-11-21-at-10.11.10AM.png\"><img src=\"/user_uploads/22008/cL0Dh5H1zDn-7KDgwh0j_3K6/Screenshot-2023-11-21-at-10.11.10AM.png\"></a></div><p>wrote a very messy and primitive allocator that uses the program memory space labeled by wasm4.</p>",
        "id": 403437662,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700590344
    },
    {
        "content": "<p>So yeah, everything should be doable.</p>",
        "id": 403437714,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700590370
    },
    {
        "content": "<p>Also, I don't fully understand our wasm build pipeline and how to make zig build something that we can have roc build on top of. So in my current testing, I am just having zig control the full build (which may always be needed for this platform due to the memory restrictions and such, but not fully sure.</p>",
        "id": 403438608,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700590730
    },
    {
        "content": "<p>Fork here of luke's work as a reference: <a href=\"https://github.com/bhansconnect/roc-wasm4-games\">https://github.com/bhansconnect/roc-wasm4-games</a></p>",
        "id": 403439170,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700590974
    },
    {
        "content": "<p>So good <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 403441419,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700591842
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"508951\">@Hannes</span> take a look and let us know what you think. With Brendan's modifications this works and we have a functional platform for Wasm4. </p>\n<p>All you can do with it right now is pass a string back and forth, but I have used just that functionality within the platform to still expose a nice API for apps in <a href=\"https://github.com/lukewilliamboswell/roc-graphics-mach/blob/main/platform/main.roc\">roc-graphics-mach</a> so there looks to be nothing stopping us from building a much more featureful platform for developing wasm4 games.</p>\n<p>We can also potentially look at making a nicer Zig-Roc interface than just passing a <code>Str</code>.</p>",
        "id": 403470643,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700604598
    },
    {
        "content": "<p>Also, there is probably a smarter way to do malloc and free. I just use a bit set and a list of used locations. Originally wanted to just use the bitset but forgot that <code>roc_dealloc</code> doesn't get passed a size currently. If that gets fixed, this can be made a lot slimmer.</p>",
        "id": 403470941,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700604734
    },
    {
        "content": "<p><code>4.3K</code> isn't small enough? <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 403471035,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700604785
    },
    {
        "content": "<p>That is with a limit of 200 allocations. At the max possible number of allocations, it is 33k.</p>",
        "id": 403471444,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700604972
    },
    {
        "content": "<p>If roc gives us the size info, it can be 4k with the max possible number of allocations being allowed.</p>",
        "id": 403471486,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700604997
    },
    {
        "content": "<p>Is there plans for <code>roc_dealloc</code> to get passed a size? Sounds useful</p>",
        "id": 403472572,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1700605531
    },
    {
        "content": "<p>Its been discussed before and on my long list of eventually want to implement. Biggest change will be to seamless slices, but overall still feels quite worth it. Does cost an extra usize on the heap per list/large string.</p>",
        "id": 403473427,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700605932
    },
    {
        "content": "<p>That said, the usize just exists in the allocator is not in the list/large string. So depending on the allocator, it has little cost.</p>\n<p>Oh yeah, I can do that manually in this zig platform, let me fix that.</p>",
        "id": 403473582,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700606034
    },
    {
        "content": "<p>Ok, now it is 3.8k and it avoids the extra overhead of a side table for tracking allocations. instead it just stores the size before the allocation. So can have lots of allocations without statically wasting tons of binary space. Does waste more memory though cause every allocation has 1 chunk of overhead. But I think it is a better tradeoff.</p>",
        "id": 403475857,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700607323
    },
    {
        "content": "<p>Thanks Luke and Brendan, sorry for not responding earlier, I've been bust this week with starting a new job.  That's great news that you've been able to get a proof-of-concept working! I'll find some time to get my head around how it works and how to build a proper API around it, probably just by passing a string to the platform for now like Luke suggested.</p>",
        "id": 403904100,
        "sender_full_name": "Hannes",
        "timestamp": 1700805945
    }
]