[
    {
        "content": "<p>The new game Hytale (Many are calling it Minecraft 2) has already sold well over 1 million copies since the early access release on Jan 13th.</p>\n<p>Their post on modding mentions that they are rejecting any text based scripting languages like Lua, and are supporting .jar files for mods. They mention Java and C# specifically for creating the .jar files.</p>\n<p>How hard would it be to make a Roc platform that outputs .jar files? My experience with the JVM is minimal.</p>\n<p>A Roc Hytale Mod Platform could be huge!</p>\n<p>The post about mod support: <a href=\"https://hytale.com/news/2025/11/hytale-modding-strategy-and-status\">https://hytale.com/news/2025/11/hytale-modding-strategy-and-status</a></p>",
        "id": 569620842,
        "sender_full_name": "Matthew Martelle",
        "timestamp": 1769132905
    },
    {
        "content": "<p>Option A via WASM. Java has WASM runners I assume... so probably somewhere between easy and doable.</p>\n<p><del>Option B LLVM. I dont know much about the JVM, can you compile LLVM to it?</del> apparently no is the answer</p>",
        "id": 569621650,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769133487
    },
    {
        "content": "<p>Ideally they would support Roc mods though... then it's much more efficient handling data instead of passing things through various layers. I guess it depends a lot on how they have modeled the abstraction. Do you get a handle and queue up operations on that -- that might fit nicely with a Roc platform.</p>",
        "id": 569625048,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769135698
    },
    {
        "content": "<p>I guess all the answers are in <a href=\"https://hytalemodding.dev/en/docs/guides/ecs/entity-component-system\">https://hytalemodding.dev/en/docs/guides/ecs/entity-component-system</a></p>",
        "id": 569625244,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769135839
    },
    {
        "content": "<p>I'm guessing the jar file restriction also means that they'd disallow native dependencies in the jar. If they did allow native dependencies, you might be able to daisy-chain to some arbitrary roc platform with <a href=\"https://docs.oracle.com/en/java/javase/21/core/foreign-function-and-memory-api.html\">native ffi</a>.<br>\nAssuming it's restricted, running Roc in a jar at all might be a struggle.</p>",
        "id": 569625755,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769136263
    },
    {
        "content": "<p>This bullet point makes me assume that there's some kind of sandboxed JVM going on:</p>\n<blockquote>\n<ul>\n<li><strong>Empowering modders without exposing players:</strong> We want modders to benefit from their work and build a future they can rely on, with as much freedom as possible - without exposing players to the security and safety risks that exist on some other modding platforms.</li>\n</ul>\n</blockquote>",
        "id": 569625883,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769136358
    },
    {
        "content": "<p>This later bit in the visual scripting section makes it sound more like the JVM you get is less restricted, though:</p>\n<blockquote>\n<p>Java plugins will continue to exist and are extremely powerful - but they require programming skills and come with safety concerns.</p>\n</blockquote>",
        "id": 569626252,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769136685
    },
    {
        "content": "<p>If it's a situation where you can wire up some native program to your java program as long as the server owner is willing to let you, then getting a custom Roc platform for this would be totally doable, just effort.</p>",
        "id": 569626467,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769136825
    },
    {
        "content": "<p>I think there is some R&amp;D here around how to build a nice API that works with an ECS or an object oriented system like that</p>",
        "id": 569626514,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769136853
    },
    {
        "content": "<p>I am personally more excited about the potential for building pure Roc API's for gamedev</p>",
        "id": 569626588,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769136912
    },
    {
        "content": "<p>With our semantics we can provide some pretty awesome features out of the box</p>",
        "id": 569626611,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769136938
    },
    {
        "content": "<p>Here is a very rough design doc I've been thinking about for roc-ray <a href=\"https://gist.github.com/lukewilliamboswell/0350761f3f42800e3b7430b24f786720\">https://gist.github.com/lukewilliamboswell/0350761f3f42800e3b7430b24f786720</a></p>\n<p>Just exploring possible ideas that Roc enables</p>",
        "id": 569626791,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769137098
    },
    {
        "content": "<p>modding-wise, WASM might still be a better option just on the 'convincing devs/server owners to let you' grounds. Like, choosing to sandbox yourself instead of just promising to be good.</p>",
        "id": 569626850,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769137149
    },
    {
        "content": "<p>Yeah for Hytale... you could use a WASM \"shim\" thing to show how awesome Roc mods could be... and then at some point in the future the hytale devs could (in theory) rip out all the WASM and JVM intermediate parts and the Roc mods wouldn't need to change.</p>",
        "id": 569626950,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769137232
    },
    {
        "content": "<p>I'd guess that HyTale is using Java partially to tap into their own and others' Minecraft modding experience. It's not a normal game dev language outside of that ecosystem.</p>",
        "id": 569627079,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769137330
    },
    {
        "content": "<p>I have some interest in gamedev; I have a rather sophisticated Ballistics database, suitable for something like Tarkov, that I want to attach to <code>ballistics-rs</code> (potentially) as the ballistics engine, though any particular game would have its own engine.  I also have a <code>driving_physics</code> lib, for which I was starting need an ECS system to progress further in terms of \"components subject to physics\".  But this is all library stuff, maybe with CLI demos, in Ruby.  I dabbled with trying to render in DragonRuby, but paused for various reasons.  I think ECS is a very viable framework for scaling physics operations across tons of entities and components, but I never actually used ECS in anger, yet.</p>",
        "id": 569627485,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769137640
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"780900\">@Rick Hull</span> I think you're going to love roc-ray then... <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 569627813,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769137948
    },
    {
        "content": "<p>I keep getting distracted.. but the goal is to basically provide a thin API wrapping the raylib library which is written in C and very efficient. With LLVM and optimized Roc I think we should be able to achieve excellent performance.</p>",
        "id": 569627927,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769138021
    },
    {
        "content": "<p>We might need to iterate on the design a little, and there's a trade-off there with ergonomics... but all things we can explore with data soon</p>",
        "id": 569627993,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769138072
    },
    {
        "content": "<p>yes, quite possibly!  but it's a little out of my wheelhouse for now <span aria-label=\"cook\" class=\"emoji emoji-1f9d1-200d-1f373\" role=\"img\" title=\"cook\">:cook:</span></p>",
        "id": 569628020,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769138091
    },
    {
        "content": "<p>separately, I am interested in how far Roc can push machine code performance.  without being a C / build / systems guy, gcc always seemed a little gross, and the LLVM / clang world seemed nicer.  I came up on GNU/Linux but the BSD world has some good hygiene.  I heard Richard mention SIMD, and I know that gets complicated quick.  But I've always lived in a Ruby/Elixir/Python world, scripts-on-runtimes, where the perf optimization starts with a language change. ;)</p>",
        "id": 569628923,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769138839
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"780900\">Rick Hull</span> <a href=\"#narrow/channel/302903-platform-development/topic/Hytale.20modding/near/569627485\">said</a>:</p>\n<blockquote>\n<p>I think ECS is a very viable framework for scaling physics operations across tons of entities and components, but I never actually used ECS in anger, yet.</p>\n</blockquote>\n<p>Avian seems to be coming along nicely, if you'd like to explore an ECS physics system. <a href=\"https://github.com/avianphysics/avian\">https://github.com/avianphysics/avian</a></p>",
        "id": 569690836,
        "sender_full_name": "Matthew Martelle",
        "timestamp": 1769166961
    },
    {
        "content": "<p>There is <a href=\"https://github.com/cretz/asmble\">https://github.com/cretz/asmble</a> but I haven't used it.<br>\nYou could compile roc to wasm and use <code>asmble</code> to turn it into JVM bytecode.</p>",
        "id": 569700146,
        "sender_full_name": "lozzy",
        "timestamp": 1769170336
    },
    {
        "content": "<p>Also in <a href=\"https://hytalemodding.dev/en/docs/established-information/developer-qa-insights\">https://hytalemodding.dev/en/docs/established-information/developer-qa-insights</a> they list \"<strong>Full Java Access</strong>: Database connections, web requests, any Java functionality\" under <strong>Modding Capabilities</strong>. If that means that using the JNI is possible one could probably build a native roc object and link to it in the plugin? The ergonomics would be questionable though <span aria-label=\"unsure\" class=\"emoji emoji-1fae4\" role=\"img\" title=\"unsure\">:unsure:</span></p>",
        "id": 569705407,
        "sender_full_name": "lozzy",
        "timestamp": 1769172079
    },
    {
        "content": "<p>Yeah, it sounds like their server-side is itself in Java, so using non-java for mods might just be shooting yourself in the foot in general, given they're offering the most direct ergonomic thing.</p>",
        "id": 569780512,
        "sender_full_name": "Dan G Knutson",
        "timestamp": 1769192811
    }
]