[
    {
        "content": "<p>Roc has the classic <code>==</code> operator, and the <code>Eq</code> ability to implement custom comparison. But I'm curious if there was ever discussion to drop this API, or at least make something significantly different?</p>\n<p>The reason I ask is that I feel the existing API has many of the problems that are solved by e.g. <code>Inspect</code>. That is, checking equality is conceptually simple, and is exposed with a simple operator, but in reality, there are many kinds of equality, and putting them all behind one interface presents foot guns.</p>\n<p>For example, for any entity with an ID, I may want my equality check to only check whether two entities have the same ID. But I may also want an equality check for whether two entities contain the same data regardless of ID. Do I implement <code>Eq</code> to mean one or the other? </p>\n<p>Similarly, a full equality check may be computationally expensive, so maybe I implement a cheap check to compliment the full thing. Should that be the <code>Eq</code> implementation or not?</p>\n<p>One could argue that you shouldn't implement <code>Eq</code> at all for types where it's not clear what kind of equality it means. But is there an underlying assumption that <code>Eq</code> always implies a specific kind of equality?</p>",
        "id": 444789774,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718399103
    },
    {
        "content": "<p><code>Eq</code> is explicitly flexible to support non structural equality. For example, dict and set do and out of order eq despite having an order. Types can opt into whichever default form of eq makes most sense for them. Also, only opaque types get to opt into this. All other types just do structural eq.</p>\n<p>I don't see how inspect fixes anything related to eq, can you expand on that</p>",
        "id": 444792097,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718400189
    },
    {
        "content": "<p>As for your id example. I would default to just the id. It sounds like that is your short circuit expectation and the deep equal is an exception....but ultimately this would be type specific.</p>",
        "id": 444792244,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718400243
    },
    {
        "content": "<p>I meant that <code>Inspect</code> solves a similar problem in a different domain. That is, instead of each type only getting a single <code>toString</code> function to convert to a string, you pass it a formatter to specify how it should be done. Presumably something analogous for equality might make sense.</p>",
        "id": 444792809,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718400520
    },
    {
        "content": "<p>Ah, you mean eq were you also pass a config</p>",
        "id": 444792880,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718400553
    },
    {
        "content": "<p>I think even if we added that, we would still want a default <code>==</code> for convenience. Even if you could separately call <code>Bool.eq a b myConfig</code></p>\n<p>Though is there really an advantage to that over <code>MySpecialEq a b</code>. Cause I wouldn't expect much if any sharing between configs. So I would expect it to be custom by type rather than something more general like inspect.</p>",
        "id": 444793144,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718400670
    },
    {
        "content": "<p>I guess if we are thinking of a more bespoke versions of equal, we could make deep, custom, and structural equal or something like that.</p>",
        "id": 444793407,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718400810
    },
    {
        "content": "<p>I also think just having functions would be better in a lot of cases, but having the <code>==</code> operator even be available means people will want to use it when it's not prudent.</p>\n<p>I also know just outright removing <code>==</code> would be controversial, so I won't suggest that. But maybe it's possible to make it clearer what its semantics should be.</p>",
        "id": 444793621,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718400934
    },
    {
        "content": "<p>I think <code>Dict</code> equality is an interesting case too. Equality probably shouldn't account for ordering there, but there are also times when you do care about the ordering of the keys. In that case, a different type a la <code>OrderedDict</code> may be preferable, but if <code>Dict</code> already maintains order, then being able to compare equality one way or another might be nice too.</p>",
        "id": 444793993,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718401170
    },
    {
        "content": "<p>If you need ordering, just <code>myDict |&gt; Dict.toList == ...</code> or we could add an explicit method to dict. That is definitely not the common case for an unordered dict.</p>\n<p>But yeah, I agree overall, that semantics are kinda user dependent right now, which could definitely lead to bugs/confusion in some cases</p>",
        "id": 444796181,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718402487
    },
    {
        "content": "<p>At the same time, I think it is user dependent in essentially all languages and some common expectations have arisen. Not saying that is good, but it does have a common set of expectations.</p>",
        "id": 444796533,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718402627
    },
    {
        "content": "<p>My point of reference is that when I need an ordered dictionary at work, I reach for <code>ListMap</code> in Scala. In our Elm code, we've also implemented an ordered set.</p>\n<p>In Scala, <code>ListMap</code> implements the <code>Map</code> trait, so it's still easy to pass around to the code that doesn't care if the map is ordered or not, and I get the right equality behavior. Since Roc doesn't want that level of abstraction, I would expect something like a <code>Dict.isEqWithOrdering</code> function that I could use. Converting to a list would also be fair, though less efficient presumably.</p>",
        "id": 444844952,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718442672
    },
    {
        "content": "<p>It would be nice for <code>==</code> to always imply structural equality (or something that behaves like it), and then asking users to implement their own functions for other equality checks I think.</p>",
        "id": 444845107,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718442820
    },
    {
        "content": "<p>Relatedly, I've wanted an <code>isRefEq</code> function in Elm a few times, since it can be a big performance optimization when implementing custom equality functions.</p>",
        "id": 444845245,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718442958
    },
    {
        "content": "<p>Ok. So let's piece that apart.</p>\n<p>Firstly, Roc's Dict has an ordering based on insertion and deletion. So it should feel pretty similar to <code>ListMap</code>. Though it is not an ordered dictionary (at least not how ordered is normally used. Ordered dict normally means automatically sorted).</p>",
        "id": 444886840,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718472292
    },
    {
        "content": "<p>Secondly, structural equality is essentially meaningless on Roc's dict. Due to the metadata, it will essentially always be false.<br>\nThis is true of many data structures. On top of that, structural equal is often very very very slow in the worst case.</p>",
        "id": 444887037,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718472401
    },
    {
        "content": "<p>This is why I think <code>==</code> defaulting to structural equal is not a good idea. Especially given opaque types can be used for data hiding so it literally may expose data that should be hidden.</p>",
        "id": 444887145,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718472476
    },
    {
        "content": "<p>As for <code>Dict.isEqWithOrdering</code>, we totally could add that. It would be equivalent to <code>Dict.toList dictA == Dict.toList dictB</code>. <code>toList</code> is a free operation so no performance concerns.</p>",
        "id": 444887292,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718472554
    },
    {
        "content": "<p>I don't think <code>isRefEq</code> is generally safe in roc. So I think it could only be implemented/used safely for built-in types (I think list may already do this as a short circuit). Not to mention copying due to uniqueness and refcounting can happen. So I don't think it would generally fit well as something available to roc userland.</p>",
        "id": 444887540,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718472692
    },
    {
        "content": "<p>Ah yes, I wasn't referring to <code>Dict</code> applying any sorting, thanks for clearing that up.</p>\n<p>For structural equality being false due to meta data, this was what I meant by something \"behaving like it\". It would be nice for structural equality (minus meta data) to be the target for what <code>Eq</code> should check, and relegate other behavior to dedicated functions. On the other hand, that definitely has some bad corner cases, which just brings us back to the original point of <code>==</code> being too simple an interface for what we are asking if it.</p>\n<p>I wasn't aware <code>Dict</code> is implemented as a list, so nice for that <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span> though presumably e.g. <code>Set.isEqWithOrdering</code> would be cheaper than doing <code>Set.toList a == Set.toList b</code>, as I assume <code>Set</code> is based on <code>Dict</code> with dummy values assigned?</p>",
        "id": 444889356,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718473614
    },
    {
        "content": "<p>I'm curious why <code>isRefEq</code> would be unsafe though? Even in the face of copies and ref counting, wouldn't it just be cases which returns false, even though they could have been true? In other words, I'm only looking for it being a short circuit operation when it's definitely true, so having false negatives isn't a deal breaker. Only false positives would be bad.</p>",
        "id": 444889746,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718473848
    },
    {
        "content": "<p>I guess that is what I mean by unsafe. It is only valid as a short circuit. Used otherwise could be buggy. Also, seamless slice might lead to some strange edge cases if you aren't careful. As in pointers to the same allocations but different slices of the allocation. Or same start but different length.</p>",
        "id": 444892738,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718475372
    },
    {
        "content": "<p>Yeah, for set, it should also be free, but I would guess that today we wouldn't optimize it correctly. Cause maping a <code>List (key, {})</code> to a <code>List key</code> should be a noop. They are exactly the same in memory</p>",
        "id": 444893057,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718475567
    },
    {
        "content": "<p>True, slices can present false positives. Unless they get a special implementation of course. I would personally want really want something like this short circuiting available to be able to make best use of Roc's guarantees. I.e. this is a place where Roc can offer better performance than something like C++ due to its design.</p>\n<p>Even if it's already used on <code>List</code>, I would want to be able to apply it on all my custom <code>Eq</code> implementations essentially.</p>",
        "id": 444894065,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718476134
    },
    {
        "content": "<p>To be fair, all pointers in roc are either tags or lists, so roc should always be able to apply this automatically</p>",
        "id": 444894158,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718476199
    },
    {
        "content": "<p>*or strings</p>",
        "id": 444894238,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718476223
    },
    {
        "content": "<p>Sorry, I also meant to have it applied for custom checks which are not exposed as <code>Eq</code> implementations (like <code>Dict.isEqWithOrdering</code>). Presumably those cases would not be automatically covered.</p>",
        "id": 444894639,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718476363
    },
    {
        "content": "<p>So like, for that check, you would compare the underlying lists. So the lists would get short circuit eval.</p>",
        "id": 444896889,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718477781
    },
    {
        "content": "<p>Sure, but that was just an example of a non-<code>Eq</code> equality check. Other non-<code>Eq</code> checks might not hit that.</p>",
        "id": 444898089,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718478518
    },
    {
        "content": "<p>Rather than <code>isRefEq : a, a -&gt; Bool</code>, the function might instead be <code>isRefEq : a, a -&gt; [DefinitelyEqual, EqualityUnknown]</code>, which would make it clearer what it can be used for I'd say.</p>",
        "id": 444898347,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718478676
    },
    {
        "content": "<p>As an example of a non-<code>Eq</code> equality check where this would be useful: I've had to write a function which compares two lists for equality, where each element in the list is a record. But some fields in those records should be ignored for equality, so there's no way around iterating through the lists and checking the right fields. Except if you can tell the two lists have the same reference and at least short circuit the process some of the time.</p>",
        "id": 444907607,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718484239
    },
    {
        "content": "<p>So that would just be normal list equality short circuit. So nothing special needed.</p>",
        "id": 444912782,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718487217
    },
    {
        "content": "<p>I think all pointer types should be possible to automatically have short circuit equality in roc. As I said earlier, the only pointer types in roc are controlled by the language (str, list, recursive tag, and I guess box). So roc can just define their equality to short circuit by default. Users don't need to define anything for that or ever call something like <code>isRefEq</code></p>",
        "id": 444912899,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718487315
    },
    {
        "content": "<p>When writing custom equal of a type wrapping a list, doing <code>a.list == b.list</code> will also short circuit.</p>",
        "id": 444913081,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718487502
    },
    {
        "content": "<p>I guess that is only fine if you are ok using the records <code>==</code></p>",
        "id": 444913099,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718487520
    },
    {
        "content": "<p>So I think I see what you are saying. Like you have a list of records, but you want to check equality on a limited subset of fields. That equality would be check with <code>List.walkUntil</code> such that it could early exit, but you would like to short circuit on the exact same list instance, but that wouldn't be possible cause you are only looking at a couple of the fields and the record doesn't have a custom equal only for those couple of fields.</p>",
        "id": 444913326,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1718487741
    },
    {
        "content": "<p>Indeed, though I would also have to check that the lists have the same length, then do <code>List.map2 a b Pair</code>, and then do <code>walkUntil</code></p>",
        "id": 444946706,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718518895
    },
    {
        "content": "<p>I really don't want the concept of \"reference equality\" to be a thing anyone ever has to think about in Roc, so the explicit plan is to never add anything like this! <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 444981044,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1718548641
    },
    {
        "content": "<p>I appreciate that in this particular scenario it would be helpful for performance, but I'd be really curious to know how important that short-circuit was in practice in this situation</p>",
        "id": 444981495,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1718549028
    },
    {
        "content": "<p>it seems extremely narrow! <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 444981499,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1718549037
    },
    {
        "content": "<p>Oh, totally narrow. Another use case would be implementing something like the <code>Html.Lazy.lazyN</code> functions from Elm in user space. In Roc that might be provided by the platform, but the only thing that's really missing to make it implementable in user space is something like <code>isRefEq</code> as far as I can tell.</p>\n<p>It's basically useful for implementing memoization.</p>",
        "id": 444983337,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718550438
    },
    {
        "content": "<p>To be clear, the <code>isRefEq</code> ask isn't all that big for me, and is really just an offshoot of the original question about considerations about what <code>Eq</code> actually implies.</p>",
        "id": 444985261,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718551584
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"557981\">Kasper Møller Andersen</span> <a href=\"#narrow/stream/383402-API-Design/topic/Checking.20equality/near/444983337\">said</a>:</p>\n<blockquote>\n<p>Oh, totally narrow. Another use case would be implementing something like the <code>Html.Lazy.lazyN</code> functions from Elm in user space. In Roc that might be provided by the platform, but the only thing that's really missing to make it implementable in user space is something like <code>isRefEq</code> as far as I can tell.</p>\n</blockquote>\n<p>the bigger problem with the <code>lazy</code> functions is that they'd be completely broken in Roc because we do in-place mutation...so they would just give the wrong answer and cause bugs <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 444985882,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1718551956
    },
    {
        "content": "<p>Would it though? Roc only does in place mutation if there's only a single reference to some data, but if you implement <code>lazyN</code> equivalents in user space, you also need to explicitly store the input in a cache somewhere to be able to compare it later. This automatically gives you multiple references, so it would work fine as far as I can tell <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span></p>",
        "id": 444989210,
        "sender_full_name": "Kasper Møller Andersen",
        "timestamp": 1718553910
    }
]