[
    {
        "content": "<p>one interesting thing I've realized about the potential for having statically allocated collections (e.g. if I write the literal <code>[\"foo\", \"bar\", baz\"]</code>, we know that the entire <code>List Str</code> can be allocated in the binary itself because it doesn't rely on any information that changes at runtime) is that it affects API design.</p>",
        "id": 399393678,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698709637
    },
    {
        "content": "<p>for example, I ran into a use case where having a function like <code>Str.splitAny : Str, List Str -&gt; List Str</code> would be nice, and then I reflexively started thinking about if there would be a way to avoid the <code>List</code> because it's an extra heap allocation</p>",
        "id": 399393693,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698709653
    },
    {
        "content": "<p>but then I realized it doesn't have to be a heap allocation if we had that optimization, and in fact more often than not (at least the way I expect people would typically use a function like that) it'd be a static allocation, and might optimize all the way into an unrolled loop</p>",
        "id": 399393782,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698709706
    },
    {
        "content": "<p>which really changes the tradeoffs around APIs taking collections like that!</p>",
        "id": 399393798,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698709725
    },
    {
        "content": "<p>Currently <code>List Str</code> will allocate even if it is constant</p>",
        "id": 399414377,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698720312
    },
    {
        "content": "<p>right, but the idea is to change that in the future!!<span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 399468435,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698747610
    },
    {
        "content": "<p>I mean it works for regular lists. The reason it doesn't work for nested lists is just a bug.</p>",
        "id": 399533598,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698762665
    },
    {
        "content": "<p>It actually used to work a long time ago.</p>",
        "id": 399533869,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698762743
    },
    {
        "content": "<p>But yeah, definitely a should fix eventually</p>",
        "id": 399533900,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698762756
    },
    {
        "content": "<p>Is this an optimization that could automatically stack allocate a collection if it’s size is known at compile time and never changes? So if I have a <code>List Foo</code> which is initialized to a given length and I never add or remove elements.</p>",
        "id": 400771417,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699373203
    },
    {
        "content": "<p>Oh, those should all be in the binary in the read only data sections. (or potentially even the mutable data section). So no need to try and stack allocate or anything of that nature. Also stack allocation generally isn't safe cause you can't return the list from the current function (and it can lead to easily getting stack overflows and lots of duplicate data)</p>",
        "id": 400773116,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1699373651
    },
    {
        "content": "<blockquote>\n<p>those should all be in the binary in the read only data sections.</p>\n</blockquote>\n<p>We just have some bugs stopping us from having this optimization in all cases currently.</p>",
        "id": 400773191,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1699373676
    },
    {
        "content": "<p>So basically, once the wrinkles are ironed out, I get  non-heap allocated collections for free as long as I don’t do anything to change their size after I initialize them?</p>",
        "id": 400773552,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699373788
    },
    {
        "content": "<p>Even if I only know the type of the members, not the values?</p>",
        "id": 400773603,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699373803
    },
    {
        "content": "<p>Well I guess I’d have to initialize to something. Nvm.</p>",
        "id": 400773673,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699373823
    },
    {
        "content": "<blockquote>\n<p>I get non-heap allocated collections for free as long as I don’t do anything to change their size after I initialize them?</p>\n</blockquote>\n<p>As I think about this more, I am pretty sure that any change will have to heap allocate. Cause each time you load a constant, it must be exactly the same. If we allowed inplace modification, that would break things. So the moment any change happens, it would heap allocate.</p>",
        "id": 400774069,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1699373960
    },
    {
        "content": "<p>Oh, so in order for that to work, you’d have to have a ref count of 1, and be doing opportunistic in-place mutation anyway.</p>",
        "id": 400774641,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699374130
    },
    {
        "content": "<p>So you’d have to track that, plus whether the size of the collection is changing at all.</p>",
        "id": 400774800,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699374171
    },
    {
        "content": "<p>That makes sense, I think.</p>",
        "id": 400774843,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699374182
    },
    {
        "content": "<p>I can see how that would be non-trivial to implement. I just thought it sounded cool to get the performance of a Rust array for free, without having to write different code.</p>",
        "id": 400775133,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699374275
    },
    {
        "content": "<p>A constant can't have opportunistic mutation at all. If you have:</p>\n<div class=\"codehilite\"><pre><span></span><code>fn = \\{} -&gt;\n   x = [1, 2, 3]\n   List.set x 0 ((List.get x 0) + 1)\n</code></pre></div>\n<p>If you do an oppurtunistic inplace mutation, you would change <code>x</code> to <code>[2, 2, 3]</code> and return <code>[2, 2, 3]</code>. The next time the function runs, it would then load <code>[2, 2, 3]</code> and return <code>[3, 2, 3]</code>. So refcounts aren't a valid signal when dealing with constants. Opportunistic mutation is never valid.</p>",
        "id": 400775481,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1699374384
    },
    {
        "content": "<p>I guess ,to be fair, there are technically ways to make this work if we really wanted to. Probably the most reasonable way to make something like this work would be to enable the small list optimization. Then if the constant is under a specific size, it would be on the stack and allowed inplace mutation.</p>",
        "id": 400775799,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1699374498
    },
    {
        "content": "<p>Oh, you’re talking about constants only. I see.</p>",
        "id": 400776325,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699374698
    },
    {
        "content": "<p>I’m thinking of situations such as maybe a chess game, where the grid is a fixed 64 squares. The values might change, but the size won’t. In Rust we would use an Array for that. But I’m not sure how often this comes up in situations where you wouldn’t want to just use a systems language anyway.</p>",
        "id": 400776949,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699374903
    },
    {
        "content": "<p>Ah. yes. That use case for arrays. Yeah, I want arrays for the same reason. Currently the Roc approved solution is tuples, but I don't think their ergonomics are good enough for this yet.</p>",
        "id": 400779069,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1699375654
    },
    {
        "content": "<p>That would actually be a super awesome use case to see the pain point of using tuples and if we can make them nice enough to not need arrays of some sort. (that and if someone could write a tuple and list version to compare the perf diff)</p>",
        "id": 400779568,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1699375811
    },
    {
        "content": "<p>I have a Sudoku thingy I wrote in elm. I’ve been thinking about porting it over to Roc for grins. Maybe I could compare tuples and lists if i get around to it.</p>",
        "id": 400780708,
        "sender_full_name": "Bryce Miller",
        "timestamp": 1699376173
    }
]