[
    {
        "content": "<p>Hi, I'm interested in working on adding some more quality of life features to the new <code>roc repl</code>. I've managed (on MacOS at least) to get some support for history and up/down arrows to get the previous/next commands in history. This was done in a hacky way using the GNU readline library. I'm quite curious in getting something working without this. If this is something which would be useful I'm happy to start working on a PR for this :)</p>",
        "id": 568663040,
        "sender_full_name": "Yanni Papandreou",
        "timestamp": 1768742180
    },
    {
        "content": "<p>That would be great <span class=\"user-mention\" data-user-id=\"931804\">@Yanni Papandreou</span> :)<br>\nSome things to keep in mind: we need the repl to work on macos, windows, linux, (maybe BSD in the future) and in the browser (with the interpreter built into a .wasm). We like to avoid adding dependencies.</p>",
        "id": 568748913,
        "sender_full_name": "Anton",
        "timestamp": 1768812729
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"361169\">@Anton</span> Noted thanks! I will start working on something first for unix platforms then will try to add support for windows/bsd/wasm.</p>",
        "id": 568882467,
        "sender_full_name": "Yanni Papandreou",
        "timestamp": 1768854080
    },
    {
        "content": "<p>Great! You don't need to do BSD yet though, we don't have CI set up for it. I was just mentioning it to make sure we can accommodate for it in the future.</p>",
        "id": 568970909,
        "sender_full_name": "Anton",
        "timestamp": 1768899688
    },
    {
        "content": "<p>I have a PR open now which I've tested on Macos, Linux (NixOS), and in a windows vm: <a href=\"https://github.com/roc-lang/roc/pull/9081\">https://github.com/roc-lang/roc/pull/9081</a></p>",
        "id": 569891135,
        "sender_full_name": "Yanni Papandreou",
        "timestamp": 1769277213
    },
    {
        "content": "<p>I run FreeBSD on my gateway at home.  Not really a bsd person though, yet</p>",
        "id": 569896766,
        "sender_full_name": "Rick Hull",
        "timestamp": 1769282233
    }
]