[
    {
        "content": "<p>I was just thinking about it and I bet that, based on our current pace of progress on the new compiler, we could get it to a stage where people can use it on basic-cli for Advent of Code 2025</p>",
        "id": 520325967,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1748207188
    },
    {
        "content": "<p>that wouldn't be 0.1.0 because not everything might be all the way there yet - e.g. release builds, testing, repl, etc. - but I bet static dispatch could be there, so people could try that out for AoC</p>",
        "id": 520326033,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1748207275
    },
    {
        "content": "<p>it's almost exactly 6 months away as of today, and it feels achievable to me if we set our sights on it</p>",
        "id": 520326131,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1748207356
    },
    {
        "content": "<p>I presume getting something basic canonicalized, type checked, and interpreted is the first step on the way there</p>",
        "id": 520327475,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1748208558
    },
    {
        "content": "<p>Seems like we have people working on all of those already</p>",
        "id": 520327499,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1748208589
    },
    {
        "content": "<p>Which is awesome!</p>",
        "id": 520327510,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1748208594
    },
    {
        "content": "<p>What work needs to be figured out that hasn't been architected? Feels like the interaction between the interpreter and basic-cli is the biggest gap here, AKA the shim</p>",
        "id": 520327617,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1748208648
    },
    {
        "content": "<p>Is there a design for the shim? If not, what features do we need to constrain the design with?</p>",
        "id": 520327665,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1748208693
    },
    {
        "content": "<p>that's a good question! I suspect most of the design work there exists in <span class=\"user-mention\" data-user-id=\"343810\">@Brendan Hansknecht</span>'s head <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 520330515,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1748211347
    },
    {
        "content": "<p>I think the shim will be pretty easy overall, it is really just a single function per entry point that adds type information and calls the interpreter. Maybe some minor weird linking (like loading the compiler itself as a shared library such that we can call into the interpreter), but nothing too special</p>",
        "id": 520345662,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1748225135
    },
    {
        "content": "<p>Okay, then we will just have to ask you to write everything down when the time comes</p>",
        "id": 520346030,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1748225391
    },
    {
        "content": "<p>I'm keen to help work on that soon. I think once we get some basic interpreter infrastructure and typechecking I could have a crack at it under Brendan's guidance.</p>",
        "id": 520347526,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1748226427
    }
]