[
    {
        "content": "<p>I've been thinking about Advent of Code again, it's only a few months away now, <span aria-label=\"santa\" class=\"emoji emoji-1f385\" role=\"img\" title=\"santa\">:santa:</span>  and wondering if we would like to set ourselves any stretch goals? <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span> </p>\n<p>I'm confident we'll resolve these latest bugs and probably have builtin Task and  Module Params by then ... sooo in this new exciting world, are there things we could build or prepare that would really showcase the best parts of roc for the holiday season? <span aria-label=\"holiday tree\" class=\"emoji emoji-1f384\" role=\"img\" title=\"holiday tree\">:holiday_tree:</span></p>\n<p>One cool idea that comes to mind, is the roc editor embedded in the website that supports effects. </p>\n<p>Wouldn't it be awesome to have a site where we can share our \"Advent of Code\" solutions and run them in the browser? </p>\n<p>I imagine we could have a leaderboard with different stats on submitted solutions like lines of code, runtime performance, memory used, binary size ... (I'm only a little bit competitive I swear <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> )</p>\n<p>Anyway, can you think of a cool idea we could work on?</p>",
        "id": 462296731,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1723625605
    },
    {
        "content": "<p>It's still easy for Roc users to hit compiler bugs, I'd love to focus on resolving those or providing better error messages when they happen. I think this currently is Roc's largest shortcoming.</p>",
        "id": 462299920,
        "sender_full_name": "Anton",
        "timestamp": 1723626466
    },
    {
        "content": "<p>For advent of code, you don't need any task. If you could embed a Roc editor on a website, it could use a very simple platform with: <code>main : \\Str, Str} -&gt; (Str, Str)</code></p>",
        "id": 462554908,
        "sender_full_name": "Oskar Hahn",
        "timestamp": 1723729727
    },
    {
        "content": "<p>Is there an up to date starter template for AoC 2024? I know there are a lot of ongoing changes, particularly around effectful code. I'd like to use AoC to dive into Roc in earnest for the first time.</p>",
        "id": 481030919,
        "sender_full_name": "Caleb Weeks",
        "timestamp": 1730944728
    },
    {
        "content": "<p><a href=\"https://gist.github.com/lukewilliamboswell/ddc9e63f4ae7771c5fde65f8d86f242d\">https://gist.github.com/lukewilliamboswell/ddc9e63f4ae7771c5fde65f8d86f242d</a></p>",
        "id": 481031640,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730945224
    },
    {
        "content": "<p>Here's one, I just updated the first example from my aoc template repository. I'm wanting to update all of those examples before AoC ... but I'm holding out for purity inference <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 481031681,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730945268
    },
    {
        "content": "<p>Shoot, it's November already... I might need to get cracking on this.</p>",
        "id": 481032076,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730945540
    }
]