[
    {
        "content": "<p>So from watching the roc aoc stream from <span class=\"user-mention\" data-user-id=\"772522\">@Scally</span>  recently, arch package versioning come up as a bit of a problem when it came to updating <a href=\"https://aur.archlinux.org/packages/roc-nightly-bin\">the aur package for nightlies</a>. They said that the aur package often requires removal and reinstall to actually update roc.</p>\n<p>I think since roc reports a version now, we should be able to do something better. If I understand aur packaging correctly, I think we should be able to:</p>\n<ol>\n<li>use <a href=\"https://wiki.archlinux.org/title/Creating_packages#prepare()\">prepare</a> to download the lasest nightly</li>\n<li>use <a href=\"https://wiki.archlinux.org/title/Creating_packages#pkgver()\">pkgver</a> run <code>roc version</code> to get a version for arch to compare to.</li>\n<li>use package just to copy over the source.</li>\n</ol>\n<p>I think that should make it correctly check for new updates. That said, I don't really know aur packaging that well and have not run arch in a while (so couldn't test rn). But sounds like there might be some room for improved experience here.</p>\n<p>All this said, it looks like it currently uses the date for the package version, so feels like it should update without needing reinstall.... hmm... Maybe something has to be fired off by the roc nightly job to tell it to update. The current package version claims to be <code>20240215-6</code>, which is quite old. Either way, would be great to update with the changes listed above to give it proper versioning.</p>\n<p>CC aur package maintainer <span class=\"user-mention\" data-user-id=\"674610\">@Alexander Pyattaev</span></p>",
        "id": 488034551,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1733903192
    },
    {
        "content": "<p>Maybe as a relevant note, when having no version installed and installing the AUR package it does download and install the latest version from git, the issue is just that when there is already a version installs it doesn't update saying the current version was already up to date / newer than the <code>20240215</code> version.<br>\nProbably all that would be needed is something bumping the package version on AUR whenever a new nightly build is available.</p>\n<p>While I don't have any experience with packaging myself, I'd gladly help with testing, feel free to ping me for that.</p>",
        "id": 488048296,
        "sender_full_name": "Scally",
        "timestamp": 1733908012
    },
    {
        "content": "<p>Yeah packaging roc is not fun because the aur system is set up with the<br>\nexpectation that a package would have a version. Nightlies are not really<br>\nwell-supported by AUR build scripts.The best thing to do would be to make<br>\n\"nightly releases\" with date as version number, and have ~7 of them just<br>\nhanging out on github or something like that. Then one would indeed need to<br>\nauto-bump the AUR package every day. I can give the access to the AUR<br>\npackage repo if someone wants to give it a try.</p>",
        "id": 491104223,
        "sender_full_name": "Alexander Pyattaev",
        "timestamp": 1735403779
    },
    {
        "content": "<p>We plan to make weekly roc releases in the near future, we should come back to this after that's done</p>",
        "id": 491104742,
        "sender_full_name": "Anton",
        "timestamp": 1735404329
    },
    {
        "content": "<p>Yes, that would massively simplify packaging. I can also make a package for gentoo easily enough.</p>",
        "id": 491110747,
        "sender_full_name": "Alexander Pyattaev",
        "timestamp": 1735410455
    }
]