[
    {
        "content": "<p>At the end of the meetup yesterday we talked about trying to release basic-cli 0.6 and basic-webserver today in time for the new website. basic-cli 0.6 would contain breaking changes, like with Stdin.line, which is used all over the place, including in many snippets in the tutorial. Those snippets in the tutorial are not automatically tested so I would have to manually check all of them to make sure they still work.</p>\n<p>In general I believe it is too risky to try to release basic-cli 0.6 today.<br>\nMy neck is also severely screwed up, so I'm going to limit the time at my desk today and try to get just the basic-webserver release done.</p>",
        "id": 402995559,
        "sender_full_name": "Anton",
        "timestamp": 1700389491
    },
    {
        "content": "<p>Take care of yourself Anton! I'm sure others will be able to help if you are not able to work today.</p>",
        "id": 403000031,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1700392052
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"431893\">@Brian Carroll</span> <span aria-label=\"heart\" class=\"emoji emoji-2764\" role=\"img\" title=\"heart\">:heart:</span> I think I'll be alright, the basic-webserver should mostly/hopefully be waiting on CI and do minor fixes where necessary.</p>",
        "id": 403000867,
        "sender_full_name": "Anton",
        "timestamp": 1700392558
    },
    {
        "content": "<p>makes sense...sorry to hear about your neck, hope it feels better! <span aria-label=\"hearts\" class=\"emoji emoji-2665\" role=\"img\" title=\"hearts\">:hearts:</span></p>",
        "id": 403006309,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1700397055
    },
    {
        "content": "<p>It's a bit better, I'm keeping it wrapped up nice and warm :)</p>",
        "id": 403006445,
        "sender_full_name": "Anton",
        "timestamp": 1700397172
    },
    {
        "content": "<p>If you can release the 0.6.0 <a href=\"http://tar.bz\">tar.bz</a>. I think we can have others work through updating all the various locations. Given updates depend on the specific URL, people will still just use 0.5.1 until we change code. So should be fine to release and just update locations asynchronously</p>",
        "id": 403030179,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1700412509
    },
    {
        "content": "<p>Yeah, true, I'll kick off the brotli build</p>",
        "id": 403031268,
        "sender_full_name": "Anton",
        "timestamp": 1700413235
    },
    {
        "content": "<p>0.6 WIP pre-release brotli archive is <a href=\"https://github.com/roc-lang/basic-cli/releases/tag/0.6.0\">up</a>.<br>\nThoroughly tested on ubuntu but nowhere else yet.</p>",
        "id": 403037638,
        "sender_full_name": "Anton",
        "timestamp": 1700417199
    },
    {
        "content": "<p>5 examples tested on macos aarch64, all good. I'm going to do some more testing tomorrow morning. 0.6 docs should be up once any PR is merged on roc-lang/roc</p>",
        "id": 403045998,
        "sender_full_name": "Anton",
        "timestamp": 1700422274
    },
    {
        "content": "<p>Is there any reason why for basic-cli we have 0.6 listed as WIP and 0.5 as latest? Can I update the tutorial to use 0.6.2 which has the smaller optimized build and also includes a working Dir.list function?</p>",
        "id": 404724677,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1701207967
    },
    {
        "content": "<p>I still have to type up the release notes for 0.6, which is why it's still marked as pre-release. But it's fine to update the tutorial to 0.6.2, I'd recommend testing every snippet that uses Stdin.line</p>",
        "id": 404824678,
        "sender_full_name": "Anton",
        "timestamp": 1701251306
    },
    {
        "content": "<p>Why testing? Is there something you have in mind? I would, but just wondering if there is something your concerned about</p>",
        "id": 404831463,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1701253531
    },
    {
        "content": "<p><code>Stdin.line</code> has changed to also return <code>End</code> so it seems pretty likely some tutorial snippets will not run correctly anymore if you upgrade to 0.6.2</p>",
        "id": 404834752,
        "sender_full_name": "Anton",
        "timestamp": 1701254335
    }
]