[
    {
        "content": "<p>I just finished <a class=\"stream-topic\" data-stream-id=\"316715\" href=\"/#narrow/channel/316715-contributing/topic/Cleaning.20up.20GitHub.20Issues\">#contributing &gt; Cleaning up GitHub Issues</a> , and based on that, I have some recommendations on ways to clean up the labels in GitHub. The list of labels is pretty long, so cleaning it up could make easier to navigate the list, see more useful labels, and keep things tagged consistently. The triage role doesn't give me permission to edit labels in the repo, so this would fall on someone who does have that permission.</p>\n<h2>Recommend deleting:</h2>\n<p>These ones are pretty useless, just taking up space.</p>\n<ul>\n<li><code>cli-platform</code> unused, and cli-platform isn't in the <code>roc</code> repo.</li>\n<li><code>duplicate</code> unused, was a default github label</li>\n<li><code>invalid</code> only used once, not sure what it would even mean, was a default github label</li>\n<li><code>P-evolution</code> used on 3 closed issues, all of which already have <code>P-high</code>.</li>\n<li><code>perf-editor</code> Editor is defunct. Used on 3 closed issues, all of which have the <code>editor</code> label.</li>\n<li><code>plugin</code> Editor is defunct. Used on 2 closed issues, both of which have the <code>editor</code> label.</li>\n<li><code>planned</code> only used twice. There is lots of planned work but we're not using this to label it.</li>\n<li><code>polymorphic-expressions</code> Only used once. Too specific for a label.</li>\n<li><code>software-design</code> Only used once</li>\n<li><code>static-site-gen</code> unused, and it's not in this repo.</li>\n<li><code>WIP</code> Used 7 times, all closed. Can be represented by GitHub's draft PRs instead.</li>\n<li><code>wontfix</code> unused, was a default github label.</li>\n</ul>\n<h2>Consider deleting</h2>\n<p>Not quite as slam dunk to delete, but if you want to get more aggressive in shortening the list of labels, these would be good candidates.</p>\n<ul>\n<li><code>nightly</code> only used twice. Lots of issues mention nightly releases though. Should we be using this category?</li>\n<li><code>codegen-with-errors</code> Only used 3 times, pretty specific, all issues could use <code>code gen</code> instead.</li>\n<li><code>N-SSCCE</code> and <code>N-verification</code>. Lightly used, hard to keep up to date. Are they actually useful as part of the bug triaging process?</li>\n<li><code>roc_std</code> Only used twice. Is there a bigger category to put them in instead? Maybe the <code>platforms</code> label I suggest below?</li>\n</ul>\n<h2>Recommend adding/editing descriptions for:</h2>\n<p>Better descriptions would make it more likely that labels are used consistently.</p>\n<ul>\n<li><code>editor</code>: Should be marked as historical. \"(no longer used) The Roc editor\"</li>\n<li><code>public</code>: Should be marked as hsitorical. \"(no longer used) related to the repo going public\"</li>\n<li><code>miscompilation</code>: No description. Rarely used, probably because it's unclear what belongs in this category. Should it be deleted and just use bug instead?</li>\n<li><code>reporting</code>: No description. Not obvious what it's for just from the name, so needs a description. What's the difference between this and <code>error-messages</code>?</li>\n<li><code>testing</code>: A description could make it clear that this is about <code>roc test</code>, not about testing the compiler. It would also be good to describe why this is different than <code>expect</code>.</li>\n<li>There are also 18 other labels without descriptions. I like having descriptions for everything, but they're not causing confusion, so they're less important.</li>\n</ul>\n<h2>Consider new labels:</h2>\n<p>I saw a lot of issues related to these topics. New labels for them could be helpful:</p>\n<ul>\n<li><code>closures</code>: \"Lambda sets and closure captures\"</li>\n<li><code>platforms</code>: \"Issues with defining and calling platforms\"</li>\n<li><code>memory managment</code>: \"Reference counting and allocation in roc programs\"</li>\n</ul>",
        "id": 484119789,
        "sender_full_name": "Sky Rose",
        "timestamp": 1732421633
    },
    {
        "content": "<p>wowww, thank you so much for doing this!!! <span aria-label=\"heart eyes\" class=\"emoji emoji-1f60d\" role=\"img\" title=\"heart eyes\">:heart_eyes:</span>  <span aria-label=\"heart eyes\" class=\"emoji emoji-1f60d\" role=\"img\" title=\"heart eyes\">:heart_eyes:</span>  <span aria-label=\"heart eyes\" class=\"emoji emoji-1f60d\" role=\"img\" title=\"heart eyes\">:heart_eyes:</span></p>",
        "id": 484121451,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1732423440
    },
    {
        "content": "<p>maybe the <code>testing</code> label could become <code>roc test</code> for clarity?</p>",
        "id": 484121535,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1732423515
    },
    {
        "content": "<p>I think <code>reporting</code> could be merged into <code>error-messages</code></p>",
        "id": 484121544,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1732423533
    },
    {
        "content": "<p>I'm happy to update the labels, the reccomend ones look good. I dont know if they need much discussion.</p>",
        "id": 484121551,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1732423537
    },
    {
        "content": "<p>What's the difference between <a href=\"https://github.com/roc-lang/roc/labels/reporting\">reporting</a> and <a href=\"https://github.com/roc-lang/roc/labels/error-messages\">error messages</a>? I think I prefer <code>error messages</code> as that is clearer</p>",
        "id": 484128806,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1732431140
    },
    {
        "content": "<p>In theory I like merging error-messages and reporting, but GitHub doesn't have a way to merge labels. Deleting a label irreversibly removes the label from all its issues. You'd have to go through every issue with one of the labels to tag them with the other label, before deleting it.</p>\n<p><code>reporting</code> has 33 open issues and PRs and 24 closed. So it wouldn't be too hard to change them all manually. (<code>error-messages</code> has 80 open and 15 closed.)</p>\n<p>If you didn't want to change them manually, this would be silly, but you could rename <code>reporting</code> to like <code>error-messages-2</code> \"Also error messages, here for historical reasons\".</p>",
        "id": 484156958,
        "sender_full_name": "Sky Rose",
        "timestamp": 1732459565
    },
    {
        "content": "<p>There's a gh cli tool you can use locally to make listing and relabeling issues slightly less manual: <a href=\"https://cli.github.com/manual/gh_issue\">https://cli.github.com/manual/gh_issue</a> .</p>\n<p>here's an example to list first 50 issues with \"reporting\" label, and generate commands for each one to add the \"error-messages\" label</p>\n<div class=\"codehilite\"><pre><span></span><code>gh issue list -R roc-lang/roc -L 50 -l reporting | cut -f1 | sed &#39;s/.*/gh issue edit &amp; -R roc-lang\\/roc --add-label &quot;error-messages&quot;/&#39; &gt;relabel.sh\n</code></pre></div>\n<p>then check <code>relabel.sh</code>, and run it if it looks right. I like to split up the generate/run steps because it's too easy for this kind of thing to turn into \"oops, I relabelled all 9000+ issues\"</p>",
        "id": 484402123,
        "sender_full_name": "shua",
        "timestamp": 1732574442
    }
]