[
    {
        "content": "<p>I am interested in helping out with a <a href=\"https://github.com/roc-lang/roc/issues/6702\">compiler bug preventing custom abilities from being imported</a>.  Would this be feasible for someone new to the roc codebase?  For background, I've been using Rust daily at work and personal projects for over a year, but I have no experience with compiler development.  I've gotten my fork of the Roc compiler building locally and am able to reproduce the bug.  I've poked around the code for awhile but I don't think I'll make much headway without some context.  Any guidance is appreciated!</p>",
        "id": 482318564,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731566099
    },
    {
        "content": "<p>From my personal experience getting into the compiler, I think it would be pretty overwhelming to start with what is probably a pretty involved issue. You <em>could</em> do it, but you'd need to touch a lot of different domains. I've found it much easier to start with a smaller domain and touch more and more over time</p>",
        "id": 482341490,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1731575548
    },
    {
        "content": "<p>Also, in light of recent static dispatch discussions, I don't know if abilities will exist in Roc long-term. So you'd definitely help people <em>now</em> with current Roc, but you may find yourself working on something that goes away eventually if you pick up this issue</p>",
        "id": 482341776,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1731575632
    },
    {
        "content": "<p>However, don't let me stop you from contributing. If you aren't put off by a complex task being your first, I or someone else would be happy to talk through the general process of solving this kind of bug</p>",
        "id": 482342154,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1731575737
    },
    {
        "content": "<p>Oh shoot, I wasn't aware that abilities might not be here to stay.  I'll have to catch up on the static dispatch discussion after work today</p>",
        "id": 482403078,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731594042
    },
    {
        "content": "<p>I'm happy to contribute to anything that improves the stability of the compiler, doesn't have to be abilities.  I was just irritated by this particular bug because it's blocking me from trying out an idea for my platform.  I figured it was more useful to jump in and help than complain about it <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 482403984,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731594297
    },
    {
        "content": "<p>That's a good attitude!</p>",
        "id": 482416944,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1731597586
    },
    {
        "content": "<p>Static dispatch probably is still far enough out that if this bug annoys you it may be worth fixing. But yeah, I wouldn't be surprised if we have static dispatch by mid January assuming it's all agreed upon shortly. At the same time, it could easily be a year out if no one pushes on it cause abilities work and it has a lot of discussion.</p>",
        "id": 482438393,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1731603177
    },
    {
        "content": "<p>yeah I think static dispatch is lower priority than fixing canonicalization and lambda sets, so mid January sounds optimistic to me <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 482448128,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1731606084
    },
    {
        "content": "<p>This is one of the three pinned issues that would help with stability and if you have rust experience could tackle piecemeal while exploring the compiler. </p>\n<p><a href=\"https://github.com/roc-lang/roc/issues/2046\">https://github.com/roc-lang/roc/issues/2046</a></p>",
        "id": 482469756,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1731613607
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span>, that sounds like a great way to get my feet wet with the compiler code while also delivering some incremental value!</p>",
        "id": 482497404,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731624959
    },
    {
        "content": "<p>Before chipping away at the panics/expects/etc., I took a stab at enforcing through CI that the total number doesn't increase: <a href=\"https://github.com/roc-lang/roc/pull/7221\">https://github.com/roc-lang/roc/pull/7221</a></p>",
        "id": 482544844,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731654422
    },
    {
        "content": "<p>Ah crap, I'll troubleshoot the failing job in the morning.  But I'd say the high-level approach is still ready for review.</p>",
        "id": 482545652,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731654840
    },
    {
        "content": "<p>I'm also totally cool if we think this is too heavy-handed and we don't want to add it.  It just seemed like there was interest for something like this in the issue thread, so I ran with it.</p>",
        "id": 482545918,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731654972
    },
    {
        "content": "<p>This would definitely be a good add! We've definitely seen a user experience gap because of panics in the compiler, and this would help us move towards zero panics (and stay there)</p>",
        "id": 482546122,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1731655083
    },
    {
        "content": "<p>Any tips for iterating on a pipeline job so you guys don't have to manually approve the workflows on each commit? <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 482650880,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731688469
    },
    {
        "content": "<p>I think if you make a PR on your own fork you should be able to run your workflow without needing approval</p>",
        "id": 482651256,
        "sender_full_name": "Anton",
        "timestamp": 1731688581
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"361169\">@Anton</span>!  I believe got all the issues sorted out through trial and error on my fork.  Gotta love troubleshooting in CI <span aria-label=\"melt\" class=\"emoji emoji-1fae0\" role=\"img\" title=\"melt\">:melt:</span></p>",
        "id": 482669441,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731694551
    },
    {
        "content": "<p>The PR linked above should be officially ready to review!</p>",
        "id": 482669543,
        "sender_full_name": "Tanner Nielsen",
        "timestamp": 1731694577
    }
]