[
    {
        "content": "<p>I've been looking for a small typed language that I could embed in rust, I'm aware gluon exists but I'd like it to be compiled and interop easily with rust. Could that be possible with roc? And if so where would I start looking to make it happen?</p>",
        "id": 399043580,
        "sender_full_name": "Murariu Fabian",
        "timestamp": 1698494197
    },
    {
        "content": "<p>Yes! We have a \"platforms and applications\" model where Roc is the application and Rust can implement the platform. In fact it's the most common choice.<br>\nHave a look in the examples directory in the main Roc repo. And the basic-cli repo. Both under roc-lang on GitHub.</p>",
        "id": 399048359,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1698497697
    },
    {
        "content": "<p>yeah roc is designed to be easy to call from other languages, and actually Rust is currently the best-supported one <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 399050440,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698499123
    },
    {
        "content": "<p>we don't yet have good documentation on how to do it, though - but happy to answer questions here and help you get started!</p>",
        "id": 399050482,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698499164
    },
    {
        "content": "<p>I am a bit confused about the starting point, I'd like to start from rust and generate at runtime a roc program that I can then compile and execute. I'm aware roc has great interop and the notion of platform which fits perfectly with my needs. But I don't see how I could create a roc compiler at runtime from rust then get something like a function that I could call</p>",
        "id": 399055988,
        "sender_full_name": "Murariu Fabian",
        "timestamp": 1698503204
    },
    {
        "content": "<p>can you say more about what you're building? I'd love to learn more about where the roc program is being generated from!</p>",
        "id": 399056380,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698503480
    },
    {
        "content": "<p>I'd like to drive query execution from roc, where I'd convert something like Cypher or SQL into roc code. I'd like to avoid having to go as low as LLVM. Admittedly I don't know if there are any advantages vs just vectorised execution. I suppose with roc I'd go via a hybrid approach where roc would drive the underlying rust calls to vectorised functions</p>",
        "id": 399056970,
        "sender_full_name": "Murariu Fabian",
        "timestamp": 1698503903
    },
    {
        "content": "<p>I'm not familiar with Cypher, but in the case of SQL - would the Rust program be converting SQL into Roc code at runtime and then executing the Roc code on a database?</p>",
        "id": 399061531,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698506937
    },
    {
        "content": "<p>That's the idea</p>",
        "id": 399062318,
        "sender_full_name": "Murariu Fabian",
        "timestamp": 1698507552
    },
    {
        "content": "<p>interesting! So what would be the advantage of having generated Roc running on the database instead of SQL? Is the idea that you'd mix handwritten Roc code with Roc code generated from SQL, and run both on the same database?</p>",
        "id": 399063123,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1698508423
    },
    {
        "content": "<p>I think you misunderstood, I'm building a database from scratch and there are 2 ways for query execution (that I care about) one is building an AST from the physical operators and just executing it by tree walking. The other way is compile the physical operators into code that represents what the query needs doing, like <a href=\"https://15721.courses.cs.cmu.edu/spring2019/papers/19-compilation/p539-neumann.pdf\">this</a> or like <a href=\"https://www.cs.purdue.edu/homes/rompf/papers/tahboub-sigmod18.pdf\">this</a></p>",
        "id": 399068208,
        "sender_full_name": "Murariu Fabian",
        "timestamp": 1698512831
    },
    {
        "content": "<p>Interesting, this definitely could be done with roc, but I am not sure how smoothly it would work currently. Essentially, you would generate the roc code (It would always references the same platform primitives, which is your database). Then you would compile the code to a shared library and load it. Finally, you would just call into/run it.</p>",
        "id": 399069948,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698514594
    },
    {
        "content": "<p>This could be done with the dev backend to avoid llvm, though not sure it would be faster than a tree walking interpretter.</p>",
        "id": 399069984,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698514631
    },
    {
        "content": "<p>Otherwise, you could run llvm fully. That would get you perf, but compilation time may be too long in many cases.</p>",
        "id": 399070001,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698514654
    },
    {
        "content": "<p>I'm looking at large datasets some queries could take minutes, the reason I'm looking at roc is because I don't want to build the entire thing from scratch just with LLVM</p>",
        "id": 399070970,
        "sender_full_name": "Murariu Fabian",
        "timestamp": 1698515582
    },
    {
        "content": "<p>Ah, if these queries are super long, then yeah, compilation time shouldn't matter much. Definitely seems doable.</p>",
        "id": 399071886,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698516335
    },
    {
        "content": "<p>cool, where about would I look to get this going?</p>",
        "id": 399073031,
        "sender_full_name": "Murariu Fabian",
        "timestamp": 1698517482
    },
    {
        "content": "<p>as in the roc codebase</p>",
        "id": 399073050,
        "sender_full_name": "Murariu Fabian",
        "timestamp": 1698517519
    },
    {
        "content": "<p>I think the only thing we have that generates Roc source code is the formatter. It uses the AST which you would need too.</p>",
        "id": 399074064,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1698518488
    },
    {
        "content": "<p>I'll try to find some links for you</p>",
        "id": 399074073,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1698518503
    },
    {
        "content": "<p><a href=\"https://github.com/roc-lang/roc/blob/main/crates/cli/src/format.rs\">https://github.com/roc-lang/roc/blob/main/crates/cli/src/format.rs</a></p>",
        "id": 399074161,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1698518568
    },
    {
        "content": "<p><a href=\"https://github.com/roc-lang/roc/blob/main/crates/compiler/fmt/src/lib.rs\">https://github.com/roc-lang/roc/blob/main/crates/compiler/fmt/src/lib.rs</a></p>",
        "id": 399074409,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1698518803
    },
    {
        "content": "<p><a href=\"https://github.com/roc-lang/roc/blob/main/crates/compiler/parse/src/lib.rs\">https://github.com/roc-lang/roc/blob/main/crates/compiler/parse/src/lib.rs</a></p>",
        "id": 399074504,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1698518891
    },
    {
        "content": "<p>Oh, I was thinking he would just textually generate roc source code in rust, but I guess it could also be done in a more structured way</p>",
        "id": 399075582,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698519933
    },
    {
        "content": "<p>As for the other stuff, I think the closest we have to an example currently is in tests. In some tests we compile to a shared library and loading in rust to text the roc compiler is working.</p>",
        "id": 399075649,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698519977
    },
    {
        "content": "<p>But fundamentally you would be compiling roc with <code>--lib</code> and directly using the shared library</p>",
        "id": 399075706,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698520061
    },
    {
        "content": "<p>In general, I would advise first making sure you know how to use <code>libloading</code> and executing code from a shared library in rust.</p>",
        "id": 399076472,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698520809
    },
    {
        "content": "<p>Then switch to using a roc shared library</p>",
        "id": 399076479,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698520817
    },
    {
        "content": "<p>then add in the roc codegen part.</p>",
        "id": 399076488,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1698520826
    },
    {
        "content": "<p>thanks, I'll have a look at the AST, I was hoping to find some tests that use the AST, <code>libloading</code> is still a mystery to me</p>",
        "id": 399077489,
        "sender_full_name": "Murariu Fabian",
        "timestamp": 1698521880
    }
]