[
    {
        "content": "<p>I created a PR <a href=\"https://github.com/roc-lang/roc/pull/4322\">#4322</a> for updating documentation for Str builtin. I like it when the docs have an <code>expect</code> function as I find it clearer how it works and I like copying to the REPL, or my code to play with it. Can I ask someone to have a look and let me know if I'm on the right path so far? I don't want to get too far if the style I've used is wrong. Note I'm not removing any of the content that is already there.</p>",
        "id": 303989994,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1665738338
    },
    {
        "content": "<p>One thing I had noticed was a comment around code snippets <a href=\"https://github.com/roc-lang/roc/issues/2585\">#2585</a>. Should the <code>expect</code> lines be left as is  e.g. <code>## &gt;&gt;&gt; expect Str.isEmpty \"hi!\" == Bool.false</code> or should I change them to be a code-snippet like <code>##     expect Str.isEmpty \"hi!\" == Bool.false</code>?</p>",
        "id": 303991380,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1665738894
    },
    {
        "content": "<p>I completed my edits for the Str builtin. I also made some minor edits in Num builtin. In the end I decided to stick with the ## expect ... format with 5 spaces as that enables type checking to work correctly. I tried to ensure all the types were formatted with [Str] and all functions were formatted \\`my function\\`.</p>\n<p>This should be ready for review. My intention is to create another PR if I do another builtin.</p>",
        "id": 304153563,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1665811181
    },
    {
        "content": "<p>All the functions have an <code>expect</code> showing how it works with returns values. And where relevant I included examples of <code>Err</code>.</p>",
        "id": 304153636,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1665811274
    },
    {
        "content": "<p>Excellent UX improvement <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span>! I'm doing the final review right now.</p>",
        "id": 304161135,
        "sender_full_name": "Anton",
        "timestamp": 1665818847
    },
    {
        "content": "<p>I've been trying to figure our why CI is failing. Looks the CI is complaining about an issue in <code>Dict.roc</code> with a missing implementation for <code>listGetUnsafe : List a, Nat -&gt; a</code>. It seems strange that it passed all the checks for <a href=\"https://github.com/roc-lang/roc/pull/4318\">PR #4318</a> which is where it was added, but is failing now. I haven't figured out what has changed since then. Maybe I shouldn't have merged <code>main</code> into that branch?</p>",
        "id": 304165025,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1665821240
    },
    {
        "content": "<p>Merging in main should not be a problem, I'll take a look.</p>",
        "id": 304169481,
        "sender_full_name": "Anton",
        "timestamp": 1665824140
    },
    {
        "content": "<p>All good now :)</p>",
        "id": 304178113,
        "sender_full_name": "Anton",
        "timestamp": 1665828888
    }
]