[
    {
        "content": "<p>thinking about how many platforms need to be changed every time we update something about how hosts work (e.g. Folkert's calling convention improvement), or we're about to need <code>roc_dbg</code> for <code>dbg</code> to use <code>Inspect</code>), it would be great if we reduced the quantity of different platforms in the repo that needed to be updated.</p>\n<p>I think it makes sense to have:</p>\n<ul>\n<li>platforms loaded from URLs in <code>examples/</code></li>\n<li>one portion of <code>examples/</code> that's specifically about platform switching (which also demonstrates how to get a platform locally instead of from a URL)</li>\n<li>test cases which run local platforms - but a lot of these could probably share one local platform instead of each having their own</li>\n</ul>",
        "id": 404463024,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1701107854
    },
    {
        "content": "<p>what do others think?</p>",
        "id": 404463030,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1701107857
    },
    {
        "content": "<p>Sounds good to me</p>",
        "id": 404463792,
        "sender_full_name": "Ayaz Hafiz",
        "timestamp": 1701108122
    },
    {
        "content": "<p>I guess one note, changing to url platforms actually just makes things worse. They will break on these changes but be more work/delay to update.</p>",
        "id": 404464348,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1701108298
    },
    {
        "content": "<p>true, but we have to do the same amount of work to fix those anyway <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 404464713,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1701108437
    },
    {
        "content": "<p>Well, we just can't block merging on the examples passing. Because otherwise we can't make a compiler change that changes the platform API while still having examples with old platforms passing.</p>",
        "id": 404465107,
        "sender_full_name": "Ayaz Hafiz",
        "timestamp": 1701108595
    },
    {
        "content": "<p>Yeah, but now they are scattered and need a release process instead of just direct changes in the roc repo</p>",
        "id": 404465113,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1701108596
    },
    {
        "content": "<p>Wouldn't it make more sense to put all that common code into a shared directory in the repo?<br>\nOne Zig file and one Rust crate that all the hosts can import and re-export.</p>\n<p>Zig and Rust both have their own mechanisms for sharing code. It doesn't have to be a Roc-specific mechanism.</p>\n<p>Then we can also make slight differences between the platforms where needed. And we can still make atomic commits to upgrade everything at once.</p>",
        "id": 404485147,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1701117151
    },
    {
        "content": "<p>Did we resolve a plan here? I'm not sure if we settled on a decision with this discussion?</p>",
        "id": 404739281,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1701215041
    },
    {
        "content": "<p>Another idea, what about moving the platforms to <a href=\"https://github.com/roc-lang/examples/tree/main\">https://github.com/roc-lang/examples/tree/main</a> and making a platforms folder there? We can include a README which explains more about these. Do we need any of the current examples for tests?</p>",
        "id": 404739561,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1701215180
    },
    {
        "content": "<p>With this idea we could remove examples entirely or leave a README pointing to the repository.</p>",
        "id": 404739674,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1701215252
    },
    {
        "content": "<p>This might make upgrades simpler as these platforms might fall behind, but they wont hold up CI on roc, and can be update in a follow-up PR on the example repository.</p>",
        "id": 404739769,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1701215297
    },
    {
        "content": "<p>I think it definitely makes sense to move all the other language examples (ruby, python, java...) to the examples repo. Perhaps we should keep nodejs-interop in the main repo <span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span>?</p>",
        "id": 404826153,
        "sender_full_name": "Anton",
        "timestamp": 1701251855
    }
]