[
    {
        "content": "<p>I'd like a second opinion on the decision to no longer format malformed input in snapshots. </p>\n<p>On one hand we will have less noise in our snapshots as we fix things, on the other we lose the confidence that things are formatting stable right?</p>\n<p><span class=\"user-mention\" data-user-id=\"453336\">@Joshua Warner</span> do you have any thoughts?</p>",
        "id": 536700679,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1756427619
    },
    {
        "content": "<p>I'd like to format malformed input because I want to make sure it's not discarding information</p>",
        "id": 536700750,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1756427671
    },
    {
        "content": "<p>I think for now we should just bail and refuse to format malformed input. As a second phase, we can format the top level defs that are not malformed.</p>",
        "id": 536702330,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756429084
    },
    {
        "content": "<p>In my experience, the general problem of formatting malformed input is just a really hard problem.</p>",
        "id": 536702395,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756429155
    },
    {
        "content": "<p>There are just too many ways the input can be malformed, and it’s really hard to make sure that our rendition of it doesn’t interact strangely with some property of the rest of the input (and make things worse)</p>",
        "id": 536702494,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756429248
    },
    {
        "content": "<p>(this was a big source of fuzzing problems in the old compiler, and ultimately I’m not sure if it was worth it)</p>",
        "id": 536705804,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756432313
    },
    {
        "content": "<p>I think it's fine to refuse to format malformed <em>nodes</em>, but what I want to avoid is refusing to format the entire file if any node is malformed</p>",
        "id": 536706923,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1756433209
    },
    {
        "content": "<p>Agree, but refusing to format at all is better than having a buggy formatter in the presence of malformed nodes - and that’s likely unless we have a very concerted effort.</p>",
        "id": 536707207,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756433478
    },
    {
        "content": "<p>I don't understand what's buggy about just like - take the <code>Region</code> of the malformed node and literally <code>@memcpy</code> those bytes into the output buffer and continue</p>",
        "id": 536707254,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1756433538
    },
    {
        "content": "<p>like don't try to fix the indentation or anything like that, just if it's malformed we copy it over as-is, and it probably looks totally wrong, but that's fine because it's malformed</p>",
        "id": 536707278,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1756433567
    },
    {
        "content": "<p>and maybe it messes up the stuff around it, and that's fine too because it's malformed</p>",
        "id": 536707294,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1756433585
    },
    {
        "content": "<p>the important part being that if you have a malformed node somewhere earlier in your source code - e.g. the classic culprit of <code>&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;</code> from a merge conflict marker - it doesn't destroy your ability to have a nice experience editing the rest of your file</p>",
        "id": 536707479,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1756433749
    },
    {
        "content": "<p>the blast radius of brokenness is isolated to just the area right around the malformed node</p>",
        "id": 536707508,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1756433775
    },
    {
        "content": "<p>maybe I'm missing something about why that would be error-prone but it sounds very striaghtforward to me! <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 536707523,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1756433793
    },
    {
        "content": "<p>With PNC I think the potential malformed weirdness is generally more bounded than before PNC (and braces). The general shape of the problem is that you can have something that the format changes immediately outside of the malformed block that causes the malformed block itself to be parted differently, perhaps as a different malformed thing or even well formed now - pushing the malformed section elsewhere.</p>",
        "id": 536708019,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756434202
    },
    {
        "content": "<p>The git merge markers are a great example for another reason: if we format those badly, we might invalidate them and confuse other tools ( like editors)</p>",
        "id": 536708127,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756434263
    },
    {
        "content": "<p>For example, it would be bad if one of those got indented or the new line before/after it removed.</p>",
        "id": 536708209,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756434331
    },
    {
        "content": "<p>It’s a bit like undefined behavior: anything can be going on in the malformed node, and there’s no guarantee that after formatting that the “undefined” behavior will be still contained to that same node.</p>",
        "id": 536708313,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756434444
    },
    {
        "content": "<p>Obviously, the behavior stays the same if literally nothing else about the code changes, but if that’s the case, there’s no point in formatting anyway</p>",
        "id": 536708384,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1756434514
    },
    {
        "content": "<p>19 messages were moved here from <a class=\"stream-topic\" data-stream-id=\"316715\" href=\"/#narrow/channel/316715-contributing/topic/Pull.20Request.20for.20Review/with/536658147\">#contributing &gt; Pull Request for Review</a> by <span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span>.</p>",
        "id": 536708417,
        "sender_full_name": "Notification Bot",
        "timestamp": 1756434555
    },
    {
        "content": "<p>One thing I intended for the snapshots was to also validate behaviour for unhappy paths like <code>&lt;&lt;&lt;&lt;&lt;</code> merge markers. That was what prompted me to ask this question, because I feel like it is helpful to see the formatter behaviour in our snapshots. </p>\n<p>How we do that I'm not sure, but it sounds like either way we don't want a \"MALFORMED INPUT\" <span class=\"user-mention\" data-user-id=\"639239\">@JRI98</span>... is that right?</p>",
        "id": 536708654,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1756434780
    },
    {
        "content": "<p>yeah, fwiw I have a branch that's changing a bunch of stuff at once, so I'll roll this into that</p>",
        "id": 536708912,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1756435030
    },
    {
        "content": "<p>Now that I think of it, I shouldn't have sent that change in the same PR. But it came after this short discussion <a class=\"message-link\" href=\"/#narrow/channel/395097-compiler-development/topic/zig-compiler.20-.20Formatter.20and.20style/near/536179002\">#compiler development &gt; zig-compiler - Formatter and style @ 💬</a><br>\nMy rationale is that in the normal formatting flow, outside of snapshots, the current behavior is to bail out when there are parser errors. So, the <code>FORMATTED</code> section of a snapshot being broken doesn't mean that the same will happen when formatting a file via de CLI. Now, if the behavior of the CLI would change, that would be different, but as it is right now, my change would just be mimicking the formatting behavior in other places.</p>",
        "id": 536727120,
        "sender_full_name": "JRI98",
        "timestamp": 1756449828
    }
]