[
    {
        "content": "<p>I'm helping Anton with the new <code>roc-lang/examples</code> repository, and it would be really helpful to get some feedback from the community with ideas. The goal is to populate the repo with meaningful content so that it provides value to the community, and also tests Roc design assumptions.</p>\n<p>It would be really helpful if you can think of one or more ideas and drop them in a comment below. Bonus points if you can make a working example and share a gist too. <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>\n<p>The Examples repository should provide working code that solves a specific need for a user. It should be as easy as navigating to a relevant example, copying it into a file, and now you have working code! </p>\n<p>The aim is to support a variety of needs such as; application templates, content for guides and tutorials, and helpful scripts etc.</p>\n<p>Other thoughts;</p>\n<ul>\n<li>Try to describe <strong>what</strong> the example does, and <strong>why</strong> would you use it?</li>\n<li>It should be something that you would personally copy or share with someone</li>\n<li>The platform and any packages are URLs, not relative links, so it just works™</li>\n</ul>\n<p>Here are some examples of examples that I can think of to seed your creativity;</p>\n<ul>\n<li><strong>WHAT:</strong> Hello-World or similar minimal app. <strong>WHY:</strong> use it for teaching, so I can link to it from a tutorial or guide and share with people who are new to the language, or new to programming.</li>\n<li><strong>WHAT:</strong> Lists the files and folders in a directory. <strong>WHY:</strong> use it as a template for when I want to take a directory as an argument, or process multiple files such as parsing data.</li>\n<li><strong>WHAT:</strong> Run <code>roc check</code>, <code>roc test</code>, and then <code>roc build --bundle</code> on a specific Roc package. <strong>WHY:</strong> a script I would like to use in a CI action to bundle and share a package.</li>\n</ul>",
        "id": 341377015,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1678687587
    },
    {
        "content": "<p>I think cookbooks like these can also provide a lot of inspiration:<br>\n<a href=\"https://www.oreilly.com/library/view/python-cookbook-3rd/9781449357337/\">https://www.oreilly.com/library/view/python-cookbook-3rd/9781449357337/</a><br>\n<a href=\"http://scalacookbook.com/\">http://scalacookbook.com/</a></p>",
        "id": 341434269,
        "sender_full_name": "Anton",
        "timestamp": 1678707108
    }
]