[
    {
        "content": "<p>hey folks! I was wondering if help was needed with updating any docs/guides/examples to the new syntax?</p>\n<p>is the syntax stable enough for that? were you planning on doing this automatically somehow using AI stuff?</p>\n<p>I'm available to help out with stuff that don't need Zig expertise :)</p>",
        "id": 573468170,
        "sender_full_name": "Georges Boris",
        "timestamp": 1770887397
    },
    {
        "content": "<p>I have a project for this effort: <a href=\"https://github.com/rickhull/roc-init\">https://github.com/rickhull/roc-init</a>   I am fairly new to Roc, and this project is very much an LLM-driven effort.  Please poke around, and PRs are welcome, and direct repo access is on the table as well.</p>",
        "id": 573526668,
        "sender_full_name": "Rick Hull",
        "timestamp": 1770904340
    },
    {
        "content": "<p>It's maybe too early to for roc-lang to start committing to maintaining official docs for <code>new-roc</code>, implying a level of support and stability that may not exist, so this project is a little bit of a pit stop where things can be worked on, verified, vouched and confirmed, before graduating to official docs, at the right time, if ever. It is meant to inform the approach to official docs, when the time is right</p>",
        "id": 573527000,
        "sender_full_name": "Rick Hull",
        "timestamp": 1770904420
    },
    {
        "content": "<p>Some discussion here: <a class=\"stream-topic\" data-stream-id=\"304902\" href=\"/#narrow/channel/304902-show-and-tell/topic/roc-init.20repo/with/573108370\">#show and tell &gt; roc-init repo</a>    (should we move any further discussion out of the <code>show and tell</code> channel?)</p>",
        "id": 573528360,
        "sender_full_name": "Rick Hull",
        "timestamp": 1770904762
    },
    {
        "content": "<p>oh! got it!</p>\n<p>I was following <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span> 's messages on those new compiler updates. IIRC it says the work on docs/guides did not yet start... So if <code>roc-init</code> is the \"currently/temporarily official\" playground for this stuff, maybe it could be mentioned there? <span aria-label=\"blush\" class=\"emoji emoji-1f60a\" role=\"img\" title=\"blush\">:blush:</span></p>",
        "id": 573623572,
        "sender_full_name": "Georges Boris",
        "timestamp": 1770932972
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"364014\">@Georges Boris</span> good to see you again <span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> </p>\n<p>I don't think we are ready right now to update the docs/guides/examples to the new syntax. I've been itching to jump into this myself but we are currently ironing out some bugs before we continue the basic-cli migration. </p>\n<p>I mentioned in my announcement more as an FYI that these things don't exist yet, so working in the new Roc space is a difficult thing right now if you aren't super involved in all the PR's rolling through and the zig compiler. </p>\n<p>I think as a milestone we should complete basic-cli and then we can really unlock working all these other things like exercism or examples. </p>\n<p>I've held off working on bsic-cli the last few weeks and prioritized show stopping bugs or features like the dev backends.</p>",
        "id": 573624259,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1770933260
    },
    {
        "content": "<p>The syntax is definitely very stable... but without the platforms being upgraded and docs landed it's pretty challenging.</p>",
        "id": 573624484,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1770933350
    },
    {
        "content": "<p>We are very close though... it's hard to predict. I would say we are dealing with the most complexity right now and so the uncertainty is also at a maximum point.</p>\n<p>When we have all the backends (dev, wasm, llvm, interpreter) passing all the tests and evaluating the same answers, without any ref-counting leaks... we will have effectively resolved all the complexity and from there on it's just a matter of wiring the remaining things together and polishing.</p>",
        "id": 573626500,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1770934076
    },
    {
        "content": "<p>got it! I completely understand this messy moment that is just too much effort to explain people on the outside... the most sane thing is just to go past it, remove complexity and then onboard people.</p>",
        "id": 573626845,
        "sender_full_name": "Georges Boris",
        "timestamp": 1770934215
    },
    {
        "content": "<p>if there is anything you think could use the extra hands without burdening you folks - let me know! otherwise I'm happy to wait until the right time :)</p>",
        "id": 573627013,
        "sender_full_name": "Georges Boris",
        "timestamp": 1770934278
    },
    {
        "content": "<blockquote>\n<p>if there is anything you think could use the extra hands without burdening you folks - let me know! otherwise I'm happy to wait until the right time :)</p>\n</blockquote>\n<p>If you saw the discussion in the other channel, I have a TODO to take Anton's verification of SUSPICIOUS_REFERENCES and to fix those by hand.  I will probably get to that in a week.  You could take a look if interested, and I can answer any questions.</p>",
        "id": 573641753,
        "sender_full_name": "Rick Hull",
        "timestamp": 1770942135
    }
]