[
    {
        "content": "<p>is someone working on an html/browser platform?</p>\n<p>I'm interested in contributing to this ecosystem by starting to create some packages for that domain even if the platform itself is far from ready. would that make sense at this moment? should I wait?</p>\n<p>I'm the creator of elm-book and I'm also preparing a suite of other UI libs for Elm. I'd be glad to maintain similar ones for the Roc world.</p>",
        "id": 289097331,
        "sender_full_name": "Georges Boris",
        "timestamp": 1657452031
    },
    {
        "content": "<p>Hi Georges! Nobody's working on that at the moment, no. Would be great to have you involved! Some thinking has been done about it though, by Richard and myself and maybe others.</p>",
        "id": 289097618,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1657452422
    },
    {
        "content": "<p>The Elm architecture won't work well exactly as-is, for various reasons. Richard wrote up a document about it here <a href=\"https://docs.google.com/document/d/16qY4NGVOHu8mvInVD-ddTajZYSsFvFBvQON_hmyHGfo/edit\">https://docs.google.com/document/d/16qY4NGVOHu8mvInVD-ddTajZYSsFvFBvQON_hmyHGfo/edit</a></p>",
        "id": 289097621,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1657452424
    },
    {
        "content": "<p>That's a good place to start. It's fairly long but worth a read before getting into this.</p>",
        "id": 289097648,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1657452472
    },
    {
        "content": "<p>I did a project a while ago to port Elm to Wasm. I managed to get Richard's Elm SPA Example to compile and run. The performance was roughly similar to JS. The biggest bottleneck <em>by far</em> is encoding JS values to bytes and decoding them back again. The architecture of a front end framework for Roc would need to be designed around how to minimise these \"border crossings\".</p>",
        "id": 289097816,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1657452700
    },
    {
        "content": "<p>I have lots of experience with this sort of thing from that previous project and would be happy to help.</p>",
        "id": 289097861,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1657452729
    },
    {
        "content": "<p>Click handler functions are tricky, for example. The design I have in mind is that the JS handler attached to the DOM node would simply send an integer ID to the Wasm module to indicate \"event handler 123 fired\". Then the Wasm module would look up some sort of dictionary of lambdas to call.</p>",
        "id": 289097970,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1657452951
    },
    {
        "content": "<p>But the user might want to decode the JS event object. Unfortunately those event object contain circular references so are not actually serializable. You have to get the app developer to provide a list of fields to decode, then <code>JSON.stringify</code> only those fields and write them into the Wasm module for further JSON deserialization.</p>",
        "id": 289098024,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1657452999
    },
    {
        "content": "<p>thank you! just read through it -</p>\n<ul>\n<li>\n<p>this is just a illustrative tutorial to understand how things would work, right? Is there any code related to it even if incomplete?</p>\n</li>\n<li>\n<p>one thing I'm not getting is how would an UI platform be shared. can a Roc application use N platforms at the same time? so I could, as an example, use a native UI platform and also use something that is related to databases or something like that? html and the browser are two different things right but Elm uses both as the \"platform\".</p>\n</li>\n<li>\n<p>*rant.. whyyy use things like Str and Elem <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span> saving 3 letters in place of legibility doesn't make sense to me. it is my only pet peeve related to Roc.</p>\n</li>\n</ul>",
        "id": 289127173,
        "sender_full_name": "Georges Boris",
        "timestamp": 1657492040
    },
    {
        "content": "<p>Have a look in <code>examples/gui</code> in the repo.<br>\nAn app can only use one platform at a time.</p>",
        "id": 289127806,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1657492809
    }
]