[
    {
        "content": "<p>folks, I wasn't sure if I should post it here or on ideas but it is not really a feature idea.</p>\n<p>I was just wondering if it would make sense to have some sort of \"design status\" per language feature that might indicate how much discussion around the feature is productive or distracting.</p>\n<p>for example, abbreviations for core modules and types like Str and Num are already defined so it doesn't make sense to continue on discussing that. maybe, after recent discussions, the same can be applied to the <code>if</code> syntax.</p>\n<p>I know everything is still mutable no matter when, it just becomes more costly and since the language is getting closer and closer to a status of \"production use therefore stability is more expected\" it might be worth it to communicate clearly about that to avoid frustrating new contributors.</p>",
        "id": 351272994,
        "sender_full_name": "Georges Boris",
        "timestamp": 1681985671
    },
    {
        "content": "<p>I think it's hard to predict which things will become topics of discussion <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 351307784,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1681993332
    },
    {
        "content": "<p>I figured higher-kinded types and rank-N types would come up, so I made FAQ entries for them very early on</p>",
        "id": 351307853,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1681993351
    },
    {
        "content": "<p>but to be honest I never predicted <code>else if</code> would be something that would ever be discussed! (For example because I don't remember ever seeing a discussion about it in Elm)</p>",
        "id": 351307990,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1681993381
    },
    {
        "content": "<p>so I'm not sure how much time it would save to try to create and maintain documentation like that in practice</p>",
        "id": 351308119,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1681993412
    },
    {
        "content": "<p>not exactly a list but maybe a \"language status\" paragraph like - \"we're at the point where we are still debating experimental features like abilities and platform-related API's for effects and error handling, but the core pieces of the language are mostly in place and we're not planning on changing things like core module names and features syntaxes unless an unknown problem is discovered\"</p>",
        "id": 351310219,
        "sender_full_name": "Georges Boris",
        "timestamp": 1681993862
    },
    {
        "content": "<p>I worry that this might discourage some people from contributing ideas. I love that Zulip is low friction and anyone can throw an idea around and be a part of the discussion. There been a number of times I've posted something thinking it was a silly question, and it turned out to be helpful. The community has been very helpful and friendly. I appreciate the honest fewdback, and have learnt a lot about the intent and method behind the design as these design discussions unfold. I hope we can continue to have language chats, and throw crazy ideas around.</p>",
        "id": 351315931,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1681995123
    }
]