[
    {
        "content": "<p>Considering the ongoing rewrite of the compiler in Zig, I was wondering if there were any plans to rewrite the LSP too. I was looking at the LSP TODOs and, having a bit of experience with writing LSP, I thought I could contribute as well. Though being more interested in Zig over Rust I thought it might be worth starting a Zig rewrite on the side and work from there. Would that be worthwhile or is it better to just contribute to the existing Rust code?</p>",
        "id": 558815180,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1763818227
    },
    {
        "content": "<p>Zig for sure, and actually in the compiler code base! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>\n<p>I want to bake a lot of this functionality into the compiler, and in the future expose it in a way that can be used for more than just LSP. But as a starting point we can target LSP directly.</p>",
        "id": 558815950,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1763818959
    },
    {
        "content": "<p>happy to chat about it if you'd like some direction getting started!</p>",
        "id": 558816043,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1763819092
    },
    {
        "content": "<p>Thats perfect! I'd love to chat and start tackling this. I'll definitely make a fork of the compiler repo and work on something from there in the same codebase. How should I get started? By the way Im gonna be offline for a little while, Im on some messed up reverse sleep schedule today</p>",
        "id": 558816294,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1763819366
    },
    {
        "content": "<p>Hi Etienne, I'd be very interested in lending a hand with the LSP if you'd be down. I have a vested interest in the NeoVim Roc LSP experience bahaha.</p>",
        "id": 558906664,
        "sender_full_name": "Edwin Santos",
        "timestamp": 1763915932
    },
    {
        "content": "<p>Sounds great! I could definitely use the help ahah I actually have the scaffolding committed on my fork at the moment. It has the transport layer, the data structure and a very basic server with none of the capabilities yet apart from <code>initialized</code> and <code>exit</code>. I will likely make a pull request soon so we can start integrating some functionalities one by one. Im just doing a bit more thorough testing and documenting. It does currently get detected by Neovim though with <code>:LspInfo</code></p>",
        "id": 558907685,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1763917056
    },
    {
        "content": "<p>Sounds great! Would you have time for a quick call in the next couple days just so I can get on the same page as you? Wanted to hack away on something since I have a long weekend next weekend haha. Very excited!</p>",
        "id": 558910141,
        "sender_full_name": "Edwin Santos",
        "timestamp": 1763919421
    },
    {
        "content": "<p>For sure! I should have time tomorrow during daytime EST if that works with you. If not, better even for me is Thursday evening.</p>",
        "id": 558911470,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1763920878
    },
    {
        "content": "<p>Kind of a messy schedule here, juggling between 40hr/week software dev job, full time university and a girlfriend</p>",
        "id": 558911626,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1763921031
    },
    {
        "content": "<p>Yeah, lemme know if you wanna do around 12 at lunch or maybe 5 PM, I'm also EST. If you're too busy tho that's fine, you can post your PR/post when you merge and I'll pull and start looking at everything. I'm also working so yeah async communication may be easiest to coordinate on the LSP.</p>",
        "id": 558926886,
        "sender_full_name": "Edwin Santos",
        "timestamp": 1763936497
    },
    {
        "content": "<p>12 is good! I might have to make the PR happen early in the morning though. Just got off a double shift so my brain is fried and theres some technical tweaks I want to do. Gonna sleep it off and wake up at around 4am so I'll get something out way before 12</p>",
        "id": 558927431,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1763937121
    },
    {
        "content": "<p>By the way, we might want to take this convo into the DM. Some people might have other things to add here though</p>",
        "id": 558927473,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1763937169
    },
    {
        "content": "<p>If you could just share any plans or updates once you've figured out the details in this thread that would be most appreciated -- it will help others contribute. </p>\n<p>I'm really excited to have an LSP for the new syntax <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 558929794,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1763939612
    },
    {
        "content": "<p>I just made the pull request. The request itself contains information about the implementation, but I also added a README.md in the new <code>src/lsp</code> folder alongside the other files.</p>\n<p>Simply put the <code>transport.zig</code> and <code>protocol.zig</code> have been abstracted in a way that they shouldn't require change. When it comes to adding new functionnalities it'll be as simple as adding the new handler to the <code>handlers</code> directory and implementing them the same way as the current basic <code>initialize</code> and <code>exit</code> methods. Every handlers takes the ServerType which holds the state of the project as well as the functions to communicate back to the editor.</p>",
        "id": 559063298,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1763995189
    },
    {
        "content": "<p>Also I suggest using the <code>--debug-transport</code> flag when connecting to the LSP with your editor. Since the LSP takes control over the stdin and stdout you can have all the requests and responses mirrored to a temporary log file. That way you can just watch it with <code>tail -f</code> while youre testing things out.</p>",
        "id": 559064433,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1763995442
    },
    {
        "content": "<p><del>Currently the LSP is started with <code>roc experimental-lsp</code>, should we put the LSP in a separate binary to avoid that people start relying on it being included in the long term <span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span>?</del></p>",
        "id": 559097453,
        "sender_full_name": "Anton",
        "timestamp": 1764002418
    },
    {
        "content": "<p>Actually he told me himself to have it be executed like that with <code>roc experimental-lsp</code></p>",
        "id": 559098060,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1764002556
    },
    {
        "content": "<p>yeah I think for now this will be the easiest way to get everything up and running, and \"experimental\" should convey \"expect the way this works to change!\"</p>",
        "id": 559098804,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1764002722
    },
    {
        "content": "<p>Working on some change currently on the base structure of the LSP as I'm figuring out on the implementation of <code>didChange</code> and <code>didOpen</code> notifications. Wouldn't make sense to group them with requests such as <code>initialized</code> and <code>shutdown</code> as those expect a response immediately. Anyway in the LSP specifications they're separated between <code>notification</code> and <code>request</code>. Also working on a DocumentStore to handle the project different documents and store them in a StringHashMap. Could probably implement some caching later on to not have to reload every documents whenever the editor close. Particularly with neovim as it restart an lsp session every time you close all your buffers.</p>",
        "id": 560266245,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1764111299
    },
    {
        "content": "<blockquote>\n<p>Also working on a DocumentStore to handle the project different documents and store them in a StringHashMap</p>\n</blockquote>\n<p>I'm not 100% on the use case here ... but maybe it would help for you to checkout our cache manager implementation if you haven't seen that yet</p>",
        "id": 560268226,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1764112544
    },
    {
        "content": "<p>We also have a file watcher implementation that is cross-platform</p>",
        "id": 560268258,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1764112566
    },
    {
        "content": "<p>The cache manager is used to store the serialised modules into the roc cache</p>",
        "id": 560268280,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1764112588
    },
    {
        "content": "<p>The StringHashMap is only to store the plain text of the files. Its really just meant to have the current buffer in memory so that we can do some parsing on it for things like syntax check</p>",
        "id": 560268474,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1764112715
    },
    {
        "content": "<p>The file watcher and cache manager might definitely be useful though</p>",
        "id": 560268545,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1764112763
    },
    {
        "content": "<p>Might be able to get a simple LSP going for AoC with the new compiler. Its coupled well with the BuildEnv so it works perfectly with the new syntax. People using the nightly build and the old syntax might still need to use the old LSP though. It doesnt play super well with the platform import, but its something for now.<br>\n<a href=\"/user_uploads/22008/-ciQJEpeKeAicMse4izd2AoN/lsp-demo.gif\">lsp-demo.gif</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/-ciQJEpeKeAicMse4izd2AoN/lsp-demo.gif\" title=\"lsp-demo.gif\"><img data-animated=\"true\" data-original-content-type=\"image/gif\" data-original-dimensions=\"1222x740\" src=\"/user_uploads/thumbnail/22008/-ciQJEpeKeAicMse4izd2AoN/lsp-demo.gif/840x560-anim.webp\"></a></div>",
        "id": 560913730,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1764421433
    },
    {
        "content": "<p>Hey I haven't contributed to the compiler before but I wanted to help out with this since I've worked on other similar LSP/compiler type projects before. One thing I noticed is that it looks like the way this is implemented, we are reusing all the machinery/plumbing that is being used for <code>roc check</code>. One thing I ran into with that is <a href=\"https://github.com/roc-lang/roc/issues/8435\">https://github.com/roc-lang/roc/issues/8435</a> which means theoretically if we can implement the fix for that issue in roc check we also get type checking in the lsp which would be pretty nice. I started looking into it a bit <a href=\"https://github.com/roc-lang/roc/pull/8582\">https://github.com/roc-lang/roc/pull/8582</a> but ran into an issue with the import resolution (looks like roc check doesn't process platform imports the same way as roc run). I was able to get things hooked up and see results though<br>\n<a href=\"/user_uploads/22008/tmksrOItAdRcB4Vlrdyzqhqo/Screenshot-2025-12-06-at-10.25.57PM.png\">Screenshot 2025-12-06 at 10.25.57 PM.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/22008/tmksrOItAdRcB4Vlrdyzqhqo/Screenshot-2025-12-06-at-10.25.57PM.png\" title=\"Screenshot 2025-12-06 at 10.25.57 PM.png\"><img data-original-content-type=\"image/png\" data-original-dimensions=\"2160x1358\" src=\"/user_uploads/thumbnail/22008/tmksrOItAdRcB4Vlrdyzqhqo/Screenshot-2025-12-06-at-10.25.57PM.png/840x560.webp\"></a></div>",
        "id": 562281681,
        "sender_full_name": "Ameen",
        "timestamp": 1765078120
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"1004127\">@Ameen</span> yeah the type checking seems a bit inconsistent right now. As you can see in the gif I posted a bit higher up it is able to tell that <code>String</code> is not a correct type, but after updating the compiler further some of these checks seems to have been gone</p>",
        "id": 562281842,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1765078434
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> has a plan and a WIP PR to rip the gpa out of ModuleEnv which means we can unify a lot of the logic between roc run and roc check -- I hope I explained that right...</p>",
        "id": 562281894,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1765078483
    },
    {
        "content": "<p>it has drifted a lot, might be easier to start over on that one - I'll get back to it after we get to the end of Advent of Code <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 562282475,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1765079604
    },
    {
        "content": "<p>So I actually dug deeper into the issue because of  <span class=\"user-mention\" data-user-id=\"1004127\">@Ameen</span> insights. It seems that what was causing the issue is due to how the LSP runs the build into single threaded mode. The run loop exits once the remaining_modules reaches zero. The problem is that the platform is actually being discovered late and the platform injector gets new task, but since theres no global queue and the package loop has already stopped the platform never reaches the <code>Done</code> state, so the <code>ImportResolver</code> <code>isReady</code> stays false, hence why its stuck on WaitingOnImports. The fix by <span class=\"user-mention\" data-user-id=\"1004127\">@Ameen</span> does force the platform scheduling to run, but it doesnt resolve all WaitingOnImports. This whole thing could be an issue even in the regular multithreaded mode as the waitForIdle() doesnt check that modules with external imports are not still waiting on those dependencies. So even though the build might finish, no type check is gonna get done on those imports. Im working on a step to unblock these later down the build pipeline.</p>",
        "id": 562296803,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1765099350
    },
    {
        "content": "<p>I thought we sorted the module dependencies in strongly connected components and always compiled the leaf nodes first to avoid any deadlocks</p>",
        "id": 562297718,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1765100450
    },
    {
        "content": "<p>I'm not sure if we fully implemented that or if it was just a plan</p>",
        "id": 562297728,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1765100465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span> It seems like in the current build the modules are being added to the queue as they are being discovered, but they are not being woken up. So there doesn't seem to be any SCC type scheduling that guarantees the leaf nodes are compiled first.</p>",
        "id": 562298326,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1765101190
    },
    {
        "content": "<p>Basically, the <code>tryUnblock</code> checks the external imports, but at this point their state might not be <code>isReady</code> . So they're stuck on <code>WaitingOnImports</code>, the function returns and they're just left there</p>",
        "id": 562298597,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1765101504
    },
    {
        "content": "<p>yeah the new compiler's import system is very basic right now <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 562307531,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1765112833
    },
    {
        "content": "<p>Yeah, I've been digging my head in the build system for a moment and because the <code>roc check</code> command doesnt actually resolve imports the LSP also doesn't. I tried to see if we could use the build pipeline itself with the LSP, but it doesn't seem as simple to do in memory as to not add some huge overhead at every change in the editor. Right now I made a small patch that triggers the imports to be checked again later down the pipeline so theres not WaitingOnImports and as a bandaid I suppressed the diagnostics regarding undefined variable, but only for those regarding imports. Theres just no check thats gonna be done on those imports, but at least the rest of the program is gonna get type checked normally and no error is gonna show up  for the imported functions that are valid.</p>",
        "id": 562313167,
        "sender_full_name": "Etienne Latendresse-Tremblay",
        "timestamp": 1765119358
    }
]