[
    {
        "content": "<p>Just wanted to make a post in case anyone is interested in helping out with the new compiler and looking for ideas that don't require any Zig or Rust experience -- just pure Roc.</p>\n<p>We have golden snapshots in <code>src/snapshots</code> that we use to validate the behaviour of the zig compiler. They take source code, from simple isolated expressions and statements, all the way up to multi-file apps, packages and platforms. </p>\n<p>The snapshot tool processes the snapshot files through each compiler stage; Source -&gt; Tokenize -&gt; Parse -&gt; Canonicalize -&gt; Type Check -&gt; (in future) later stages -- and generates a new markdown section with human readable representation for that stage. This helps identify bugs and partially implemented features, and mitigates against any regressions as we build.</p>\n<p>If you are interested in helping out please don't hesitate to make a draft PR or ask any questions. The more snapshots we have of realistic Roc code the more confidence we have that our implementation has covered the various edge cases, and also significantly improves the seed inputs for our fuzzers to surface bugs deeper in our compiler.</p>\n<p>I just recently added a package in <code>src/snapshots/plume_package</code> as an example if you wanted to check that out. I converted my <a href=\"https://github.com/lukewilliamboswell/plume\">roc plume package</a> which provides an API wrapper around plotly.js.  It currently only has a couple of files, but I'd like to expand that to more of the package. Who knows, I may even just copy-paste it back into my package when the new compiler lands and my migration is already complete <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> </p>\n<p>I needed to convert it from the current roc syntax to our new 0.1 design -- so I went through and made changes for that, however the syntax is very similar. The biggest changes is probably the change from using whitespace for blocks to using braces, and spaces in types to using parens and commas.</p>\n<p>I missed a few things while converting the syntax over, but running <code>zig build snapshot</code> and looking at the Problems that are generated, I was able to iterate quickly on any issues I'd missed. </p>\n<p>There are also many other example snapshots for inspiration on what is valid Roc 0.1 syntax -- or at least currently supported.</p>",
        "id": 526722129,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1751433998
    },
    {
        "content": "<p>I built a parser combinator library for a Roc talk I gave earlier this year but had to rewrite in Elm due to a compiler bug. See <a class=\"message-link\" href=\"/#narrow/channel/231634-beginners/topic/Why.20is.20my.20parser.20causing.20a.20stack.20overflow.3F/near/501389940\">#beginners &gt; Why is my parser causing a stack overflow? @ 💬</a>  for details.</p>\n<p>Would it make sense to add the code as a snapshot?</p>",
        "id": 526940529,
        "sender_full_name": "Kevin Hovsäter",
        "timestamp": 1751530395
    },
    {
        "content": "<p>Yeah for sure -- if you need any help with the new syntax lmk</p>",
        "id": 526940740,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1751530476
    },
    {
        "content": "<p>I'll give it a shot tonight. I guess there's no way (as of yet) to know if the conversion is correct or not other than having someone look it over? I'll send you the PR once I have a draft ready. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 526941352,
        "sender_full_name": "Kevin Hovsäter",
        "timestamp": 1751530674
    },
    {
        "content": "<p>If you add it as a snapshot, then run <code>zig build snapshot</code> (we're using zig version 14) it will generate all the other sections and you can see if there are any parsing problems etc.</p>",
        "id": 526941745,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1751530824
    },
    {
        "content": "<p>I'm very interested in how you find the setup, it's a new thing we've put together to help develop the new compiler.</p>",
        "id": 526941831,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1751530865
    },
    {
        "content": "<p>That seems really nice. I'll report back once I get off work. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 526942936,
        "sender_full_name": "Kevin Hovsäter",
        "timestamp": 1751531276
    }
]