[
    {
        "content": "<p>Is anyone interested in helping me port over <a href=\"https://github.com/lukewilliamboswell/roc-json\">https://github.com/lukewilliamboswell/roc-json</a>?</p>\n<p>It would be really useful for a number of different things that are in progress and enables a lot of workarounds as an interim until we really mature out various parts of the ecosystem (i.e. roc glue and platform docs).</p>\n<p>I'm kind of maxxed out with all my concurrent things, and not sure when I'll get to it. But it would be really nice to have sooner than later. It would be one of the first package releases, so I expect we will probably have a number of bugs to find and report -- so this isn't a quick task I think. But we do have the encode and decode impl's on our Builtin types so we should in theory have everything we need to implement this. </p>\n<p>Let me know if your interested in working on this. Feel free to open a draft PR anytime</p>",
        "id": 570489432,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1769587001
    },
    {
        "content": "<p>I was having a little look at this last night and I don't think the compiler supports and code decode for records yet right? We don't have any kind of auto-generated record field walker like we did in the old compiler, yet.</p>\n<p>I'm happy to implement that of course. Was there any discussion about doing and code decode differently at all or were we planning to just copy the design in the old compiler as far as field iteration and such?</p>",
        "id": 571244721,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1769907893
    },
    {
        "content": "<p>yeah the API changed - <a href=\"https://github.com/roc-lang/roc/pull/8869\">https://github.com/roc-lang/roc/pull/8869</a> - so there's no longer a <code>Decode</code> module or Ability (or type alias or anything like that)</p>",
        "id": 571514470,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1770062388
    },
    {
        "content": "<p>but in general, if you'd like to implement that inference, that would be great - although ideally hold off until <a href=\"https://github.com/roc-lang/roc/pull/9068\">https://github.com/roc-lang/roc/pull/9068</a> is merged, because otherwise there will be a ton of merge conflicts <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 571514765,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1770062487
    },
    {
        "content": "<p>it's close, but not quite there yet</p>",
        "id": 571514777,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1770062492
    },
    {
        "content": "<p>250 commits, yolo</p>",
        "id": 571514983,
        "sender_full_name": "nandi",
        "timestamp": 1770062572
    },
    {
        "content": "<p>it's been through a _slight_ amount of revision <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 571515064,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1770062604
    }
]