[
    {
        "content": "<p>I was starting to try to improve some error messages involving ignored arguments and underscores in variable names (including <a href=\"https://github.com/roc-lang/roc/issues/3987\">#3987</a>). But then I found <a href=\"https://github.com/roc-lang/roc/issues/3026\">#3026</a>: \"Allow underscores in field names and variable names.\" Is it still the plan to start allowing underscores?</p>",
        "id": 360107597,
        "sender_full_name": "Ajai Nelson",
        "timestamp": 1684695316
    },
    {
        "content": "<p>yep!</p>",
        "id": 360130923,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684710604
    },
    {
        "content": "<p>If underscores are allowed in regular variable names, how will we handle unused variables?</p>\n<p>Is this the idea?</p>\n<ul>\n<li>\n<p>As before, all unused variables should start with an underscore.<br>\n  So <code>f = \\x -&gt; 3</code> still produces a warning, and you can still suppress it by adding an underscore: <code>f = \\_x -&gt; 3</code>.</p>\n</li>\n<li>\n<p>But not all variables starting with an underscore have to be unused.<br>\n  So <code>f = \\_x -&gt; _x</code> is allowed and doesn't produce a warning.</p>\n</li>\n</ul>",
        "id": 360138343,
        "sender_full_name": "Ajai Nelson",
        "timestamp": 1684717304
    },
    {
        "content": "<p>maybe leading underscores are unused variables? though your suggestion also makes sense to me</p>",
        "id": 360138776,
        "sender_full_name": "Ayaz Hafiz",
        "timestamp": 1684717652
    },
    {
        "content": "<p>yeah I like your suggestion</p>",
        "id": 360140773,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684719260
    },
    {
        "content": "<p>part of the motivation here is just knowing that people will commonly serialize things that have underscores in them, and not wanting to create unnecessary friction there</p>",
        "id": 360140792,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684719292
    },
    {
        "content": "<p>and it's also plausible that people will serialize things with underscores at the start</p>",
        "id": 360140809,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684719303
    },
    {
        "content": "<p>I believe what you suggested is Rust's policy, and it seems to have worked out fine in practice</p>",
        "id": 360140830,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684719327
    },
    {
        "content": "<p>Wouldn't it make more sense to find a way to map names when encoding/decoding? Isn't it just as plausible that a json field name will start with a capital letter, which roc wouldn't allow?</p>",
        "id": 360141415,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684719775
    },
    {
        "content": "<p>What some languages do is to give you a similar warning when you end up using a variable that starts with an underscore as you get when you do not use a variable that doesn't start with an underscore. (A 'should not have been used' warning).</p>",
        "id": 360224862,
        "sender_full_name": "Qqwy / Marten",
        "timestamp": 1684751314
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"343810\">Brendan Hansknecht</span> <a href=\"#narrow/stream/316715-contributing/topic/Underscores.20in.20variable.20names/near/360141415\">said</a>:</p>\n<blockquote>\n<p>Wouldn't it make more sense to find a way to map names when encoding/decoding? Isn't it just as plausible that a json field name will start with a capital letter, which roc wouldn't allow?</p>\n</blockquote>\n<p>Languages that use <code>UpperCamelCase</code> for field names are rarer than languages that use <code>snake_case</code> or <code>dromedarisCase</code>. (To my knowledge only C# and C#-adjacent languages follow this convention). There should be a way to map between them, but the question is what to support as part of the language itself and what to delegate to a separate library.</p>",
        "id": 360227329,
        "sender_full_name": "Qqwy / Marten",
        "timestamp": 1684752006
    },
    {
        "content": "<blockquote>\n<p>Wouldn't it make more sense to find a way to map names when encoding/decoding? Isn't it just as plausible that a json field name will start with a capital letter, which roc wouldn't allow?</p>\n</blockquote>\n<p>oh yeah, that reminds me that <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span>'s JSON implementation already supports converting to camelCase (possibly already from snake_case?)</p>",
        "id": 360233469,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684753577
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"511136\">@Ajai Nelson</span> let's actually hold off on <a href=\"https://github.com/roc-lang/roc/issues/3026\">https://github.com/roc-lang/roc/issues/3026</a> for now</p>",
        "id": 360233535,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684753601
    },
    {
        "content": "<p>but definitely still want <a href=\"https://github.com/roc-lang/roc/issues/3987\">https://github.com/roc-lang/roc/issues/3987</a> !</p>",
        "id": 360233629,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684753626
    },
    {
        "content": "<p>Is the name conversion done via a dict, or is it first class like when the name actually matches the record field?</p>",
        "id": 360268257,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684761888
    },
    {
        "content": "<p>Oh, just looked at the source, no intermediate dictionary needed. It looks like we load the full name, convert it as specified (all names must use the same conversion, but you can write your own custom function), and then converts the full string name into a record field update (not exactly sure how, I assume we generate thst function automatically and it is just a <code>when</code> on the sting name that converts to the field updater).</p>",
        "id": 360276224,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684763295
    },
    {
        "content": "<p>So definitely a step forward, but still missing some pieces. At least from my quick reading:</p>\n<ul>\n<li>can't change field name type on a fine granularity </li>\n<li>will always parse the full field name (so easy to DDoS with a large field name with many words that would take a lot of work to convert between cases). Also, just means we don't generate a more optimal parser that skips things sooner.</li>\n<li>the record update lookup has to use the roc field name. Preferably, we would change the lookup to use the field name with the new case instead of updating the field name of inputs from json. Would fix the DDoS mentioned above.</li>\n</ul>\n<p>I think we likely have to look into a way to parametrize this more directly such that the names directly affect decodeRecord no matter the decoder. Also, would be great to expose the names in a way that more optimized lookup could be generated. I get that we don't want macros, so we can't just generate something super optimal at compile time due to knowing all the details, but I think there is still definitely a gap here that will be very measurable.</p>",
        "id": 360279369,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684763832
    },
    {
        "content": "<p>this is really tricky with structural types though</p>",
        "id": 360347156,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684779872
    },
    {
        "content": "<p>like if you have a nominal record type like Rust does, there's a clear place to put per-field information on how you want it to be serialized</p>",
        "id": 360347252,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684779904
    },
    {
        "content": "<p>I do think a possible answer here (which is seeming more and more likely to be the way to go the more we talk about this) is:</p>\n<ul>\n<li>if you want maximum performance, don't use <code>Encode</code> and <code>Decode</code> at all; rather, do something like protobuf which explicitly uses its own schema and generates code to serialize individual types directly, while also accounting for backwards compatibility</li>\n<li>if you want more convenience at the expense of performance, use <code>Encode</code> and <code>Decode</code>, possibly in conjunction with a converter that changes camelCase into snake_case</li>\n<li>if you want something in between (e.g. because you're dealing with a weird JSON schema that you don't control, which - for example - mixes camelCase and snake_case in field names), there are various levers you can pull to do this, such as making part of the type you're decoding into opaque, and giving it a custom <code>Decode</code> implementation, etc.</li>\n</ul>",
        "id": 360348034,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684780157
    },
    {
        "content": "<p>Specifically for field names: Isn't it just mostly a matter of allowing a custom definition of the <code>Str</code> mapping in <code>stepField</code>? Instead of  matching<code>\"fieldName\" -&gt; decode...</code> I want <code>\"field-name\" -&gt; decode...</code>.</p>",
        "id": 360348286,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684780236
    },
    {
        "content": "<p>oh you mean when writing a <code>Decode</code> implementation by hand?</p>",
        "id": 360348491,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684780304
    },
    {
        "content": "<p>I'm really just thinking of the automatic one that comes with every record</p>",
        "id": 360348547,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684780321
    },
    {
        "content": "<p>I am thinking about in <code>Json.roc</code> when specificying you want <code>kebab-case</code> for example. To avoid the very easy DDoS attack of sending a json with a really long kebab case name. Then json decoding will waste a lot of CPU converting it to <code>camelCase</code>.</p>",
        "id": 360349232,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684780523
    },
    {
        "content": "<p>Would rather convert <code>nameIControl</code> (this is the field name in the Roc record) to <code>name-i-control</code> and then use that for comparison than convert <code>some-name-i-dont-control-that-is-very-long-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-a-...</code> to <code>SomeNameIDontControlThatIsVeryLongAAAAAAAAAAAAAAAAAAAAAAAAA...</code> and use that for comparison.</p>",
        "id": 360349554,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684780635
    },
    {
        "content": "<p>oh I see</p>",
        "id": 360352217,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684781526
    },
    {
        "content": "<p>so basically a way to tell <code>decode</code> \"hey right before you're about to compare my field names, first run this conversion on them\"</p>",
        "id": 360352380,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684781575
    },
    {
        "content": "<p>something like that?</p>",
        "id": 360352398,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1684781579
    },
    {
        "content": "<p>I might have a look at changing that, good idea Brendan.</p>",
        "id": 360365742,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1684786175
    },
    {
        "content": "<p>In R, if you put backticks around a variable name, you can include any character you want as part of the variable name, including dashes and spaces. So <code> `myVar` </code> is the same thing as just <code> myVar </code>, but you can also have a variable called <code> `my var` </code> or <code> `my-var` </code>. This is actually very useful in the context of R, since, for example, it's common to read CSV files where the column names have spaces in them. </p>\n<p>I doubt it's the right solution for Roc, but maybe it’s something to keep in mind if people really want something more flexible than the current solution.</p>",
        "id": 360375856,
        "sender_full_name": "Ajai Nelson",
        "timestamp": 1684789854
    },
    {
        "content": "<p>Yeah, exactly, give decode a mapping for field names rather than trying to map all json strings to rocs naming format.</p>",
        "id": 360379849,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1684791158
    }
]