[
    {
        "content": "<p>I'm wondering if anyone is interested in working on the LSP for our new zig compiler?</p>",
        "id": 527599377,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1751946533
    },
    {
        "content": "<p>I'm thinking we have enough \"roc check\" functionality that this could be useful to have when working on <code>.roc</code> files using the new 0.1 syntax.</p>",
        "id": 527599469,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1751946602
    },
    {
        "content": "<p>I guess <span class=\"user-mention\" data-user-id=\"781658\">@Anthony Bullard</span> wanted working on it. Otherwise I can start the next week (on vacation rn)</p>",
        "id": 527599859,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1751946914
    },
    {
        "content": "<p>Yeah I told Kiryl to go ahead if he is interested since this \"vacation\" I'm on is busier than my normal working days <span aria-label=\"rofl\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rofl\">:rofl:</span></p>",
        "id": 528111966,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752162252
    },
    {
        "content": "<p>We talked about exposing generic information that can be used to build tooling such as a language server in this thread <a href=\"#narrow/stream/304641-ideas/topic/Bundle.20the.20language.20server.20in.20the.20CLI/near/523017150\">https://roc.zulipchat.com/#narrow/stream/304641-ideas/topic/Bundle.20the.20language.20server.20in.20the.20CLI/near/523017150</a></p>\n<p>I think it would be valuable to do some design work about how this should look before implementing it</p>",
        "id": 528193574,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1752207422
    },
    {
        "content": "<p>Ah yeah, that's a fun topic. </p>\n<p>I love the simplicity of just making a <code>roc tooling</code> platform and giving is a list of all the modules in the app/package/platform in a big text S-expression format.</p>\n<p>It's probably not much more work in the long run to make a nice Roc API that models things properly and would would be much nicer to work with.</p>",
        "id": 528196231,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752209709
    },
    {
        "content": "<p>If we're not doing just a normal LSP but wanting to pursue this <code>roc tooling</code> approach instead, then we probably want to wait a little longer before we start implementing it. Designing the API and making an example app etc is very  doable now though.</p>",
        "id": 528196434,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752209890
    },
    {
        "content": "<p>Can it be done in parallel? I like the <code>roc tooling</code> idea, but there is a couple of reasons of why I think it makes sense to start working on <code>roc lsp</code> straight away:</p>\n<ol>\n<li>It will show us what we need for the api and find the ergonomics we need on practice</li>\n<li>LSP won't be implemented cleanly and likely would require a refactoring anyway (make it work -&gt; make it right)</li>\n<li>It should be fairly easy to refactor lsp to use an API. <code>roc tooling</code> can be designed along the way.</li>\n</ol>\n<p>I'll start drafting things as soon as possible</p>",
        "id": 528334171,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752238496
    },
    {
        "content": "<p>The lsp is a separate executable from the compiler, right? There is no <code>roc lsp</code> commands, right?</p>\n<p>It just that currently it would via subcommands call <code>roc check</code> and in the future it would call <code>roc tooling</code>?</p>",
        "id": 528362952,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1752247704
    },
    {
        "content": "<p>Hm. How about having it as part of the roc cli for a while and when tooling is ready - move it somewhere else? Relying on rendered diagnostic messages seems to be not great</p>",
        "id": 528370779,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752250310
    },
    {
        "content": "<p>Can we make it a separate executable that depends on our internal zig source (like snapshot.zig is)?</p>\n<p>At least if we want it eventually decoupled, I think it is best to avoid ever putting it in the same executable.</p>\n<p>... But I'm not actually sure if our long term plans here have shifted and what the current state is.</p>",
        "id": 528372085,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1752250876
    },
    {
        "content": "<p>Ah, sure. Good point!</p>",
        "id": 528372156,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752250907
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"584248\">Kiryl Dziamura</span> <a href=\"#narrow/stream/316715-contributing/topic/zig.20compiler.20-.20LSP/near/528370779\">said</a>:</p>\n<blockquote>\n<p>Hm. How about having it as part of the roc cli for a while and when tooling is ready - move it somewhere else? Relying on rendered diagnostic messages seems to be not great</p>\n</blockquote>\n<p>my concern is that people will set up their editor configs to use it that way and then we'll never be able to get rid of it without breaking things for a bunch of people</p>",
        "id": 528376852,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752253026
    },
    {
        "content": "<p>I see. So <code>roc tooling</code> as poc might be whatever api for <code>lsp</code> which then can be refined and stabilized? Or you suggest having <code>lsp</code> completely decoupled for now? I'm for the second option</p>",
        "id": 528383368,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752255941
    },
    {
        "content": "<p>I'm saying never have a <code>roc lsp</code>, but rather have a different thing that is sufficiently powerful that you can give it a roc script and that's all you need to stand up a language server</p>",
        "id": 528385458,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752256892
    },
    {
        "content": "<p>I definitely think we should expose enough info that people can build a fast and featureful language server just by providing <code>roc</code> with a single .roc file</p>",
        "id": 528385716,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752256981
    },
    {
        "content": "<p>and without <code>roc</code> having any formal knowledge of the language server protocol</p>",
        "id": 528385774,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752257011
    },
    {
        "content": "<p>You mean the compiler doesn't have a lsp command, but it is instead a separate binary, correct?  With no coupling between the compiler and language server?</p>",
        "id": 528391637,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752260042
    },
    {
        "content": "<p>I know one language that fits the task very well <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span><br>\nI wonder how good would it be to use roc tooling as a platform</p>",
        "id": 528392122,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752260208
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> yes, I understand the concept of roc tooling. My question is rather \"should we start working on the roc tooling or on lsp poc to understand what api the roc tooling expects to provide?\"</p>",
        "id": 528392692,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752260432
    },
    {
        "content": "<p>Loving this direction, here's a brief summary of what I am thinking... </p>\n<p>So my understanding is the goal is for the roc cli to support plugin scripts that can take different representations of a roc module/app/platform/package and use this for different purposes. Primarily these fall into the category of developer tooling. Some use-cases I can think of; code gen, linters, debug tools, LSP etc</p>\n<p>Example usage: </p>\n<ul>\n<li><code>roc tool &lt;plugin.roc&gt; &lt;app.roc&gt;</code> : <code>roc tool lsp.roc hello-world.roc</code></li>\n</ul>\n<p>The <code>app.roc</code> could be any roc code, a standalone module, an app <code>main.roc</code>, package or platform etc.</p>\n<p>The <code>plugin.roc</code> is a normal roc app -- the platform it uses is provided by the roc cli. It has an API that provides information about the <code>app.roc</code> that was provided, and enables various IO. The roc cli is the host which loads the plugin script, and provides the information for it to do it's thing.</p>\n<p>We discussed different ideas about what this API would actually look like -- the approach I think is simplest and most flexible (at least to start with) is to provide a <code>Str</code> that is simply the CanIR s-expression (exactly the same as is used in the snapshots).</p>\n<p>The way I am thinking we approach this is as follows;</p>\n<ol>\n<li>Add a flag to <code>roc check --dump-cir</code> that simply prints the CanIR s-expression to STDOUT</li>\n<li>Write a Roc package (using current roc) that parses the CanIR s-expression</li>\n<li>Write an LSP using basic-cli/basic-webserver that calls <code>./zig-out/bin/roc check --dump-cir ...</code></li>\n</ol>\n<p>This will give us an end to end capability quickly, and enable or unlock a lot of other dev tooling.</p>\n<p>At some point we will want to transition to <code>roc tool</code> and have a plugin, but I think this should be deferred until after we build <code>roc glue</code> and really establish the conventions for calling into roc and platform development. </p>\n<p>While there is some translation from current roc syntax to 0.1 -- I don't expect this to be a major issue in future.</p>\n<p>Interested to know what people think of this approach?</p>",
        "id": 528393018,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752260594
    },
    {
        "content": "<p>My take on it is that I don't know at which level roc tooling should provide info and how because there's no consumers yet. Like, we can do the can ir sexpr and then it turns out the consumer needs smth else. I mean, I love the idea of roc tooling but just don't know the real world requirements. Rephrasing, roc tooling is a server and tools are clients. But I don't know how clients want to be served because there are no clients yet.</p>\n<p>I'll read some discussions on it</p>",
        "id": 528394243,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752261229
    },
    {
        "content": "<p>We could also easily add a <code>roc check --dump-ast</code> also if there are tools we want to build that use the AST instead.</p>",
        "id": 528394391,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752261314
    },
    {
        "content": "<p>I think we just start with something really basic. I don't understand LSP very well, but I imagine there is something like, jump to definition or what type is this identifier etc</p>",
        "id": 528394516,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752261373
    },
    {
        "content": "<p>Maybe <span class=\"user-mention\" data-user-id=\"651372\">@Eli Dowling</span> might have some advice?</p>",
        "id": 528394537,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752261383
    },
    {
        "content": "<p>I imagine roc tooling as a DB, where roc file is a representation of database. And you can send queries to it</p>",
        "id": 528396098,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752262189
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span> I like that idea!</p>",
        "id": 528397821,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752263251
    },
    {
        "content": "<p>I'd maybe call it <code>--deprecated-dump-ir</code> just to set expectations that we will replace it in the future with something else <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 528397889,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752263280
    },
    {
        "content": "<p>so I will start with the flag implementation? so then it's possible to pipe it's output to a separate simple implementation of lsp, right? for starters</p>",
        "id": 528398064,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752263404
    },
    {
        "content": "<p>hmm, I'm kinda second-guessing how useful that would be now that I'm thinking about it more</p>",
        "id": 528399838,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752264406
    },
    {
        "content": "<p>I think if we did the dump to a file thing, we would end up starting over from scratch when we start on the real thing bc so little of it would be useful</p>",
        "id": 528400113,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752264538
    },
    {
        "content": "<p>that's why I suggest implementing a simple lsp using roc zig as library and iteratively get to the tooling middleware</p>",
        "id": 528400377,
        "sender_full_name": "Kiryl Dziamura",
        "timestamp": 1752264674
    },
    {
        "content": "<p>I guess we could call it --deprecated-lsp haha</p>",
        "id": 528401842,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752265494
    },
    {
        "content": "<p>Do we need to implement a language server before getting to tooling/plugin system?</p>",
        "id": 528411031,
        "sender_full_name": "Isaac Van Doren",
        "timestamp": 1752270894
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/channel/316715-contributing/topic/zig.20compiler.20-.20LSP/near/528400113\">said</a>:</p>\n<blockquote>\n<p>I think if we did the dump to a file thing, we would end up starting over from scratch when we start on the real thing bc so little of it would be useful</p>\n</blockquote>\n<p>Maybe we should discuss this in another thread.</p>\n<p>Why shouldn't we use the s-expression as a Str? How big of an issue would that be?</p>",
        "id": 528411767,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752271438
    },
    {
        "content": "<p>Previous thoughts <a href=\"#narrow/channel/304641-ideas/topic/Bundle.20the.20language.20server.20in.20the.20CLI/near/523176618\">https://roc.zulipchat.com/#narrow/channel/304641-ideas/topic/Bundle.20the.20language.20server.20in.20the.20CLI/near/523176618</a></p>",
        "id": 528411909,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752271565
    },
    {
        "content": "<p>I haven't written this up anywhere, but my general thought is that the way I think we should try doing a language server is: </p>\n<ul>\n<li>we load up all our ModuleEnvs in the usual way</li>\n<li>we build our graph of dependencies between those modules</li>\n<li>within each of those modules, we also know what their exports are</li>\n<li>we keep a process running with all of this in memory</li>\n<li>when we get an individual change to a particular file, we diff its source bytes to figure out which top-level decls changed, and redo parsing on them to get new asts for them</li>\n<li>then we replace the old canonical decls with lookups to the new ones, so that all the existing references to the old ones get automatically updated in-place</li>\n<li>then we use our old canonical dependency graph of top-level decls to see which top-level decls need to have their types re-checked if necessary (in many cases we can quickly determine that the changed top-level decls(s) could not possibly have changed their types, so this is unnecessary)</li>\n<li>now we finish all necessary type-checking within the module </li>\n<li>now we see if any exposed things changed types; if so, other modules which depend on this one will need to be rebuilt in a similar incremental way</li>\n<li>finally we're all synced up and back to normal, except some of our node stores have grown</li>\n<li>to prevent this from growing memory usage indefinitely, we have a background thread with low priority which copies over module envs into more compact representations by rebuilding them from AST onward. If this finishes and the original module env wasn't modified in the meantime, then we atomically swap it in and deinit the old one</li>\n<li>in this way, we have cheap garbage collection of modules, they can get updated incrementally very quickly, and we always have all the info necessary in memory to answer questions about types, references, etc.</li>\n</ul>",
        "id": 528413205,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752272607
    },
    {
        "content": "<p>I think that's how we get the best LSP perf and memory usage, and that has essentially nothing in common with reading SExprs from disk and then doing different things with them in memory <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 528413241,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752272656
    },
    {
        "content": "<p>Don’t try to diff bytes prior to parsing. That’s basically a buggy implementation of an incremental parser. Either build a proper incremental parser or just always reparse the whole file</p>",
        "id": 528413437,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1752272828
    },
    {
        "content": "<p>I mean using regions</p>",
        "id": 528414016,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273381
    },
    {
        "content": "<p>like the language server says \"here is what was modified\" and we use our regions to tell what was modified</p>",
        "id": 528414037,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273404
    },
    {
        "content": "<p>maybe \"diff\" is the wrong word for that haha</p>",
        "id": 528414051,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273419
    },
    {
        "content": "<p>This doesn't sound like plugin at all. This just sounds like a separate binary that is still coupled to the check libraries , just like snapshot.  Which i think is fine but above it sounded like there was a desire for something with less coupling</p>",
        "id": 528414278,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752273644
    },
    {
        "content": "<p>(Even if i think that's not easy to do if you also want top performance from the language server)</p>",
        "id": 528414305,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752273673
    },
    {
        "content": "<p>I think this should be in the <code>roc</code> binary</p>",
        "id": 528414338,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273713
    },
    {
        "content": "<p>everything I just described is still useful for something like <code>roc check --watch</code></p>",
        "id": 528414359,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273730
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/stream/316715-contributing/topic/zig.20compiler.20-.20LSP/near/528385458\">said</a>:</p>\n<blockquote>\n<p>I'm saying never have a <code>roc lsp</code>, but rather have a different thing that is sufficiently powerful that you can give it a roc script and that's all you need to stand up a language server</p>\n</blockquote>\n<p>Then what was meant by this?</p>",
        "id": 528414373,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752273744
    },
    {
        "content": "<p>sorry, \"different thing\" as in <code>roc tool</code></p>",
        "id": 528414381,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273754
    },
    {
        "content": "<p>So tool is a sub command of the compiler binary that does the above in service of multiple tools that are implemented in Roc?</p>",
        "id": 528414426,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752273803
    },
    {
        "content": "<p>yeah</p>",
        "id": 528414429,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273807
    },
    {
        "content": "<p>so like you could use it to implement a codemod tool as well, for example</p>",
        "id": 528414435,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273815
    },
    {
        "content": "<p>or a language server</p>",
        "id": 528414439,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273817
    },
    {
        "content": "<p>or a dedicated plugin for a specific editor that's more ambitious than just language server</p>",
        "id": 528414450,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273827
    },
    {
        "content": "<p>Ok. interesting</p>",
        "id": 528414463,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752273840
    },
    {
        "content": "<p>the specific thing I don't want to do is to couple <code>roc</code> to the language server protocol</p>",
        "id": 528414471,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752273846
    },
    {
        "content": "<p>Is there prior art, or is this just an experiment?</p>",
        "id": 528414481,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752273858
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/stream/316715-contributing/topic/zig.20compiler.20-.20LSP/near/528414471\">said</a>:</p>\n<blockquote>\n<p>the specific thing I don't want to do is to couple <code>roc</code> to the language server protocol</p>\n</blockquote>\n<p>i understand this, even with LSP having such deep momentum behind it</p>",
        "id": 528414540,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752273907
    },
    {
        "content": "<p>there's lots of prior art for doing it in batch builds (e.g. code mod tools, languages like Nim have lots of <a href=\"https://youtu.be/ElHi2h9Ho6M?si=5tQUTqMo1UB7gkE0\">static introspection features</a>) and there's also lots of prior art for doing dynamic runtime introspection (e.g. Smalltalk) but I'm not aware of prior art combining the two - a static analysis system that efficiently keeps itself up-to-date with changes at runtime</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"ElHi2h9Ho6M\" href=\"https://youtu.be/ElHi2h9Ho6M?si=5tQUTqMo1UB7gkE0\"><img src=\"https://uploads.zulipusercontent.net/a8c4334bead326844ceeb04c836e647992455d67/68747470733a2f2f692e7974696d672e636f6d2f76692f456c4869326839486f364d2f6d7164656661756c742e6a7067\"></a></div>",
        "id": 528414625,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274008
    },
    {
        "content": "<p>One down side is it means that we have to have at least a working interpreter for Roc v0.1 implemented to start on implementation of this</p>",
        "id": 528414631,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752274017
    },
    {
        "content": "<p>yeah that's why I'd be ok with doing a temporary like <code>roc deprecated-lsp</code> or something</p>",
        "id": 528414656,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274041
    },
    {
        "content": "<p>just really clearly communicate that it's a stopgap that will be going away, to be replaced by something else that you can use to achieve the same goal</p>",
        "id": 528414676,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274062
    },
    {
        "content": "<p>Ok</p>",
        "id": 528414684,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752274068
    },
    {
        "content": "<p>but that temporary thing should just be a zig library that's exposed in the roc binary just like<br>\ncheck, test, build, etc</p>",
        "id": 528414728,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752274116
    },
    {
        "content": "<p>but I do think we should aim for an architecture along these lines:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/channel/316715-contributing/topic/zig.20compiler.20-.20LSP/near/528413205\">said</a>:</p>\n<blockquote>\n<p>I haven't written this up anywhere, but my general thought is that the way I think we should try doing a language server is: </p>\n</blockquote>",
        "id": 528414745,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274141
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"781658\">Anthony Bullard</span> <a href=\"#narrow/channel/316715-contributing/topic/zig.20compiler.20-.20LSP/near/528414728\">said</a>:</p>\n<blockquote>\n<p>but that temporary thing should just be a zig library that's exposed in the roc binary just like<br>\ncheck, test, build, etc</p>\n</blockquote>\n<p>I think just have it be part of the normal <code>roc</code> CLI</p>",
        "id": 528414764,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274163
    },
    {
        "content": "<p>Ok, i think that temporary things architecture is what is being decided here</p>",
        "id": 528414768,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752274168
    },
    {
        "content": "<p>like we can of course build something simpler, but it feels kinda wasteful</p>",
        "id": 528414787,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274187
    },
    {
        "content": "<p>I think roc tool is awesome for once we have a working stable intepreter</p>",
        "id": 528414795,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752274191
    },
    {
        "content": "<p>we already have the module envs in place</p>",
        "id": 528414801,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274199
    },
    {
        "content": "<p>Yep</p>",
        "id": 528414807,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752274204
    },
    {
        "content": "<p>loading files is <a href=\"https://github.com/roc-lang/roc/pull/8001\">WIP</a></p>",
        "id": 528414824,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274216
    },
    {
        "content": "<p>And our check pipeline is so fast it'll be great perf</p>",
        "id": 528414836,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752274234
    },
    {
        "content": "<p>I hope we can make the tool interface still very performant as well</p>",
        "id": 528414852,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752274255
    },
    {
        "content": "<p>yeah I haven't super dug into it but I think we'll be good thanks to the whole <code>Idx</code> thing</p>",
        "id": 528414971,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274418
    },
    {
        "content": "<p>supposedly (Folkert and Andrew independently confirmed this) you can turn a SoA thing into a normal tagged union for ergonomics and llvm will optimize away the conversion</p>",
        "id": 528415031,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274474
    },
    {
        "content": "<p>so we should be able to offer nice ergonomics as well as great perf...in theory at least!</p>",
        "id": 528415065,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274499
    },
    {
        "content": "<p>i can't wait to have some actual down days to jump back into roc development</p>",
        "id": 528415153,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752274587
    },
    {
        "content": "<p>if it's still gonna be hectic for awhile, I'd be happy to get your PR across the finish line</p>",
        "id": 528415473,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274906
    },
    {
        "content": "<p>we've been avoiding touching parser stuff and it would be nice to unblock if you're gonna be bandwidth-constrained awhile longer! <span aria-label=\"smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 528415489,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274924
    },
    {
        "content": "<p>there's plenty of other stuff in the pipe <span aria-label=\"laughing\" class=\"emoji emoji-1f606\" role=\"img\" title=\"laughing\">:laughing:</span></p>",
        "id": 528415509,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752274941
    },
    {
        "content": "<p>FWIW I think an actual incremental parser is not that difficult to do (and make \"clearly correct\")</p>",
        "id": 528415579,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1752274996
    },
    {
        "content": "<p>Basically:</p>\n<ul>\n<li>The parser grows a new field: known_edit_range: (offset, old_len, new_len)</li>\n<li>We introduce a new internal ast node type: node_reference, which has an original_id and a \"shift\" (amount by which we have to adjust ranges to be correct)</li>\n<li>Most parsing functions get a new optional arg for the \"possible old node\"</li>\n<li>Those functions will have a small preamble where they check if there's a trivial match against the node passed, and if so return a node_reference pointing to that. We can determine a \"trivial\" match by looking at the current pos, the known_edit_range, and the node's offset.</li>\n<li>Otherwise, they also need to fish out what would be the corresponding field in the \"possible old node\" to pass that to child parsers</li>\n</ul>",
        "id": 528418985,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1752278619
    },
    {
        "content": "<p>Also, the ast node id type used outside the parser will need to grow an extra field to store the expected \"shift\", which is applied when looking up any ranges.</p>",
        "id": 528419124,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1752278767
    },
    {
        "content": "<p>We can chose to modify as many or as few functions as we want - so if we do this at the granularity of defs, we automatically get a parser that can skip re-parsing matching defs. Or we can make every function do this, and get very fine-grained re-use.</p>",
        "id": 528419290,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1752278841
    },
    {
        "content": "<p>(obviously the tokenizer needs to be able to produce a diff as well)</p>",
        "id": 528419309,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1752278864
    },
    {
        "content": "<p>That much is somewhat non-trivial, especially with string interpolation, but very doable.</p>",
        "id": 528419369,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1752278915
    },
    {
        "content": "<p>Of course, maybe this is roughly what you mean by \"we use our regions to tell what was modified\"</p>",
        "id": 528419428,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1752278980
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/channel/316715-contributing/topic/zig.20compiler.20-.20LSP/near/528413205\">said</a>:</p>\n<blockquote>\n<p>I haven't written this up anywhere, but my general thought is that the way I think we should try doing a language server is: </p>\n</blockquote>\n<p>Ok, thank you for summarising this... clears some things up.</p>",
        "id": 528423013,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752283185
    },
    {
        "content": "<p>Based on this, I'd say we just wait a little and build the tool version of an LSP. There's no rush and we're probably not too far away. <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 528423069,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752283276
    },
    {
        "content": "<p>That tooling api is going to be important to design well, since it's now an API contract for the compiler (obv more important post v1)</p>",
        "id": 528425025,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1752285796
    },
    {
        "content": "<p>100%!</p>",
        "id": 528425457,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1752286349
    },
    {
        "content": "<p>There's nothing stopping us from designing that now.. or sketching out prelimary concepts. </p>\n<p>Coming back to the <code>--deprecated-dump-can-ir</code> idea... we could use that as a bit of a hack to simulate the API and do some experiments with real 0.1 programs. Acknowledge we will be throwing most of this work away, but the goal wouldnt be to make a super comprehensive implementation just hack enough together to explore the tooling API design space. </p>\n<p>Having a more mature API design we are aiming for earlier would be quite helpful.</p>",
        "id": 528429215,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752291754
    },
    {
        "content": "<p>It's also something cool people can work on if they're just wanting to learn and write Roc and not so keen on Zig or Rust things -- but still is really helpful working towards nice tooling for the 0.1 implementation</p>",
        "id": 528429269,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1752291832
    }
]