[
    {
        "content": "<p>I'm trying to start learning code in the <code>solve</code> crate. It's super cool, but also daunting. For motivation I'm working on improving optional record fields, I made this issue for one of the error cases I'm seeing <a href=\"https://github.com/roc-lang/roc/issues/6101\">https://github.com/roc-lang/roc/issues/6101</a>.</p>\n<p>What's the best way to start debugging this code? Ideally I'd like to step through type unification as it's happening, but any kind of advice on pretty printing, places to start in the code, etc, would be great.</p>",
        "id": 404336027,
        "sender_full_name": "Elias Mulhall",
        "timestamp": 1701061610
    },
    {
        "content": "<p>This is prob an <span class=\"user-mention\" data-user-id=\"454654\">@Ayaz Hafiz</span> question, but I figured I'd ask in a public channel. I know you built some tooling around debugging lambda sets, but I haven't looked into how that works. Would it make sense to build a similar tool for more general type system debugging?</p>",
        "id": 404336156,
        "sender_full_name": "Elias Mulhall",
        "timestamp": 1701061724
    },
    {
        "content": "<p>There's a few things I do in these cases. The first step is to cut down as small a reproduction as possible.</p>\n<p>Then, I create a \"uitest\" (see for example <a href=\"https://github.com/roc-lang/roc/blob/a6cde11bf4183713e15198477e581b114299f709/crates/compiler/uitest/tests/solve/infer_contextual_crash.txt#L1-L6\">https://github.com/roc-lang/roc/blob/a6cde11bf4183713e15198477e581b114299f709/crates/compiler/uitest/tests/solve/infer_contextual_crash.txt#L1-L6</a>). If you annotate expressions with <code>^</code> underneath them, <code>cargo uitest &lt;file&gt;.txt</code> will print the solved types next to the annotations. This is pretty useful to check if things look right; usually, this is enough to see the problem. You can do fancier stuff like <a href=\"https://github.com/roc-lang/roc/blob/a6cde11bf4183713e15198477e581b114299f709/crates/compiler/uitest/tests/instantiate/call_generic_ability_member.txt#L18\">get the specialization types</a>.</p>\n<p>You can trace the path unification takes by setting <code>ROC_PRINT_UNIFICATIONS=1</code>. I commonly do <code>ROC_PRINT_UNIFICATIONS=1 cargo uitest &lt;mytest&gt;.txt</code>. This is a pretty good tool and is usually the next best step.</p>\n<p>Finally, if you need it, you can dump a unification trace by setting <code>ROC_CHECKMATE=1</code> before running a uitest/compiler build. You can then load the dumped trace into <a href=\"https://ayazhafiz.com/checkmate/\">https://ayazhafiz.com/checkmate/</a> and inspect the unification over time, and compare types at two instances in time. This is basically ROC_PRINT_UNIFICATIONS=1 on steroids. It's missing some features and has some holes, but if ROC_PRINT_UNIFICATIONS isn't enough this probably will be.</p>",
        "id": 404339391,
        "sender_full_name": "Ayaz Hafiz",
        "timestamp": 1701064294
    },
    {
        "content": "<p>As far as understanding the actual unification algorithms, it's basically a \"standard\" unification algorithm for an HM system with first-order parametric polymorphism. I'm happy to elaborate in more detail on specific things if it's useful. By far the best succinct but in-depth overview of this is, in my opinion, section 4.4.4 in Mimram's Proof = Program, which is available online at <a href=\"https://www.lix.polytechnique.fr/Labo/Samuel.Mimram/teaching/INF551/course.pdf\">https://www.lix.polytechnique.fr/Labo/Samuel.Mimram/teaching/INF551/course.pdf</a></p>",
        "id": 404339677,
        "sender_full_name": "Ayaz Hafiz",
        "timestamp": 1701064512
    }
]