[
    {
        "content": "<p>I am assume <span class=\"user-mention\" data-user-id=\"361169\">@Anton</span>  will know the answer to this. And others may know as well. Just thinking a bit about dependency management. For roc_std and <code>heap.rs</code> in both basic_cli and basic_webserver, they both have a checked in version of the files. This is fine, but means that sometimes they mutate without changes being looped back into roc_std in the main repo. Or other fixes are missed due to slow updating. Currently these are generated with glue, which is fine, but I'm wondering if we could just make them a cargo dependencies. Preferably, I think they would be cargo depencencies that point to a specific git commit in roc, but they also could be published as packages. I'm thinking that <code>heap.rs</code> might make sense to just put into roc_std cause it likely will be useful for many rust platforms.</p>\n<p>One thing I am not sure of: How does rust/cargo deal with dependencies on a subcrate? Is that supported? Would we need to put <code>roc_std</code> in it's own github repo to depend on it in cargo?</p>\n<hr>\n<p>Just kinda thinking out loud about a minor dependency annoyance.</p>",
        "id": 468305157,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1725663424
    },
    {
        "content": "<p>In the JWT PR I updated basic-webserver to point at roc_std in roc if tou wanted to see how its done.</p>",
        "id": 468305998,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1725663889
    },
    {
        "content": "<p>We can pin it to a specific commit easy too</p>",
        "id": 468306021,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1725663901
    },
    {
        "content": "<p>And it works for subcrates? That was my main concern</p>",
        "id": 468309587,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1725666029
    },
    {
        "content": "<p>But yeah, if that works, I think we should do the same for basic CLI, merge back any updates (I think basic webserver had a fix or two). And add heap to roc_std</p>",
        "id": 468309673,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1725666086
    },
    {
        "content": "<p>Not a rush by any means, but would be nice</p>",
        "id": 468309682,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1725666095
    }
]