[
    {
        "content": "<p>When working on the compiler, has anyone else experienced more rebuilds than necessary? I'm using VSCode on an Intel Mac. If I run <code>cargo check</code>, save a file (without changes), then rerun <code>cargo check</code> it recompiles/rechecks a bunch of crates. It seems like its mostly roc specific crates.  This takes 15-30 seconds each time, and really slows me down. I found <a href=\"https://doc.rust-lang.org/cargo/faq.html#why-is-cargo-rebuilding-my-code\">some cargo docs</a> that my be related, but I'm not sure. Anyone run into this, or know how to get cargo to only rebuild crates that it needs to?</p>",
        "id": 425438111,
        "sender_full_name": "Trevor Settles",
        "timestamp": 1709867296
    },
    {
        "content": "<p>That sounds quite believable. We have a big stack of crates that definitely aren't the most well separated. We also have some heavy macros and some build commands external to cargo.</p>",
        "id": 425441617,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709869680
    },
    {
        "content": "<p>I can repro the same thing</p>",
        "id": 425441767,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709869758
    },
    {
        "content": "<p>I guess rust does the caching based on time stamp. So saving again causes issues.</p>",
        "id": 425441971,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709869885
    },
    {
        "content": "<p>You can use <code>--timings</code> to get a time breakdown which may be helpful. Unwinding what is going on.</p>",
        "id": 425442063,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709869924
    },
    {
        "content": "<p>But it may fall into the fundamentally we have too much of a web of crates and need to reachitecture dependencies to avoid these large costs.</p>",
        "id": 425442147,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709869983
    },
    {
        "content": "<p>The roc load build script seems to be specifically high cost on my machine (I think it caches the builtins). So any change to the compiler might change what the builtins compile to which leads to recompiling and that takes a while.</p>",
        "id": 425442286,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709870066
    },
    {
        "content": "<p>It also looks to be a specific bottleneck where things run in parallel before and after, but it runs alone. Not sure of an actual fix, but seems like a decent part of the pain point.</p>",
        "id": 425442377,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709870159
    },
    {
        "content": "<p>Can you share the timings report you specifically hit, I would be curious to see if it matches or if something else also contributes.</p>",
        "id": 425442453,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709870193
    },
    {
        "content": "<p>I guess, good to see I'm not the only crazy one, haha.  I haven't looked at these timing reports before, but it strikes me as odd that there's a bunch of crates in the <code>targets</code> section. I'd expect that only one crate would be there. In this case I ran <code>cargo test --lib roc_parse --timings</code>. <br>\n<a href=\"/user_uploads/22008/QtlIOIEyMNgXZB3oAtknB3RV/cargo-timing-20240308T041112Z.html\">cargo-timing-20240308T041112Z.html</a></p>",
        "id": 425444101,
        "sender_full_name": "Trevor Settles",
        "timestamp": 1709871233
    },
    {
        "content": "<p>In the chart roc_repl_expect is the crate that takes the longest, but (in a perfect world) that wouldn't even need to compile when running tests for the roc_parse crate. It seems like cargo isn't able to:</p>\n<ol>\n<li>Detect what crates have changed</li>\n<li>Effectively build a dependency tree (either because roc_parse does actually depend on roc_repl_expect, or something else is wonky)</li>\n</ol>",
        "id": 425445077,
        "sender_full_name": "Trevor Settles",
        "timestamp": 1709871850
    },
    {
        "content": "<p>Will need to dig in later (away from computer), but my guess is that in the tests we use the repl for simplicity. So instead of just testing the parser, it is testing the full compiler. Thus the toms of extra dependencies pulled on</p>",
        "id": 425445555,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709872185
    },
    {
        "content": "<p>No worries. Another annoying thing is, with this issue I've got to wait for it twice. Once for the LSP which does a <code>cargo check</code>, then I can actually run the command I want</p>",
        "id": 425449102,
        "sender_full_name": "Trevor Settles",
        "timestamp": 1709874600
    },
    {
        "content": "<p>I think <code>cargo test -p roc_parse</code> should do better?</p>",
        "id": 425473591,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1709887844
    },
    {
        "content": "<p>the repl depends on the parser, so the parser cannot depend on the repl</p>",
        "id": 425473689,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1709887878
    },
    {
        "content": "<blockquote>\n<p><code>cargo test --lib roc_parse</code></p>\n</blockquote>\n<p>This says: Build all libraries in the roc repo for testing. Then filter the tests to execute down to tests that contain the phrase <code>roc_parse</code>.</p>\n<p>So yeah, should be fixed with folkert's command <code>cargo test -p roc_parse</code>. Which says only test the <code>roc_parse</code> package.</p>",
        "id": 425631967,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1709947629
    },
    {
        "content": "<p>Ah, the <code>--lib</code> vs <code>-p</code> change is a nice improvement on that front. I might just turn off the LSP while working so I'm not slowed down there...</p>",
        "id": 425732087,
        "sender_full_name": "Trevor Settles",
        "timestamp": 1710032676
    },
    {
        "content": "<p>I know that Ayaz's sets the language server to its own build target. That way it can build while you also build for tests or whatever else. Means more building overall but no pauses</p>",
        "id": 425736027,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1710037362
    }
]