[
    {
        "content": "<p>What's the general opinion of switching to squash and merge for PRs?</p>\n<p>Recently have been messing with this more due to work and I think it has a few major benefits:</p>\n<ol>\n<li>Main is essentially always healthy from a bisect perspective</li>\n<li>It doesn't matter individual workflows (rebase, merge, many small commits, 1 giant commit). The final result on main is one unit without extra chaos. The longer a PR lives the more chaos it tends to contain (especially if people use merge to update it)</li>\n<li>We just need to write one decent commit message to summarize that whole stack rather than caring about each individual commit.</li>\n</ol>\n<p>Main downsides I can think of:</p>\n<ol>\n<li>Lose the micro history. This means that when you bisect, it may be to a larger PR commit.</li>\n<li>Roc looks like it is moving slower in terms of commit count (people like big numbers)</li>\n</ol>",
        "id": 397390693,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1697667705
    },
    {
        "content": "<p>I don't care about downside <a href=\"https://github.com/roc-lang/roc/issues/2\">#2</a> at all, but I do care about downside <a href=\"https://github.com/roc-lang/roc/issues/1\">#1</a> for sure</p>",
        "id": 397395827,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1697671678
    },
    {
        "content": "<p>when bisecting it's annoying to have to <code>git bisect skip</code> periodically, but if I get to \"ok the problem is somewhere in this gigantic commit\" that's way worse <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 397395894,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1697671708
    },
    {
        "content": "<p>This may kinda be attributed to open sources vs company work. In company work, PRs tend to be reasonably sized (obviously, there are exceptions). In open source work, I think it is more often the case that people make large PRs and lump it all in one review.</p>",
        "id": 397396030,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1697671823
    },
    {
        "content": "<p>Like preferably most commits would be in the small 100s of lines range at max besides a few major ones that have to atomically update an api or similar.</p>",
        "id": 397396161,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1697671927
    },
    {
        "content": "<p>But that would likely mean making a lot more PRs for people who are contributing a lot and that may not fit Roc OSS workflow.</p>",
        "id": 397396190,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1697671960
    },
    {
        "content": "<p>Especially since github sucks at stacking PRs.</p>",
        "id": 397396205,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1697671975
    },
    {
        "content": "<p>yeah I definitely appreciate that we benefit from resilience to suboptimal commit structure in overall valuable contributions <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 397396663,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1697672334
    },
    {
        "content": "<blockquote>\n<p>when bisecting it's annoying to have to <code>git bisect skip</code> periodically, but if I get to \"ok the problem is somewhere in this gigantic commit\" that's way worse <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>\n</blockquote>\n<p>Yes, debugging is already very time consuming, let's not make it harder.</p>",
        "id": 397656283,
        "sender_full_name": "Anton",
        "timestamp": 1697790084
    },
    {
        "content": "<p>I mean that's more a matter of commit size. I think having a tree of many broken commits is much worse than larger commits. But as mentioned above, smaller commits may not match open source as well</p>",
        "id": 397719378,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1697811382
    },
    {
        "content": "<p>The main reason I mentioned this is because at least at work, it makes things way cleaner and easier to debug</p>",
        "id": 397719550,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1697811432
    },
    {
        "content": "<p>My understanding of this workflow is that you bisect to find the PR that introduced the issue, then you dig up the corresponding branch and do another bisect within the branch. This of course requires holding on to old branches.</p>",
        "id": 397761466,
        "sender_full_name": "Elias Mulhall",
        "timestamp": 1697828203
    }
]