[
    {
        "content": "<p>I wonder to what extent we can optimize parser combinators long-term - given enough inlining of closures, for example, could we theoretically get them to be approximately as fast as a parser written without any closures at all?</p>",
        "id": 407112988,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1702246668
    },
    {
        "content": "<p>this is not so much about the performance ceiling of Roc itself but rather whether we could get to a world where people can use parser combinators without having to think \"I am sacrificing performance for code that's easier to work with\"</p>",
        "id": 407113064,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1702246747
    },
    {
        "content": "<p><a href=\"https://www.sciencedirect.com/science/article/pii/S0167642317302654\">https://www.sciencedirect.com/science/article/pii/S0167642317302654</a> seems potentially relevant</p>",
        "id": 407113075,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1702246765
    },
    {
        "content": "<p>I definitely would need to dive into the internals to understand what it would generate if we inline everything. Cause it may be a case where there is a lot of work that llvm won't be able to optimize away due to memory interactions.</p>",
        "id": 407113416,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1702247135
    },
    {
        "content": "<p>I'm assuming we're doing our own inlining of closures, which is something I think we'll definitely want to do in the future</p>",
        "id": 407113650,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1702247332
    },
    {
        "content": "<p>yeah, but still some important questions on what is actually generated and how deep the nesting is. Cause we have to be careful not to inline too much cause it might apply in the wrong places.</p>",
        "id": 407113912,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1702247622
    }
]