[
    {
        "content": "<p>very interesting! <a href=\"https://gist.github.com/FeepingCreature/5dff669aad380a123b15659e195fb96c\">https://gist.github.com/FeepingCreature/5dff669aad380a123b15659e195fb96c</a></p>",
        "id": 411344276,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1704450590
    },
    {
        "content": "<blockquote>\n<p>Now, LLVM is a very good optimizer, but this does not leave it much room. The value has to go on the stack, which means there must be space for it there, it must be copied out of the register it is probably living in, and it has to remember which parts of the stack are in use and which ones can be reused by another call, which it turns out to be pretty poor at.</p>\n</blockquote>\n<p>I think this is actually just a misunderstanding that llvm doesn't really deal with calling conventions and such. Cause the proper solution generally is to pass a single pointer to the entire struct all the way down the stack. So there shouldn't be any of this copying to begin with.</p>",
        "id": 411388708,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704468983
    },
    {
        "content": "<p>So fundamentally they are passing by value when they should be passing by reference.</p>",
        "id": 411388754,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704469003
    },
    {
        "content": "<p>As such they keep copying over and over again.</p>",
        "id": 411388780,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704469011
    },
    {
        "content": "<p>Also, llvm fastcall should enable slipping the stack for things like this and not following the amd sysv arg passing rules.</p>",
        "id": 411388864,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704469048
    },
    {
        "content": "<p>Also, this is a dangerous microbenchmark</p>",
        "id": 411389045,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704469111
    },
    {
        "content": "<p>Passing 3x the args Will eat Up all of the registers very very quickly in an x86 system. So they will very quickly hit bad perf due to that. Also, passing everything in registers likely means way more shuffling around of data and pushing and popping (as arg lists get longer and functions more complex)</p>",
        "id": 411389176,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704469175
    },
    {
        "content": "<p>Lastly, they explicitly block inlining, which would make small functions like those equivalent. And for larger functions, the cost diminishes quickly.</p>",
        "id": 411389653,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704469342
    },
    {
        "content": "<p>So I think this falls into the category of a bad microbenchmark for the most part</p>",
        "id": 411389720,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704469375
    },
    {
        "content": "<p>Interesting!</p>",
        "id": 411389800,
        "sender_full_name": "Anton",
        "timestamp": 1704469416
    },
    {
        "content": "<p>At the same time, I should clarify, as long as the function doesn't/can't be inlined(or changed to llvm fastcall), that specific benchmark will be faster with the split version. Of course, with less gains the longer the function gets. Also, I guess depending the calling context, it could lead to popping a bunch of stuff to make the function call, but that is unlikely.</p>\n<p>Sysv has exactly 6 registers. So they are using the 6 register perfectly and never put anything on the stack.</p>",
        "id": 411395949,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704471820
    },
    {
        "content": "<p>As a fun note, enabling lto on that example (and thus enabling inlining) is more than 2x faster than having a function call at all.</p>",
        "id": 411395985,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704471836
    },
    {
        "content": "<p>Tangent, <a href=\"https://github.com/jinyus/related_post_gen/\">the related benchmark</a> linked in that post might be interesting to implement in roc (assuming our json parsing is far enough along:</p>\n<ul>\n<li>Read the posts JSON file.</li>\n<li>Iterate over the posts and populate a map containing: tag -&gt; List&lt;int&gt;, with the int representing the post index of each post with that tag.</li>\n<li>Iterate over the posts and for each post:<br>\n     - Create a map: PostIndex -&gt; int to track the number of shared tags<br>\n     - For each tag, Iterate over the posts that have that tag<br>\n     - For each post, increment the shared tag count in the map.</li>\n<li>Sort the related posts by the number of shared tags.</li>\n<li>Write the top 5 related posts for each post to a new JSON file.</li>\n</ul>",
        "id": 411423904,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1704484336
    }
]