[
    {
        "content": "<p>Hey folks, I just opened a <a href=\"https://github.com/roc-lang/roc/pull/5957\">PR</a> to remove an optimisation from the Wasm dev backend but wanted to get feedback on the idea here too.<br>\nWhile Brendan was working on the Zig 0.11 PR, the last issue was a tricky one in Wasm, and I commented that it seemed to be in the most complex part of the Wasm backend. I was actually a bit afraid to touch it.<br>\nBut that code is mainly concerned with a size optimisation, which we could do without.<br>\nSo the PR is to delete the optimisation and all of the book-keeping code we need for it.<br>\nThe diff is <code>+320 -910</code> which is a nice simplification.</p>",
        "id": 400482142,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699258993
    },
    {
        "content": "<p>In theory this makes the generated code more bloated. But it deletes complex code that I'm afraid of. And I have not actually been able to measure the bloat!</p>",
        "id": 400482163,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699259005
    },
    {
        "content": "<p>Disk space for all test_gen binaries with optimisation: 759,592 bytes<br>\nDisk space for all test_gen binaries without optimisation: 759,688 bytes<br>\nSo that's just 96 bytes.</p>",
        "id": 400482223,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699259040
    },
    {
        "content": "<p>This is weirdly small though.</p>",
        "id": 400482278,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699259054
    },
    {
        "content": "<p>There's an example in the PR body for <code>1 + 2 + 3</code> where the optimisation removes 10 instructions, at 2 bytes each, which is 20 bytes. And that's just 1 test out of 1250.</p>",
        "id": 400482443,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699259146
    },
    {
        "content": "<p>Some technical background:</p>\n<p>Each Wasm function can store local variables in one of 3 places:</p>\n<ol>\n<li>the stack machine: every Wasm instruction pushes and pops values from the stack machine, so this is a form of storage</li>\n<li>local variables: store int or float values, referenced by an index number. Sort of act like CPU registers.</li>\n<li>stack memory: we manage a stack data structure in the Wasm module's memory, just like normal assembly does.</li>\n</ol>\n<p>We need to choose one of these 3 places to store each <code>Symbol</code> in the monomorphic IR.<br>\nCurrently on the <code>main</code> branch, we use all 3 in various situations.</p>",
        "id": 400483882,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699259769
    },
    {
        "content": "<p>The PR removes (1) as an option.<br>\nIt turns out to be more complicated than you'd expect to track symbols in the stack machine. Wasm has structured control flow with nested block scopes. So there are instructions like <code>loop</code> rather than just \"jump\" or \"goto\". You can't access a value in a higher scope.</p>",
        "id": 400483886,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699259770
    },
    {
        "content": "<p>After this PR we no longer track what's stored in the stack machine.<br>\nInstead we do a much more direct translation of the mono IR.<br>\nWe translate each <code>let</code> in the IR to:</p>\n<ul>\n<li>an expression (which puts some value on the stack machine)</li>\n<li>and an assignment to a local variable (which removes the value from the stack machine again)<br>\nSo after each <code>let</code> the value stack machine is empty.</li>\n</ul>",
        "id": 400484220,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699259927
    },
    {
        "content": "<p>The drawback is that we are not taking advantage of the stack machine, so we get inefficient code.<br>\nThe advantage is that we are more directly translating the mono IR so our Rust code is much simpler and easier to maintain.</p>",
        "id": 400484446,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699260020
    },
    {
        "content": "<p>There doesn't seem to be much speed advantage, at least in the <code>test_gen</code> tests.<br>\nThe total runtime for <code>cargo test-gen-wasm</code> goes from 7.428s to 7.412s (based on <code>hyperfine</code> with 10 runs).</p>",
        "id": 400484533,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699260062
    },
    {
        "content": "<p>So the main argument is simplicity/maintainability.</p>",
        "id": 400484627,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699260109
    },
    {
        "content": "<p>Frankly, I don't want to be the only one who is able to make changes in this code. I've had less time for Roc in the past year and I'm not sure how my availability is going to fluctuate in the future. So getting rid of something very complex that we don't really need, seems like a good idea.</p>",
        "id": 400485156,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699260332
    },
    {
        "content": "<p>If we decide that we need the size optimisation, it would be much simpler to implement it after generating the instructions for a function. We could probably combine it into an existing pass. I think it would be a lot less code and easier to understand/maintain/debug.</p>",
        "id": 400486265,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1699260835
    },
    {
        "content": "<p>Sounds like a wise decision!</p>",
        "id": 400489335,
        "sender_full_name": "Anton",
        "timestamp": 1699261969
    },
    {
        "content": "<p>Agreed! <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span></p>",
        "id": 400515856,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1699271648
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"431893\">@Brian Carroll</span>, I think that's a really good call!</p>",
        "id": 400515905,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1699271664
    }
]