[
    {
        "content": "<p>I'd like to kill the platform-switching example. I don't think we should try and keep it, or move it to the roc-lang/examples repo. I think it has served it's purpose well, but now we have matured beyond this example, and it's only causing issues for us now.</p>\n<p>I think it was helpful to show how we could have multiple platforms, all with the same API and different hosts written in different languages under the hood. We now have a number of different platforms which I think demonstrate this, for example all of my platform templates have the same Task based API with a single effect and show this same thing.  </p>\n<p>Maybe we can find a better way to surface these platform templates and make them more discoverable. At the moment they are just listed on roc-awesome and not that easy to find. I think we could highlight how they have the same API, but different hosts underneath. Maybe a platform-switching \"guide\" on the website would be helpful here? </p>\n<p>The main issue I have with this specific example, is that it is problematic with the changes to remove host rebuilding from roc and give that responsibility to the platform. It's is also being used for cli tests, but effectively this is just to test the platform rebuilding functionality for each type of host (swift, rust, zig, c etc). </p>\n<p>If we want to keep any of this functionality, we should instead move it into <code>crates/cli/tests</code> with the other cli tests. </p>\n<p>Hopefully though after <a href=\"https://github.com/roc-lang/roc/pull/6859\">the <code>--build-host</code> PR</a>  lands we can instead be removing all the different host rebuilding from roc and we won't need to support that any longer. It would make sense to keep <code>zig</code> as the sole host type just for internal tests, and still keep the platform from a URL tests to ensure we remain compatible with basic-cli/basic-webserver/basic-ssg.</p>",
        "id": 455532847,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1722481653
    },
    {
        "content": "<p>I'd like to keep very simple implementations for a zig and rust platform in the repo itself for testing/development. the others can live elsewhere I think</p>",
        "id": 455587332,
        "sender_full_name": "Folkert de Vries",
        "timestamp": 1722500816
    },
    {
        "content": "<p>I agree that we just don't need it anymore</p>",
        "id": 455613265,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1722508546
    },
    {
        "content": "<p>I'm looking at the CI failures in <a href=\"https://github.com/roc-lang/roc/pull/6859\">https://github.com/roc-lang/roc/pull/6859</a></p>\n<p>And we're in a position where I think platform switching is causing us grief. Specifically, because we're doing some crazy hacks in <code>crates/compiler/build/src/link.rs</code> to have roc cli build the platform host.</p>",
        "id": 480363418,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730692457
    },
    {
        "content": "<p>I think I'd like to rip out platform switching. I have tried to keep it, but I don't think it's worth doing backflips for. I think it's also a really outdated example of how someone should write a platform for roc -- so potentially does more harm than good at this point.</p>",
        "id": 480363483,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730692522
    },
    {
        "content": "<p>I'm going to proceed to rip it out... and see if that helps this PR. I'll do it in one commit so it's easy to revert if we decide we really want to keep it.</p>",
        "id": 480363626,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730692623
    },
    {
        "content": "<p>I'm having another go at trying to keep it -- converting it to a legacy host and an actual crate in the workspace so we can build it using <code>cargo build -p rust-platform</code> before trying to run tests.</p>",
        "id": 480364611,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730693380
    },
    {
        "content": "<p>I think I figured it out. I also learnt some neat no_std tricks for linking and getting rust to produce a static library. Hopefully this works on on our CI machines.</p>",
        "id": 480368851,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730696980
    },
    {
        "content": "<p>If you're still running into issues, then as agreed above, I think it's fine if you rip this out.</p>",
        "id": 480388364,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1730708135
    },
    {
        "content": "<p>I'm taking the current tests failures in the CI to mean that your local fix isn't working in the CI</p>",
        "id": 480388466,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1730708166
    },
    {
        "content": "<p>I was feeling positive... but it's not looking great so far <span aria-label=\"oh no\" class=\"emoji emoji-1f615\" role=\"img\" title=\"oh no\">:oh_no:</span></p>",
        "id": 480388688,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730708280
    },
    {
        "content": "<p>Positivity has gotten you thus far</p>",
        "id": 480388799,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1730708321
    },
    {
        "content": "<p>It really is up to you, but I'd vote for ripping out at this point</p>",
        "id": 480388829,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1730708333
    },
    {
        "content": "<p>Sunk cost, y'know</p>",
        "id": 480388850,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1730708347
    },
    {
        "content": "<p>I like to use the platform switching rust example for investigating bugs with a minimal platform, is there something I can use instead? I also planned on using it to test the nightlies now that the hello world example is gone.</p>",
        "id": 480403389,
        "sender_full_name": "Anton",
        "timestamp": 1730713289
    },
    {
        "content": "<p>Yeah, so we want a minimal rust and zig platform in the repo for testing etc. The zig one is in the cli crate which we use for tests. I'd recommend we use that instead. Also I think this is the better location to store these so we dont confuse people who might expect a more complete example.</p>\n<p>The minimal rust platform is more difficult to achieve I think. I think I'm pretty close with the platform switching rust on the branch rn, but had to spend time with the fam so didn't quite finish that effort.</p>",
        "id": 480412732,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730716104
    },
    {
        "content": "<p>Rust does things to stop prevent people from making bad choices... but sometimes it's really hard to workaround. Like getting rust to generate a static library that includes a <code>main</code> symbol. Thing get interesting when they work one way, but then you go to run cargo another way and it yells at you. It's like workspaces aren't as feature complete or something.</p>",
        "id": 480413370,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730716306
    },
    {
        "content": "<p>We know how to do it using multiple crates ala basic-cli, but I was trying to go for the minimal thing.</p>",
        "id": 480413820,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730716456
    },
    {
        "content": "<p>Another option here that unblocks this PR... is to remove it from the cli tests, and use the zig platform for confirming the nightlies in CI. So basically leave it there and defer decision around removing/keeping for another PR but not blocking this any longer.</p>",
        "id": 480522056,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730752553
    },
    {
        "content": "<p>Hmm, I would guess it would be harder to make the rust platform-switching example work again in the future compared to now when the full picture is in your head</p>",
        "id": 480679800,
        "sender_full_name": "Anton",
        "timestamp": 1730800086
    },
    {
        "content": "<p>It's working, it's just not playing nicely with cargo workspace and CI.</p>",
        "id": 480682666,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730800906
    },
    {
        "content": "<p>So it's not working I guess... <span aria-label=\"upside down\" class=\"emoji emoji-1f643\" role=\"img\" title=\"upside down\">:upside_down:</span></p>",
        "id": 480682817,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1730800935
    }
]