[
    {
        "content": "<p>To enter a newline in the CLI REPL we are using the sequence: ctrl-v + ctrl-j <br>\nThis feels unfamiliar and strange to me, I've never seen it anywhere else. But maybe it's familiar to other people.<br>\nI used ctrl-Enter for the web REPL, because I've seen that in lots of places (including this Zulip chat window!)<br>\nDoes anyone know why we picked this sequence?<br>\nDoes anyone have opinions on it?<br>\nShould we make both REPLs have the same sequence? Which one?</p>",
        "id": 390023602,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1694257593
    },
    {
        "content": "<p>The strange Ctrl-v+Ctrl-J was partly due to <a href=\"https://github.com/kkawakam/rustyline/issues/653\">https://github.com/kkawakam/rustyline/issues/653</a>.<br>\nWe do try to be smart about it, if you hit enter on an incomplete expression we create a new line instead of trying to pass it to the repl.<br>\nBut there still probably are cases where you have complete expression but still want a new line. Because of the linked issue we can't do Ctrl+Enter or Shift+Enter, but I think we could do Ctrl+n for example.</p>",
        "id": 390027123,
        "sender_full_name": "Anton",
        "timestamp": 1694259735
    },
    {
        "content": "<p>OK. That's a pity. The web doesn't have this issue though.<br>\nSo we can either use the same key combo as the CLI to be consistent with that. (Good for people who are very used to the CLI REPL)<br>\nOr keep the ctrl-Enter to be consistent with... everything else. (Good for newcomers or Roc users who don't use the CLI REPL much)</p>",
        "id": 390029371,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1694261306
    },
    {
        "content": "<p>I'd be ok with allowing two combos to do the same thing to get a best of both worlds :)</p>",
        "id": 390030694,
        "sender_full_name": "Anton",
        "timestamp": 1694262367
    },
    {
        "content": "<p>Cool, that's what I was thinking too. We already print out instructions in the CLI one and I'm going to add that to the web one too.</p>",
        "id": 390031286,
        "sender_full_name": "Brian Carroll",
        "timestamp": 1694262810
    },
    {
        "content": "<p>yeah having them be different makes sense to me! <span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 390047726,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1694276649
    }
]