[
    {
        "content": "<p>I have a high-level question -- what is the current state of roc? It seems that things have been in flux for a while, but with the updated module syntax and the <code>!</code> change complete, are we at a point where things may slow down and focus will return to stability and working towards a 0.1 release? i ask because there still seem to be a lot of seg faults and tooling issues (100% from lsp, for example) and i'm trying to understand how i should think about the current short term goals for the language. none of this is an issue, i'm just curious.</p>",
        "id": 446124636,
        "sender_full_name": "drew",
        "timestamp": 1718988739
    },
    {
        "content": "<p>the core of the language feels like it's at a nice spot to me at this point, but i'm definitely not close to the development</p>",
        "id": 446124917,
        "sender_full_name": "drew",
        "timestamp": 1718988810
    },
    {
        "content": "<p>I don't really have an answer, but I think a number of larger pieces would be wanted before a 0.1 release:</p>\n<ol>\n<li>Finishing the module params change</li>\n<li>Effect interpreters (large platform interface change that I think is currently stuck on type system bugs)</li>\n<li>Explicit allocators passed in from the platform </li>\n<li>glue for at least rust being fully usable</li>\n<li>Removal of <code>&lt;-</code>.</li>\n</ol>\n<p>Some likely nice to haves:</p>\n<ol>\n<li>Fixing some performance sharp edges around refcounting and borrow inference.</li>\n<li>Surgical linker fully working on all platforms</li>\n<li>Dev backends fully complete and wired up (still missing a few minor pieces)</li>\n</ol>\n<p>Not sure which of these are true blockers or if I am missing anything, but definitely a solid bit still in flux. That said, most of these don't really effect the look and feel of roc as a language. Most of it is more around platform dev and completeness.</p>",
        "id": 446231049,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1719038623
    },
    {
        "content": "<p>I'd love to track these issues down and make a milestone, I was thinking <code>0.1.0</code> or something. Would that be a bad idea?</p>",
        "id": 446358746,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1719111329
    },
    {
        "content": "<p>personally I’m thinking about 0.1 as something we do when we think there’s enough benefit to justify it</p>",
        "id": 446412477,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1719144180
    },
    {
        "content": "<p>I don’t have a checklist or anything in my mind <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 446412494,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1719144195
    }
]