[
    {
        "content": "<p>I think this rewrite is a great time to also think a little about how the roc compiler can integrate well with external tooling and the language server:<br>\nThings like:</p>\n<ul>\n<li>Could the compiler be designed to be able to serialize enough of its internal info: symbols, ast, etc that the language server, and maybe other exciting tooling could be written in roc?</li>\n<li>There needs to be two modes of error reporting. One for the CLI that includes all info and a snippet and such, and one for the language server that only includes the error as a string and line info. (changing that looked like kind of a nightmare in the current roc compiler)</li>\n<li>Obviously recoverable parsing.</li>\n<li>Probably a few things I've forgotten that I can add when I take a look at the current language server impl.</li>\n</ul>\n<p>I just hadn't seen any discussion of it and wanted to try to make sure it's not forgotten :)</p>",
        "id": 497604495,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738657056
    },
    {
        "content": "<p>I think Richard isn't a fan of tying an external protocol to our compiler:</p>\n<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/channel/316715-contributing/topic/vscode.20extension/near/398902850\">said</a>:</p>\n<blockquote>\n<p>zooming out for a sec, I'm trying to avoid coupling the public <code>roc</code> API to other protocols, so that we don't get in a situation where people are saying \"hey please update the language and do a release ASAP because we're blocked and there's no way for us to unblock ourselves short of a language release.\"</p>\n<p>examples of this include:</p>\n<ul>\n<li>not wanting to offer generating llvm IR because that couples <code>roc</code> to llvm updates</li>\n<li>not wanting to have Unicode segmentation in builtins because that couples <code>roc</code> to Unicode updates</li>\n<li>not wanting to couple <code>roc</code> to lsp for the same reason.</li>\n</ul>\n<p>with that in mind, I wonder if there's a way we could keep the relevant logic in the <code>roc</code> binary but expose it in a way that lsp (and others) can access functionality with it in a way that can be upgraded independently from <code>roc</code> itself - like for example what we do with <code>roc glue</code> and giving it a .roc script that describes what to do</p>\n</blockquote>",
        "id": 497607081,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1738657910
    },
    {
        "content": "<p>But since we're aiming for a single binary that does everything, it'd be really nice to have the same experience as with <code>gleam lsp</code></p>",
        "id": 497607206,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1738657940
    },
    {
        "content": "<p>Well that's why I was hoping that the roc binary itself could expose very low level primitives, symbols, types, ast etc. <br>\nThat way improvements to the language server can occur separately to the language.<br>\nIt seems like that decouples roc from lsp much more, right?</p>",
        "id": 497608110,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738658272
    },
    {
        "content": "<p>Yeah, I'd agree</p>",
        "id": 497608202,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1738658292
    },
    {
        "content": "<p>Sorry, I think I read your message too quickly</p>",
        "id": 497608256,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1738658310
    },
    {
        "content": "<p>I think the plan is for each IR to be nicely serialisable for caching and snapshotting, and also for external tools to integrate with.</p>",
        "id": 497608389,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1738658351
    },
    {
        "content": "<p>I'm not exactly sure how that will look or work. But definitely something I'm keen to explore and understand more to help ensure we dont miss it.</p>",
        "id": 497608482,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1738658391
    },
    {
        "content": "<p>Also I think a language server written in roc would be a really great, \"here is roc doing real things that are non trivial\" example.<br>\nlanguage servers do: </p>\n<ul>\n<li>serialization and deserialization of a very complex spec</li>\n<li>caching and invalidation in response to input</li>\n<li>parallelism </li>\n<li>quite complex data types that require lots of manipulation and \"rooting about in\"</li>\n</ul>",
        "id": 497608805,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738658507
    },
    {
        "content": "<p>oh, interesting... writing the language server in roc. How would that work? as a plugin?</p>",
        "id": 497608999,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1738658579
    },
    {
        "content": "<p>I'm really interested in this idea, it sounds great.</p>",
        "id": 497609206,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1738658645
    },
    {
        "content": "<p>Would that need to be a custom platform?</p>",
        "id": 497609517,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1738658758
    },
    {
        "content": "<p>We can look at how other language servers work. <br>\ni have few ideas, but one I quite like is having the compiler also be a roc platform. <br>\nThat way you guarantee the language server will always work even if you have a different version of the compiler, but it can still release independently of the compiler.</p>\n<p>The compiler could also expose apis over jsonrpc or the like and the language server could communicate that way.</p>",
        "id": 497609941,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738658888
    },
    {
        "content": "<p>I think choosing either one should allow us to switch to the other with very little hassle. <br>\nEventually we should definitely expose both, having your compiler be able to be run as a service lets people build interesting tools with it, but also I think the platform approach would be better for the language server and making it super simple for people to build other tools in roc.</p>",
        "id": 497610341,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738659047
    },
    {
        "content": "<p>When you say the roc compiler, are you thinking the roc cli binary/executable?</p>",
        "id": 497610495,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1738659103
    },
    {
        "content": "<p>Yup. You could start it with a special flag and it goes into \"rpc mode\" where you can send messages back and forth and get stuff out.</p>",
        "id": 497610781,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738659190
    },
    {
        "content": "<p>In the short term, I think a platform for roc would be the best choice though. Again, it's a good way to show off our cool features, with a real word use case</p>",
        "id": 497611080,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738659283
    },
    {
        "content": "<p>yeah it could work like glue</p>",
        "id": 497682193,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738679999
    },
    {
        "content": "<p>where instead of <code>gleam lsp</code> you run something like <code>roc tooling lsp.roc</code></p>",
        "id": 497682433,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738680046
    },
    {
        "content": "<p>and then <code>lsp.roc</code> works like <code>rust-glue.roc</code> in that its platform is provided by the compiler, and <code>lsp.roc</code> plays the role of translating direct function calls to/from the compiler into the language server protocol</p>",
        "id": 497682794,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738680143
    },
    {
        "content": "<p>I think that's a good solution for now. </p>\n<p>In the longer term it may be nice to be able to release changes to the language server without updating roc as a whole (not sure how often you plan to do releases).<br>\nIf so I was thinking we could have a platform that produces it's own standalone binary and uses the compiler as a library. That way the language server can be bumped separate to the compiler because it bundles its own copy of the compiler.</p>",
        "id": 497684037,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738680448
    },
    {
        "content": "<p>I had a chat to <span class=\"user-mention\" data-user-id=\"515757\">@Luke Boswell</span> earlier today about this. <br>\nI think it would be great if we could make the \"roc tooling\" platform be more than just a language server. <br>\nIf we try to keep everything pretty general purpose on the zig side, getting ast, different IR, types, symbols etc, then we could easily create a base for other analysis tools, like linters, or codegen etc. All written in roc</p>",
        "id": 497684665,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738680601
    },
    {
        "content": "<p>yeah I do think that type of thing seems reasonable</p>",
        "id": 497689483,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738681809
    },
    {
        "content": "<p>I like the \"linting\" philosophy where it's not so much about enforcing arbitrary stylistic preferences as it is about project-specific invariants</p>",
        "id": 497690198,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738682030
    },
    {
        "content": "<p>e.g. \"we have decided to move away from doing things in this way that we used to, and the tool's job is to fail the build if that way is used in any new code, with exceptions carved out for old code\"</p>",
        "id": 497690564,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738682132
    },
    {
        "content": "<p>I think one day it would be really cool if we could do things like create linting rules using the refcount IR. <br>\nThat way we could create a lint that says \"hey this platform expects to be able to reuse this buffer, and you're storing an extra reference to it here\"</p>",
        "id": 497691053,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738682253
    },
    {
        "content": "<p>I think it's reasonable to do that on the application side but not the platform side</p>",
        "id": 497691913,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738682465
    },
    {
        "content": "<p>like \"I always want to be reusing this for perf, and if I ever stop doing that here I want to know about it\"</p>",
        "id": 497692017,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738682491
    },
    {
        "content": "<p>as opposed to \"you must only give me one that can be reused or else your build will fail\" - at which point we've added a janky version of Rust's ownership types to Roc <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 497692312,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738682559
    },
    {
        "content": "<p>oh no, I more just meant:<br>\nIf we build a good compiler platform that allows plugins for things like linting, and we expose the right stuff, we could enable a platform author to add little suggestions like that. Not as an error necessarily but as a hint. <br>\nYou know: \"if anyone calls this function, and the variable it's assigned to has multiple references, show a little suggestion that says \"sure you want to do that mate?\"</p>\n<p>I would definitely write one for myself that does: \"if i have a variable called buff and it has multiple references, warn me\"</p>",
        "id": 497694358,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738683024
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281383\">Richard Feldman</span> <a href=\"#narrow/stream/395097-compiler-development/topic/zig.20compiler.20-.20integrate.20with.20tooling/near/497682794\">said</a>:</p>\n<blockquote>\n<p>and then <code>lsp.roc</code> works like <code>rust-glue.roc</code> in that its platform is provided by the compiler, and <code>lsp.roc</code> plays the role of translating direct function calls to/from the compiler into the language server protocol</p>\n</blockquote>\n<p>This really don't make sense to me. Unlike glue, the language server is a bespoke single application.</p>",
        "id": 497710821,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1738687428
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"515757\">Luke Boswell</span> <a href=\"#narrow/stream/395097-compiler-development/topic/zig.20compiler.20-.20integrate.20with.20tooling/near/497608389\">said</a>:</p>\n<blockquote>\n<p>I think the plan is for each IR to be nicely serialisable for caching and snapshotting, and also for external tools to integrate with.</p>\n</blockquote>\n<p>I think we should be really careful of this. The more coupling we expose the less flexible and changeable roc becomes. This sounds like a trivial way to hit hyrum's law really hard.</p>\n<p>Not saying we shouldn't do it, but if we do it, we probably should pick one very explicit cutting point that we think is unlikely to change.</p>",
        "id": 497711319,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1738687564
    },
    {
        "content": "<p>That said, I think both zig and Odin expose parts of their compiler in their standard library, so maybe it isn't too bad.</p>\n<p>I guess a lot of this depends on good versioning guarantees.</p>",
        "id": 497711460,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1738687607
    },
    {
        "content": "<p>Also, this all may fall nice into a libroc workflow where you just use the compiler as a library instead of as an executable</p>",
        "id": 497711804,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1738687705
    },
    {
        "content": "<p>I am strongly with Brendan on this. I would be leery of exposing the full IR. I would like to transform it slightly to include only the info we see external services wanting, recounts symbol locations type info etc. nothing weird and internal if we can avoid it.</p>\n<p>Hopefully that will keep us from having the external API change much.</p>",
        "id": 497711912,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1738687734
    },
    {
        "content": "<p>As a starting point I was thinking of making libroc essentially expose the roc check functionality, and it returns the ResolvedIR (prev Can) or maybe as far as the last IR before code gen ... and making a roc platform that provides that to a roc app aling with Problems. </p>\n<p>I figure this would be all that's required for making an LSP, or something like checkmate, or our playground.</p>",
        "id": 497739169,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1738696807
    },
    {
        "content": "<p>Is this topic a superset of (something we talked about several months ago) wanting to be able to convert raw Roc source code files to/from a serialization format like JSON or YAML etc, powered by something like a first-party JSON Schema? Should I start a new topic?</p>",
        "id": 498868147,
        "sender_full_name": "jan kili",
        "timestamp": 1739223235
    },
    {
        "content": "<p>I think the general idea is to serialise the IR's to an S-expression format, which should then be easy to parse and work with -- I'm not sure about a schema, though I guess once the IR has firmed up that might help standardise it.</p>",
        "id": 498873701,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739225142
    },
    {
        "content": "<p>yes, each IR would have it's own sexpr representation</p>",
        "id": 498873958,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1739225230
    },
    {
        "content": "<p>Which would be very simple</p>",
        "id": 498873976,
        "sender_full_name": "Anthony Bullard",
        "timestamp": 1739225236
    },
    {
        "content": "<blockquote>\n<p>I think the general idea is to serialise the IR's to an S-expression format</p>\n</blockquote>\n<p>Is that for this tooling as well? This tooling wouldn't be using a serialized text at all. It should be directly using some sort of roc tag union representation of the IR.</p>",
        "id": 498877353,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739226500
    },
    {
        "content": "<p>Well making it a format able to be sent outside of zig is pretty essential if we want to build tools for roc in roc. <br>\nSo I'd call it tangentially relevant.</p>",
        "id": 498877752,
        "sender_full_name": "Eli Dowling",
        "timestamp": 1739226666
    },
    {
        "content": "<p>For sure, I was think of text representation vs tag union representation which may be two very different shapes</p>",
        "id": 498886526,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739230091
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"781658\">Anthony Bullard</span> <a href=\"#narrow/stream/395097-compiler-development/topic/zig.20compiler.20-.20integrate.20with.20tooling/near/498873976\">said</a>:</p>\n<blockquote>\n<p>Which would be very simple</p>\n</blockquote>\n<p>Sweet! So could I write a Roc library that helps you \"read/write Roc code\" by mapping+translating typed values (likely mostly Strs, but maybe lots of tags) from/to the raw contents of main.roc.ir_step_5.sexpr.idk files that the compiler writes beforehand / reads later? (Maybe in real time if a platform called the compiler in a certain way?)</p>",
        "id": 498892904,
        "sender_full_name": "jan kili",
        "timestamp": 1739232624
    },
    {
        "content": "<p>I'd like to explore the idea of <code>roc glue</code> -- potentially even becoming something more like <code>roc gen</code> and it could potentially access any or all of the IR's and then we could write plugins (roc scripts) that do things with roc source code really easily. The primary usecase is for things like tooling (e.g. checkmate).</p>",
        "id": 498893332,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739232817
    },
    {
        "content": "<p>If we use a <code>Str</code> and parse the S-expressions on the roc side... it will be much easier than trying to maintain a binding to the roc types for all the IR's.</p>",
        "id": 498893467,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739232863
    },
    {
        "content": "<p>So I imagine a roc package that parses the IR <code>Str</code> and gives us an AST using roc tag unions etc.</p>",
        "id": 498893903,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233052
    },
    {
        "content": "<p>How would we make sure that it always stays in sync with the Zig equivalent? Seems easier to keep this in a Zig library</p>",
        "id": 498894134,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1739233131
    },
    {
        "content": "<p>Then I imagine having a few simple effects available like <code>Stdout.line!</code>, <code>File.write!</code> or <code>Http.send!</code> to do stuff with this.</p>",
        "id": 498894141,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233135
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"461444\">Sam Mohr</span> <a href=\"#narrow/channel/395097-compiler-development/topic/zig.20compiler.20-.20integrate.20with.20tooling/near/498894134\">said</a>:</p>\n<blockquote>\n<p>How would we make sure that it always stays in sync with the Zig equivalent? Seems easier to keep this in a Zig library</p>\n</blockquote>\n<p>I imagine we could fuzz it somehow... we will be using this for glue generation anyway [in my hypothesis here] -- which we would want to be reliable.</p>",
        "id": 498894257,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233181
    },
    {
        "content": "<p>Are the alternatives (b) not having this functionality and (c) having third parties write plugins in Zig?</p>",
        "id": 498894451,
        "sender_full_name": "jan kili",
        "timestamp": 1739233253
    },
    {
        "content": "<p>Sounds about right, with more leaning towards (c)</p>",
        "id": 498894654,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1739233330
    },
    {
        "content": "<p>Or writing bindings to Zig, which seems janky</p>",
        "id": 498894686,
        "sender_full_name": "Sam Mohr",
        "timestamp": 1739233344
    },
    {
        "content": "<p>Note that if we expose things via zig, e.g. (c), we wouldn't want to use the builtins... as they're really our internals and not a very nice abstraction for working with. So if we do expect people to work with zig, it's the same issue where we have a separate thing (zig library) that needs to be maintained and kept in sync.</p>",
        "id": 498894814,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233411
    },
    {
        "content": "<p>If we can standardise on a simple protocol (S-expressions) instead of a library (one blessed language) then it will be much easier for tooling in any language.</p>",
        "id": 498895002,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233469
    },
    {
        "content": "<p>But maybe I'm wrong here... we will need zig code to serialise and deserialise the IR's anyway, and a parser in Roc would be duplicating this effort.</p>",
        "id": 498895382,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233621
    },
    {
        "content": "<blockquote>\n<p>and it could potentially access any or all of the IR's and then we could write plugins</p>\n</blockquote>\n<p>Please no</p>",
        "id": 498895427,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739233631
    },
    {
        "content": "<p>Why not?</p>",
        "id": 498895455,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233644
    },
    {
        "content": "<p>The more exposed our internals are, the more lockdown they are</p>",
        "id": 498895506,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739233666
    },
    {
        "content": "<p>I think we should expose a single cutting point with its own transformed IR and nothing else</p>",
        "id": 498895600,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739233685
    },
    {
        "content": "<p>Huge hit by <a href=\"https://www.hyrumslaw.com/\">hyrum's law</a></p>",
        "id": 498895651,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739233711
    },
    {
        "content": "<p>Ahk... well I guess maybe we just expose the IR after type checking, and then the IR after the full build (which includes refcounting etc)??</p>",
        "id": 498895666,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233718
    },
    {
        "content": "<blockquote>\n<p>well I guess maybe we just expose the IR after type checking</p>\n</blockquote>\n<p>Yeah, something around here is the one point I think we should expose.</p>\n<p>....</p>\n<p>refcounting is technically an internal detail, why do we want to expose it?</p>",
        "id": 498895795,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739233767
    },
    {
        "content": "<p>We need to expose something for generating glue anyway... my hypothesis is that we could also expose something that tooling like checkmate can use too</p>",
        "id": 498895805,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233771
    },
    {
        "content": "<p>Oh, it was the LSP that wanted to know about tail-call or other optimisations. </p>\n<p>I was wondering if we could even write our LSP as a roc plugin?</p>\n<p>Mostly spit-balling here... these aren't really thought through ideas. I just feel like we could use roc scripts to simplify a lot of things for our own tooling.</p>",
        "id": 498895946,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739233826
    },
    {
        "content": "<p>It possible. If we do so, I think we just need to make sure to pick a limited set of cutting points with really clear apis.</p>",
        "id": 498896225,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739233947
    },
    {
        "content": "<p>Potentially even separating them completely from the IR so the IR can change separately from the api (probably required anyway essentially to translate from zig to roc)</p>",
        "id": 498896299,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739233981
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"462053\">JanCVanB</span> <a href=\"#narrow/channel/395097-compiler-development/topic/zig.20compiler.20-.20integrate.20with.20tooling/near/498894451\">said</a>:</p>\n<blockquote>\n<p>Are the alternatives (b) not having this functionality and (c) having third parties write plugins in Zig?</p>\n</blockquote>\n<p>d. standard c api shared libaries</p>",
        "id": 498896544,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739234075
    },
    {
        "content": "<p>also, <code>roc glue</code> does not support effects by design, because it means you know it is always 100% harmless to run anyone's glue script</p>",
        "id": 498896916,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739234225
    },
    {
        "content": "<p>all it's going to do is to spit out files into the directory you requested, because that's all it knows how to do <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 498896967,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739234247
    },
    {
        "content": "<p>My gut feeling here is that we should kick the tooling can down the road a little further -- and option (d) aka <code>libroc</code> is probably the best option, but there's a lot of design work around the interpreter etc that would be good to understand first.</p>",
        "id": 498897145,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1739234316
    },
    {
        "content": "<p>that is actually option (e) techincally. For (d) I meant that the compiler could run <code>liblsp.so</code> instead of making a roc interface for the lsp.</p>",
        "id": 498898607,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739234947
    },
    {
        "content": "<p>but yeah, I think this part of tooling, we should wait on.</p>",
        "id": 498898641,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739234966
    },
    {
        "content": "<p>First we should figure out the best abstraction for glue (in the new compiler) and learn from wiring that up happily</p>",
        "id": 498898668,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739234981
    },
    {
        "content": "<p>Then we should revisit exposing things specifically thinking of the LSP use case</p>",
        "id": 498898801,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739235034
    },
    {
        "content": "<p>Finally we should think if that can be expanded to more general use cases.</p>",
        "id": 498898833,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739235048
    },
    {
        "content": "<p>That is at least roughly how I would push on it</p>",
        "id": 498898842,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739235055
    },
    {
        "content": "<p>honestly, I've been more tempted to think that compilers should be built lsp-first and out. but maybe that's crazy. not saying we should, I don't think there's enough precedence to justify it. but I get this feeling that at this point a language server ends up inevitable and having a good one makes all the difference in terms of adoption. considering how most people actually spend more time interacting with the LSP than the cli, it kinda makes sense to focus on it first and with highest priority. the cli pass would largely end up being for CI most of the time.</p>",
        "id": 499145183,
        "sender_full_name": "Lucas Rosa",
        "timestamp": 1739333819
    },
    {
        "content": "<p>to be honest, I'm not sure how different we'll want it to be</p>",
        "id": 499146317,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739334440
    },
    {
        "content": "<p>here's a sketch of how it could look:</p>\n<ul>\n<li>for the <code>roc check</code> phases of the compiler (which is all that language servers care about) we're already compiling each module separately, with its data structures stored in its own arena so we can serialize them to/from disk easily</li>\n<li>we also know the full module dependency graph statically, and it's a DAG (or could be converted to one if we were to allow cyclic imports)</li>\n<li>putting these together, we can essentially start with a CLI build, then we have everything in memory, and whenever a module changes, we can invalidate the relevant parts of the graph, reset their arenas, and redo the relevant work to get their info up to date again</li>\n</ul>",
        "id": 499146821,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739334729
    },
    {
        "content": "<p>at that point we have all the parsing, canonical IR, and type info in memory and up to date...so we can expose an interface to ask questions about that</p>",
        "id": 499146898,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739334794
    },
    {
        "content": "<p>maybe I'm missing something, but I don't really understand what specific advantages a fundamentally \"query-based\" compiler architecture would have over that <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 499147005,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739334859
    },
    {
        "content": "<p>What you're describing is a manually-orchestrated query-based compiler architecture</p>",
        "id": 499147104,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1739334946
    },
    {
        "content": "<p>I guess? The relevant part to me is that it sounds like it has about 98% code reuse with the batch compiler <span aria-label=\"big smile\" class=\"emoji emoji-1f604\" role=\"img\" title=\"big smile\">:big_smile:</span></p>",
        "id": 499147280,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739335083
    },
    {
        "content": "<p>Also - in the context where you need to potentially do type inference globally, the more traditional query-based architecture doesn't really do much for you. That's most convenient where you have very clear cut-points in the graph (e.g. function boundaries)</p>",
        "id": 499147347,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1739335115
    },
    {
        "content": "<p>(side note: I would like to explore automatically carving out such boundaries based on where type annotations occur in the source code)</p>",
        "id": 499147404,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1739335161
    },
    {
        "content": "<p>like when I watched <a href=\"https://youtu.be/wSdV1M7n4gQ?si=fLvwTvEwHPePso8H\">Anders talking about C#'s Roslyn compiler architecture</a> years ago, or when I looked at salsa in Rust, they seem wildly different architecturally</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"wSdV1M7n4gQ\" href=\"https://youtu.be/wSdV1M7n4gQ?si=fLvwTvEwHPePso8H\"><img src=\"https://uploads.zulipusercontent.net/404da31922f3d9243de8cbd5761e5da5527cc554/68747470733a2f2f692e7974696d672e636f6d2f76692f77536456314d376e3467512f64656661756c742e6a7067\"></a></div>",
        "id": 499147428,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739335181
    },
    {
        "content": "<p>If you squint hard enough, it's the same</p>",
        "id": 499147577,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1739335281
    },
    {
        "content": "<p>the thing is, my assumption is that rerunning type checking on an individual module will be so fast it won't matter, as long as we don't have to redo any work in other modules to do it - which is already the case unless you're doing something like a rename of an exposed thing</p>",
        "id": 499147580,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739335286
    },
    {
        "content": "<p>Agree that we should make the batch case super duper fast as a first priority, and only fall back to other strategies when that clearly _can't_ keep up.</p>",
        "id": 499147677,
        "sender_full_name": "Joshua Warner",
        "timestamp": 1739335350
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"281383\">@Richard Feldman</span> yea makes sense, it's probably not much different, especially if things are just fast enough</p>",
        "id": 499312200,
        "sender_full_name": "Lucas Rosa",
        "timestamp": 1739388513
    },
    {
        "content": "<p>just vague musings I've had lately on my part</p>",
        "id": 499312304,
        "sender_full_name": "Lucas Rosa",
        "timestamp": 1739388544
    },
    {
        "content": "<p>yeah like if we can single-threaded <code>roc check</code> a file in under 1 ms per 2K lines of code, then as long as we have uninterrupted access to a CPU core, we can do that at 120fps for all but the top 1% of humongous individual files</p>",
        "id": 499314631,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1739389250
    },
    {
        "content": "<p>I guess it depends on the speed of cross file dependency resolution with cached can IR. That likely will get slower in large projects</p>",
        "id": 499349438,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1739403729
    }
]