[
    {
        "content": "<p>Hey y'all! Been a bit preoccupied with other stuff lately. I have a q or two regarding the rewrite in Zig: is the surgical linker rewrite on the roadmap too? Trying to judge the landscape before committing to potentially pointlessly advancing Rust implementation if it's gonna get rewritten in Zig anyhow. FWIW getting the surgical linker on macOS working in Zig should be much simpler (famous last words) ;-)</p>",
        "id": 502874949,
        "sender_full_name": "Jakub Konka",
        "timestamp": 1740931946
    },
    {
        "content": "<p>So the hope is that the surgical linker will be fully removed from the critical path for a good experience with Roc. As such, it becomes optional to port. Instead, the default Roc flow will use an interpretter (no object files or linking except for a small shim shared library to force a platform to launch the interpretter). The shim only has to built on first run of the platform, so linking costs don't really matter. After that, the interpretter gives a fast dev feedback loop. There will still be an optimized roc flow using llvm. Given this flow will be much rarer to run and waiting on llvm anyway, it is not too important for it to have fast link times.</p>\n<p>With the rewrite plans, we essentially are nixing the need for dev backends and the surgical linker. <span aria-label=\"fingers crossed\" class=\"emoji emoji-1f91e\" role=\"img\" title=\"fingers crossed\">:fingers_crossed:</span> the interpretter works as good as we hope for dev builds.</p>",
        "id": 502885992,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1740939462
    },
    {
        "content": "<p>Oh wow, that sounds great actually! Less complexity is always welcome!</p>",
        "id": 502891378,
        "sender_full_name": "Jakub Konka",
        "timestamp": 1740943063
    },
    {
        "content": "<p>So let me try and understand the new approach a little bit more. Who's defining the shim?</p>",
        "id": 502891845,
        "sender_full_name": "Jakub Konka",
        "timestamp": 1740943382
    },
    {
        "content": "<p>Yeah, so the idea is that we still fit into the same box that we would setup for llvm. So the platform is calling a function with cffi that has know types for every arg and the return type.</p>\n<p>The shim, is just a function that goes from that representation to a tagged representation for the interpretter. It will then call the interpretter (which will just be a shared library with a c abi where everything is tagged).</p>\n<hr>\n<p>The shim is essentially platform specific. The platform already knows the exact abi it expects roc to fit into. My looking at the entry point roc functions, we can build the shim. I assume we would create it right after downloading a platform (though I guess we could actually include it as part of the platform packaging step).</p>",
        "id": 502894514,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1740945313
    },
    {
        "content": "<p>I still have to fully think about the details of the linking story. I think in the perfect world, a platform would be a static library that contains a main function and every dependency (or instructions to get dependencies and required linker flags). Roc would really just be running the linking command specified by the platform with either a shim object file or a fully optimized llvm object file.</p>",
        "id": 502894797,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1740945501
    },
    {
        "content": "<p>Also this might help <a href=\"https://github.com/lukewilliamboswell/roc-platform-template-zig/tree/calling-roc\">https://github.com/lukewilliamboswell/roc-platform-template-zig/tree/calling-roc</a></p>",
        "id": 502895132,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1740945723
    },
    {
        "content": "<p>Brendan and I spent some time exploring ideas for the new way we are planning for calling roc.</p>",
        "id": 502895183,
        "sender_full_name": "Luke Boswell",
        "timestamp": 1740945754
    }
]