[
    {
        "content": "<p>I don't like the way, the current version of Roc handles panics. Maybe this is something you could rethink with the new compiler.</p>\n<p>The current way is, that the platform has to implement <code>roc_panic</code>. It can return some message to the user and then exit the process. This works nice for a use case like basic-cli. But it is problematic for a webserver, that should continue, even if there is one problematic request. I think, it is also a problem, when Roc is used as a plugin language. I don't think a plugin should be able to kill a process, by writing something like <code>5 / 0</code>.</p>\n<p>The current solutions is, that the platform has to use something like libunwind or longjmp to handle the panic. This is difficult and error prone for a platform author. I am not sure, if it is even possible to do in all possible host-languages. For example, I don't know how to do it in Go. </p>\n<p>My question is, if the handling of panics could be done on the Roc-side and if a panic happens, an error is returned to the platform as a value.</p>\n<p>This would require Roc to generate panic-handling in all functions, that are exported to the host. The generated functions like <code>roc__ForHost_1_exposed_generic</code> would return an value, that tells the platform, if an error happens.</p>\n<p>I requested something similar <a href=\"#narrow/channel/304641-ideas/topic/Return.20an.20error.20on.20allocation.20error\">here</a>. I hope its ok that I push this topic with a more general angle.</p>",
        "id": 498054125,
        "sender_full_name": "Oskar Hahn",
        "timestamp": 1738827425
    },
    {
        "content": "<p>eventually I think it would be great if we got to a point where whenever the host calls a Roc function, it gets back a <code>Result</code> that's an <code>Err</code> if the call crashed, and the call automatically did all refcount decrements necessary on the way out</p>",
        "id": 498153751,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738857148
    },
    {
        "content": "<p>however, doing this efficiently basically requires doing C++ exceptions, and when Folkert and I had that system implemented in 2019 or 2020, we hit so many problems with it that we ended up replacing it with the current system just because we could actually get it to work right</p>",
        "id": 498154064,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738857231
    },
    {
        "content": "<p>so I think it's the nicest goal to aim for eventually, but I think there's a separate question of whether right now is the best time to try it again, or whether we should revisit it sometime after 0.1.0</p>",
        "id": 498154302,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738857294
    },
    {
        "content": "<p>if anyone wants to explore it now, I'm open to that, but I want to start with the caution that we went down this road before and reverted it because we couldn't get it to work correctly <span aria-label=\"sweat smile\" class=\"emoji emoji-1f605\" role=\"img\" title=\"sweat smile\">:sweat_smile:</span></p>",
        "id": 498154576,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738857364
    },
    {
        "content": "<p>I definitely want to make sure the new llvm backend has lots of debug info. I might look into adding eh frames and dwarf frame info as well, but I'm guess I will find it overly complex and punt it</p>",
        "id": 498162996,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1738859548
    },
    {
        "content": "<p>If we don't have full exception unwinding that cleans up state, I don't think this is worth having at all and we should leave it to the platform to setjmp longjmp if they want to.</p>",
        "id": 498163171,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1738859592
    },
    {
        "content": "<p>I do think that long term having opt in for this would be great. I assume any platform that just wants to crash or uses an arena for allocation won't ever want this.</p>",
        "id": 498163494,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1738859682
    },
    {
        "content": "<p>that's fair too</p>",
        "id": 498165764,
        "sender_full_name": "Richard Feldman",
        "timestamp": 1738860319
    }
]