[
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"364014\">@Georges Boris</span> mentioned that it took a while to find the name of a builtin function to do something you have in mind.<br>\nIt might be good to keep track of functions commonly used for advent of code, so we can list them in a document, perhaps with minimal examples as well.</p>",
        "id": 302071221,
        "sender_full_name": "Anton",
        "timestamp": 1664806166
    },
    {
        "content": "<p>A general AdventOfCode.md with tips would probably be valuable as well.</p>",
        "id": 302071376,
        "sender_full_name": "Anton",
        "timestamp": 1664806214
    },
    {
        "content": "<p>Something like <a href=\"https://aplcart.info/\">https://aplcart.info/</a> might be useful, even if just a static list for now. Otherwise, maybe a list of common other names for functions would be useful (i think we have a partial list like this). Also, we probably should promote <a href=\"http://roc-lang.org/builtins/List\">roc-lang.org/builtins/List</a> more. Probably should make the link work directly instead of making it a requirement to go to a specific module.</p>",
        "id": 302071957,
        "sender_full_name": "Brendan Hansknecht",
        "timestamp": 1664806396
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"361169\">@Anton</span> yup! both List.walk and List.len - it was easy finding them but the short name for length tricked me a bit and I've never seen \"walk\" used before as foldl/reduce but I could sort of guess.</p>",
        "id": 302073431,
        "sender_full_name": "Georges Boris",
        "timestamp": 1664806872
    },
    {
        "content": "<p>Another piece of this that would be nice is searching for specific functionality. Popular languages have the power of Google on their side, but things like Hoogle help too. For instance, I was trying to find if any of the <code>Str -&gt; Num</code> functions have the option of taking a <code>radix</code> param to parse a binary string representation to a decimal integer. e.g. elixirs <code>String.to_integer(n, 2)</code>. I couldn't find one, but correct me if I'm wrong.</p>",
        "id": 302077499,
        "sender_full_name": "Mike Kalvas",
        "timestamp": 1664808096
    },
    {
        "content": "<p>We have a docs site?! If I knew this before, I forgot it. We should link it somewhere...</p>",
        "id": 302081720,
        "sender_full_name": "jan kili",
        "timestamp": 1664809289
    },
    {
        "content": "<p>It's linked in the github README under \"some docs for the standard library\", which is where I found it.</p>",
        "id": 302082405,
        "sender_full_name": "Mike Kalvas",
        "timestamp": 1664809483
    },
    {
        "content": "<p>Oh, awesome, my bad</p>",
        "id": 302082604,
        "sender_full_name": "jan kili",
        "timestamp": 1664809555
    },
    {
        "content": "<p>I've made a PR to make the docs link stand out more.</p>",
        "id": 302084724,
        "sender_full_name": "Anton",
        "timestamp": 1664810161
    }
]